[{"url":"https://www.casadocodigo.com.br/products/livro-metricas-ageis","nome":"Métricas Ágeis: Obtenha melhores resultados em sua equipe","img":"/covers/1LlcgWKh__jzqodxR2OcWo8YohpsnMDP_jXYwOg2gA8_large.jpg?v=1496438774","nomeExibicao":"Métricas Ágeis","title":"Métricas Ágeis","sub":"Obtenha melhores resultados em sua equipe","author":"Raphael Donaire Albino","content":"Em um meio onde queremos entregar melhores produtos de software para os clientes e usuários, torna-se muito relevante incluir em nosso repertório formas de monitorar a eficiência do processo de construção de software. Mas, afinal, por que você deve aprender sobre métricas e visualizações do processo de desenvolvimento software? Em um ambiente ágil, métricas podem ajudar a analisar a saúde do seu processo de construção, fornecendo dados históricos reais a partir dos quais é possível projetar cenários para as entregas, tendo um olhar mais concreto sobre o desenvolvimento e o atendimento de demandas.\nNeste livro, Raphael Albino traz um guia de aprendizado e boas práticas para lhe trazer uma maior visibilidade do seu trabalho e aumentar a previsibilidade das suas entregas. Durante a leitura, você vai compreender o universo que suporta um processo ágil; analisar os desafios de quem busca gerenciar o trabalho em progresso; visualizar e interpretar o tempo que as demandas têm levado no seu processo; acompanhar a cadência de entrega; avaliar a saúde do seu processo; e, por fim, acompanhar e projetar cenários para a entrega de um escopo.","category":"business","subcategory":"Agile"},{"url":"https://www.casadocodigo.com.br/products/livro-xp-extreme-programming","nome":"eXtreme Programming: Práticas para o dia a dia no desenvolvimento ágil de software","img":"/covers/MWv_cGrvQEiSB16qd6Qrr7_29jPyP0tUVVlSsQ2kAIQ_size_1024x768_size_mode_2_large.jpeg?v=1438803579","nomeExibicao":"eXtreme Programming","title":"eXtreme Programming","sub":"Práticas para o dia a dia no desenvolvimento ágil de software","author":"Daniel Wildt, Dionatan Moura, Guilherme Lacerda, Rafael Helm","content":"Por que projetos falham? Comunicação insatisfatória com o cliente, um empurra a culpa para o outro, tempo desperdiçado, falta de testes e retrabalho... Estas são cenas corriqueiras em um time de desenvolvimento de software. E qual a solução?\n\nNeste livro, Daniel Wildt, Dionatan Moura, Guilherme Lacerda e Rafael Helm mostrarão que na verdade não se trata de um único método, mas de um conjunto de práticas que, se bem combinadas, complementam-se em uma sinergia que envolve tanto os membros de dentro do time como o contato destes com o cliente. Conheça práticas de eXtreme Programming e, tendo como base princípios ágeis, desenvolva seus principais valores: comunicação, feedback, simplicidade, coragem e respeito.","category":"business","subcategory":"Agile"},{"url":"https://www.casadocodigo.com.br/products/livro-scrum-360","nome":"Scrum 360: Um guia completo e prático de agilidade","img":"/covers/scrum360-featured_large.png?v=1431473391","nomeExibicao":"Scrum 360","title":"Scrum 360","sub":"Um guia completo e prático de agilidade","author":"Jorge Audy","content":"Trabalhar com agilidade não é fácil. Fazer com que um time inteiro trabalhe de forma ágil, entregando resultados, produzindo de forma plena e sem impedimentos é muito mais difícil. Justamente para isso temos o Scrum, uma metodologia para gerenciamento de projetos que o torna produtivo.\n\nNesse livro, Jorge Audy vai ensinar de forma objetiva e prática a metodologia, mostrando como ela se cruza com outras práticas, como XP, PMBOK, Lean. Além de também formar no leitor a base dos princípios ágeis, pré-requisito para qualquer gerente de projetos do mercado contemporâneo.","category":"business","subcategory":"Agile"},{"url":"https://www.casadocodigo.com.br/products/livro-agile","nome":"Agile: Desenvolvimento de software com entregas frequentes e foco no valor de negócio","img":"/covers/agile-featured_large.png?v=1411485880","nomeExibicao":"Agile","title":"Agile","sub":"Desenvolvimento de software com entregas frequentes e foco no valor de negócio","author":"André Faria Gomes","content":"As diversas metodologias ágeis que formam o tão falado \"Agile\" são hoje uma das maneiras mais eficientes de guiar um projeto do ínicio ao fim, sem complicações e mantendo o tempo inteiro o foco na entrega de valor para o cliente.\n\nNeste livro, André Faria Gomes, renomado coach e líder de equipes, explica como os diferentes sabores de Agile podem fazer um projeto de sucesso.\n\nAprenda como o Kanban, XP e Scrum podem ser usados em conjunto e onde cada um dos métodos se complementa, além de conhecer dicas para adotar as metodologias no seu dia a dia de trabalho.","category":"business","subcategory":"Agile"},{"url":"https://www.casadocodigo.com.br/products/livro-scrum","nome":"Scrum: Gestão ágil para projetos de sucesso","img":"/covers/cover_large.jpeg?v=1465238631","nomeExibicao":"Scrum","title":"Scrum","sub":"Gestão ágil para projetos de sucesso","author":"Rafael Sabbagh","content":"Nova edição atualizada e ampliada.\nScrum superou métodos tradicionais e tornou-se a forma mais bem-sucedida de gestão de projetos de desenvolvimento de software.\nEste livro mostra como os papéis, artefatos, eventos e regras do Scrum, aliados a diversas práticas já consagradas, podem ajudar organizações a entregar valor frequentemente para seus clientes com menos riscos, com menor desperdício e com maior qualidade, visibilidade e produtividade.\nNa nova edição, uma revisão completa e atualização do conteúdo, capítulos adicionais sobre temas importantes (incluindo inicialização de projetos e contratos com Scrum), a opinião do autor sobre tópicos importantes, uma melhor organização e mais figuras.","category":"business","subcategory":"Agile"},{"url":"https://www.casadocodigo.com.br/products/vale-presente","nome":"Vale presente Casa do Código","img":"/covers/vale-presente-CDC_large.png?v=1451330431","nomeExibicao":"Vale Presente","title":"Vale presente Casa do Código","sub":"","author":"Casa do Código","content":"É sempre difícil escolher algo para seu amigo que trabalha com tecnologia. A Casa do Código possui um acervo de livros e e-books que vai agradar a todos. Não perca mais seu tempo escolhendo o presente de aniversário e de natal de seu colega.\nO presenteado pode também optar pelo livro impresso, o valor do vale presente só não abate o frete.\nAssim que você realizar a compra do vale presente, basta acessar http://valepresente.casadocodigo.com.br e preencher os dados para presentear seu amigo!","category":"business","subcategory":"Agile"},{"url":"https://www.casadocodigo.com.br/products/livro-metricas-ageis","nome":"Métricas Ágeis: Obtenha melhores resultados em sua equipe","img":"/covers/1LlcgWKh__jzqodxR2OcWo8YohpsnMDP_jXYwOg2gA8_large.jpg?v=1496438774","nomeExibicao":"Métricas Ágeis","title":"Métricas Ágeis","sub":"Obtenha melhores resultados em sua equipe","author":"Raphael Donaire Albino","content":"Em um meio onde queremos entregar melhores produtos de software para os clientes e usuários, torna-se muito relevante incluir em nosso repertório formas de monitorar a eficiência do processo de construção de software. Mas, afinal, por que você deve aprender sobre métricas e visualizações do processo de desenvolvimento software? Em um ambiente ágil, métricas podem ajudar a analisar a saúde do seu processo de construção, fornecendo dados históricos reais a partir dos quais é possível projetar cenários para as entregas, tendo um olhar mais concreto sobre o desenvolvimento e o atendimento de demandas.\nNeste livro, Raphael Albino traz um guia de aprendizado e boas práticas para lhe trazer uma maior visibilidade do seu trabalho e aumentar a previsibilidade das suas entregas. Durante a leitura, você vai compreender o universo que suporta um processo ágil; analisar os desafios de quem busca gerenciar o trabalho em progresso; visualizar e interpretar o tempo que as demandas têm levado no seu processo; acompanhar a cadência de entrega; avaliar a saúde do seu processo; e, por fim, acompanhar e projetar cenários para a entrega de um escopo.","category":"business","subcategory":"Gestao"},{"url":"https://www.casadocodigo.com.br/products/livro-do-jeito-certo","nome":"Do jeito certo: Gestão de produtos no mundo das startups","img":"/covers/eBook-Making-it-right-traduzido_large.jpg?v=1525721591","nomeExibicao":"Do jeito certo","title":"Do jeito certo","sub":"Gestão de produtos no mundo das startups","author":"Rian van der Merwe","content":"Gestão de produtos é uma das carreiras mais exaustivas, emocionantes, estressantes e recompensadoras que existem. Não é para os fracos do coração. É para pessoas que desejam mover montanhas. Alguns são completamente engolidos por esse trabalho, mas outros encontram uma revigoração infinita e uma paixão pelo ritmo, pelo impacto, pela glória, e pelo enorme potencial tanto de fracasso como de sucesso que ele traz. Não há nenhum emprego como este, e este é um livro que vai ajudá-lo a fazer disso o seu trabalho.\nO livro Making it right, de Rian van der Merwe, ganha sua tradução para o português em Do jeito certo, e vem:\n1. Definir os papéis e responsabilidades dos gerentes de produtos no contexto do desenvolvimento de software. \n\n2. Explicar por que gestão de produtos é um papel essencial em qualquer organização, e quais características os gerentes devem procurar quando forem contratar gerentes de produtos.\n\n3. Fornecer um framework e um guia prático para gestão de produtos estratégica; um framework que detalhe os elementos do planejamento do produto e a execução do produto que compõem o dia a dia de trabalho de um gerente de produtos.","category":"business","subcategory":"Gestao"},{"url":"https://www.casadocodigo.com.br/products/livro-lean-enterprise","nome":"Lean Enterprise: Como empresas de alta performance inovam em escala","img":"/covers/W3JO_ox0eK5rIoNORSH4y45lqrnZ-AK2QpWIujjcQg_large.jpg?v=1470949466","nomeExibicao":"Lean Enterprise","title":"Lean Enterprise","sub":"Como empresas de alta performance inovam em escala","author":"Jez Humble, Joanne Molesky, Barry O'Reilly","content":"Para prosperar no mundo digital, a transformação deve ser mais que voltada à tecnologia — todo mundo dentro da empresa deve trabalhar coletivamente para se adaptar. Conheça o livro que está reorganizando a corporação para a era digital. Lean Enterprise está destinado a ser a referência clássica e oficial sobre como empresas planejam, organizam, implementam e medem seu trabalho. \n\nHumble, Molesky e O'Reilly escreveram um guia de fácil leitura que desmistifica o sucesso de empresas Lean, de modo que todo mundo possa entender e aplicar, descrevendo como empresas podem vencer no mercado enquanto aproveitam e desenvolvem as capacidades dos funcionários. Qualquer líder de negócio que se preocupe com criar vantagem competitiva por meio da tecnologia e construir uma cultura de inovação precisa ler este livro.","category":"business","subcategory":"Gestao"},{"url":"https://www.casadocodigo.com.br/products/livro-jornada-empreendedor","nome":"A jornada do empreendedor: O herói da nossa Era","img":"/covers/EeWu4o4nvz9o71nSFnXAhPmu4BiMyGP7x5Pz0tJU3dk_large.jpg?v=1469752875","nomeExibicao":"A jornada do empreendedor","title":"A jornada do empreendedor","sub":"O herói da nossa Era","author":"Edson Marqueto Rigonatti, Laura Mello Constantini, Martino Bagini","content":"Uma jornada é uma busca por um ideal, por um grande desafio. Para uns, a motivação é a recompensa financeira. Para outros, o desejo de fazer algo maior que si mesmos. Seja qual for o seu objetivo, para chegar lá você precisará de força de vontade sobre-humana. O empreendedor deve ser um verdadeiro herói.\nNeste livro você seguirá 47 passos fundamentais para alcançar seus objetivos com sucesso.\n\nA cada passo, você e seu time estarão mais preparados para trilhar seus próprios caminhos, sabendo como adaptar-se a cada demanda com um processo mais aprimorado. Nós estaremos ao seu lado, com bússola e mapa na mão.","category":"business","subcategory":"Gestao"},{"url":"https://www.casadocodigo.com.br/products/livro-gestao-produtos","nome":"Gestão de produtos de software: Como aumentar as chances de sucesso do seu software","img":"/covers/eBook-Gestao-Produtos_c1f1bc3e-bfe9-4895-b1cd-bcb953c46760_large.jpg?v=1502143769","nomeExibicao":"Gestão de Produtos","title":"Gestão de produtos de software","sub":"Como aumentar as chances de sucesso do seu software","author":"Joaquim Torres","content":"Cuidar do andamento de um projeto de software é uma tarefa que requer diversos conhecimentos. Saber lidar com pressão de clientes, anseios do time de desenvolvimento, necessidades da equipe de vendas. Como negociar prazos? O que deve ser desenvolvido primeiro no roadmap do meu produto? Como aumentar a retenção de usuários? Essas e várias outras questões perseguem o gestor de produtos no seu dia a dia.\n\nNeste livro, Joaquim Torres responde essas perguntas e mostra como é o dia a dia do trabalho de um gestor de produtos, mostrando todos os conceitos necessários para quem quer um dia ter esse papel na sua empresa.","category":"business","subcategory":"Gestao"},{"url":"https://www.casadocodigo.com.br/products/vale-presente","nome":"Vale presente Casa do Código","img":"/covers/vale-presente-CDC_large.png?v=1451330431","nomeExibicao":"Vale Presente","title":"Vale presente Casa do Código","sub":"","author":"Casa do Código","content":"É sempre difícil escolher algo para seu amigo que trabalha com tecnologia. A Casa do Código possui um acervo de livros e e-books que vai agradar a todos. Não perca mais seu tempo escolhendo o presente de aniversário e de natal de seu colega.\nO presenteado pode também optar pelo livro impresso, o valor do vale presente só não abate o frete.\nAssim que você realizar a compra do vale presente, basta acessar http://valepresente.casadocodigo.com.br e preencher os dados para presentear seu amigo!","category":"business","subcategory":"Gestao"},{"url":"https://www.casadocodigo.com.br/products/livro-marketing-conteudo","nome":"Marketing de conteúdo: Estratégias para entregar o que seu público quer consumir","img":"/covers/LmEF4CZHTvOQvVcAsRRrK_Z934Qg0SBfvgcr504Zo5I_large.jpg?v=1514400743","nomeExibicao":"Marketing de conteúdo","title":"Marketing de conteúdo","sub":"Estratégias para entregar o que seu público quer consumir","author":"Jonathan Lamim Antunes","content":"Em um mundo no qual tudo é informação, saber entregá-la no melhor formato ao seu público é uma das chaves do sucesso para uma estratégia de marketing de conteúdo. Através dele, as marcas podem, além de conhecer melhor o seu público, entregar exatamente o que ele quer consumir, tanto no que diz respeito ao conteúdo como ao produto.\n\nNeste livro, Jonathan Lamim compartilha seus conhecimentos sobre marketing de conteúdo para que você possa realizar um trabalho de qualidade e que gere resultados, seja como um consultor freelancer, atuando dentro de alguma empresa de marketing, ou no setor de marketing de empresas de outros ramos. Você verá como desenvolver técnicas como estudos de personas e fatores de ranqueamento de SEO, junto das melhores estratégias para criar conteúdo de valor e medir os resultados de seu plano de marketing.","category":"business","subcategory":"Marketingdigital"},{"url":"https://www.casadocodigo.com.br/products/livro-seo","nome":"SEO Prático: Seu site na primeira página das buscas","img":"/covers/seo-featured_large.png?v=1426525491","nomeExibicao":"SEO na Prática","title":"SEO Prático","sub":"Seu site na primeira página das buscas","author":"Adriano Almeida","content":"Quando foi a última vez que você fez uma busca no Google? Provavelmente há poucos minutos atrás. Hoje em dia, para que seu negócio apareça, tenha destaque e ganhe novos clientes, não é mais necessário apenas ter um site. É preciso fazê-lo aparecer bem nas buscas. Justamente para isso, você precisa entender de Search Engine Optimization.\n\nNeste livro, Adriano Almeida ensina as principais técnicas de SEO, para que seu site tenha destaque nas buscas. Você vai aprender desde como fazer um processo de keyword research correto, até as otimizações on-page com melhorias no HTML, passando pelas otimizações off-page e técnicas de link building, além de aprender a configurar e usar diversas ferramentas úteis no dia a dia de qualquer administrador de um site.\n\nEste é um livro fundamental para qualquer profissional de internet moderno. De desenvolvedores a profissionais de marketing digital, se você busca resultados, deveria lê-lo.\n\nPrefácio por Cléo Silva - @cleomorgause","category":"business","subcategory":"Marketingdigital"},{"url":"https://www.casadocodigo.com.br/products/vale-presente","nome":"Vale presente Casa do Código","img":"/covers/vale-presente-CDC_large.png?v=1451330431","nomeExibicao":"Vale Presente","title":"Vale presente Casa do Código","sub":"","author":"Casa do Código","content":"É sempre difícil escolher algo para seu amigo que trabalha com tecnologia. A Casa do Código possui um acervo de livros e e-books que vai agradar a todos. Não perca mais seu tempo escolhendo o presente de aniversário e de natal de seu colega.\nO presenteado pode também optar pelo livro impresso, o valor do vale presente só não abate o frete.\nAssim que você realizar a compra do vale presente, basta acessar http://valepresente.casadocodigo.com.br e preencher os dados para presentear seu amigo!","category":"business","subcategory":"Marketingdigital"},{"url":"https://www.casadocodigo.com.br/products/livro-learning","nome":"Learning 3.0: Como os profissionais criativos aprendem","img":"/covers/felpddSkN3hHk1dmMBpBjw502Nv4RXZ4wdcHM1pvYL0_large.jpg?v=1501269391","nomeExibicao":"Learning 3.0","title":"Learning 3.0","sub":"Como os profissionais criativos aprendem","author":"Alexandre Magno, Yoris Linhares","content":"O futuro pertence àqueles profissionais que são capazes de aprender mais e melhor que seus concorrentes. Em um mundo onde o conhecimento torna-se desatualizado periodicamente, a capacidade mais importante para uma carreira de sucesso é simplesmente: a aprendizagem!\nOs métodos de aprendizagem tradicionais, que se baseiam na transferência de conhecimento entre conhecedor e aprendiz, estão obsoletos. Agora, você é quem precisa criar seu próprio conhecimento, ao pesquisar ideias de várias fontes, realizar experimentos no seu próprio contexto, e então compartilhar seus pensamentos com o mundo.\n\nO Learning 3.0 assume a aprendizagem emergente, auto-organizada, como a base para o aprendizado de assuntos complexos. É a prática mais comum entre os profissionais criativos bem-sucedidos. Este livro, bem como todo o conceito em torno deste tema, nasceu a partir da observação da prática, na tentativa de relacioná-la com teorias já existentes. Nesta versão em português de seu livro How Creative Workers Learn, Alexandre Magno nos apresenta uma coleção de histórias reais, ou baseadas em fatos reais, que se conectam com teorias, e com a opinião de renomados autores, pensadores e pesquisadores, culminando em uma visão própria sobre cada tema abordado.\nEste livro leva você em uma jornada de descoberta na qual você entenderá como pode empreender efetivamente sua carreira, usando a aprendizagem como principal ferramenta para construir um futuro do qual você pode se orgulhar.","category":"business","subcategory":"Outros"},{"url":"https://www.casadocodigo.com.br/products/livro-lean-game-development","nome":"Lean Game Development: Desenvolvimento enxuto de jogos","img":"/covers/AMlqJB2HHf2DrJmOv7CcDavslB_Bn28__SmqTx0Ry9I_large.jpg?v=1492115019","nomeExibicao":"Lean Game Development","title":"Lean Game Development","sub":"Desenvolvimento enxuto de jogos","author":"Julia Naomi Boeira","content":"Lean Game Development, ou Desenvolvimento Enxuto de Jogos, é um modelo de produção de jogos pensado de forma a atender todas as necessidades da indústria de jogos. Sendo orgânico a mudanças por meio de constantes reviews, ele oferece uma alternativa metodológica que pode nos auxiliar a eliminar desperdícios, reduzir bugs, obter resultados no menor tempo possível, fortalecer e empoderar o trabalho da equipe.\nNeste livro, Julia Naomi apresenta o Lean Game Development, de modo que se compreenda que o jogo digital é também um software, e que o desenvolvimento de software pode ser visto como um jogo cooperativo de invenção e comunicação na qual todas as peças são importantes. Você aprenderá sobre diversos aspectos do desenvolvimento lean aplicados a jogos, como Inceptions e MVPs, desenvolvimento guiado a testes, integração contínua, geração de hipóteses, medições e análises.","category":"business","subcategory":"Outros"},{"url":"https://www.casadocodigo.com.br/products/livro-mantra-produtividade","nome":"O Mantra da Produtividade: Aprimore sua produtividade com técnicas de foco e organização pessoal","img":"/covers/1qy5CBjJoJSyXlraox4MkYn556p2hOPM3GNJQIoPHog_size_mode_3_size_1280x960_large.jpeg?v=1465568317","nomeExibicao":"Mantra da Produtividade","title":"O Mantra da Produtividade","sub":"Aprimore sua produtividade com técnicas de foco e organização pessoal","author":"Dionatan Moura","content":"Em tempos de redes sociais, smartphones e diversas outras formas de distração, sabemos da facilidade com que caímos na procrastinação e acabamos adiando as tarefas mais importantes. Ouvimos vários conselhos para termos uma alta produtividade, mas nem sempre sabemos como fazer isso de um modo prático. Como efetivamente podemos ter uma boa produtividade? É necessária a utilização de técnicas no dia a dia.\nDionatan Moura traz diversas técnicas de produtividade pessoal, além de dicas para colocá-las em prática. Com este livro, você saberá utilizar melhor seu tempo e energia em tarefas alinhadas com metas e objetivos pessoais, seja nos estudos, no trabalho ou em projetos pessoais. É um guia prático para você produzir com mais foco e organização.","category":"business","subcategory":"Outros"},{"url":"https://www.casadocodigo.com.br/products/livro-programador-apaixonado","nome":"O Programador Apaixonado: Construindo uma carreira notável em desenvolvimento de software","img":"/covers/programador-apaixonado-featured_large.png?v=1411566032","nomeExibicao":"O Programador Apaixonado","title":"O Programador Apaixonado","sub":"Construindo uma carreira notável em desenvolvimento de software","author":"Chad Fowler","content":"Para ter sucesso no mercado de TI atual, é preciso ver sua carreira como se fosse um negócio. Neste livro, você vai aprender a empreender com a sua carreira e levá-la para o caminho que você escolheu: o do sucesso.\n\nNeste livro, Chad Fowler, famoso desenvolvedor de software e autor de diversos livros, ensina a construir sua carreira na área de desenvolvimento, passo a passo, seguindo o mesmo caminho de que se você estivesse criando e vendendo um produto. Afinal de contas, suas habilidades são um produto.","category":"business","subcategory":"Outros"},{"url":"https://www.casadocodigo.com.br/products/vale-presente","nome":"Vale presente Casa do Código","img":"/covers/vale-presente-CDC_large.png?v=1451330431","nomeExibicao":"Vale Presente","title":"Vale presente Casa do Código","sub":"","author":"Casa do Código","content":"É sempre difícil escolher algo para seu amigo que trabalha com tecnologia. A Casa do Código possui um acervo de livros e e-books que vai agradar a todos. Não perca mais seu tempo escolhendo o presente de aniversário e de natal de seu colega.\nO presenteado pode também optar pelo livro impresso, o valor do vale presente só não abate o frete.\nAssim que você realizar a compra do vale presente, basta acessar http://valepresente.casadocodigo.com.br e preencher os dados para presentear seu amigo!","category":"business","subcategory":"Outros"},{"url":"https://www.casadocodigo.com.br/products/livro-do-jeito-certo","nome":"Do jeito certo: Gestão de produtos no mundo das startups","img":"/covers/eBook-Making-it-right-traduzido_large.jpg?v=1525721591","nomeExibicao":"Do jeito certo","title":"Do jeito certo","sub":"Gestão de produtos no mundo das startups","author":"Rian van der Merwe","content":"Gestão de produtos é uma das carreiras mais exaustivas, emocionantes, estressantes e recompensadoras que existem. Não é para os fracos do coração. É para pessoas que desejam mover montanhas. Alguns são completamente engolidos por esse trabalho, mas outros encontram uma revigoração infinita e uma paixão pelo ritmo, pelo impacto, pela glória, e pelo enorme potencial tanto de fracasso como de sucesso que ele traz. Não há nenhum emprego como este, e este é um livro que vai ajudá-lo a fazer disso o seu trabalho.\nO livro Making it right, de Rian van der Merwe, ganha sua tradução para o português em Do jeito certo, e vem:\n1. Definir os papéis e responsabilidades dos gerentes de produtos no contexto do desenvolvimento de software. \n\n2. Explicar por que gestão de produtos é um papel essencial em qualquer organização, e quais características os gerentes devem procurar quando forem contratar gerentes de produtos.\n\n3. Fornecer um framework e um guia prático para gestão de produtos estratégica; um framework que detalhe os elementos do planejamento do produto e a execução do produto que compõem o dia a dia de trabalho de um gerente de produtos.","category":"business","subcategory":"Startups"},{"url":"https://www.casadocodigo.com.br/products/livro-jornada-empreendedor","nome":"A jornada do empreendedor: O herói da nossa Era","img":"/covers/EeWu4o4nvz9o71nSFnXAhPmu4BiMyGP7x5Pz0tJU3dk_large.jpg?v=1469752875","nomeExibicao":"A jornada do empreendedor","title":"A jornada do empreendedor","sub":"O herói da nossa Era","author":"Edson Marqueto Rigonatti, Laura Mello Constantini, Martino Bagini","content":"Uma jornada é uma busca por um ideal, por um grande desafio. Para uns, a motivação é a recompensa financeira. Para outros, o desejo de fazer algo maior que si mesmos. Seja qual for o seu objetivo, para chegar lá você precisará de força de vontade sobre-humana. O empreendedor deve ser um verdadeiro herói.\nNeste livro você seguirá 47 passos fundamentais para alcançar seus objetivos com sucesso.\n\nA cada passo, você e seu time estarão mais preparados para trilhar seus próprios caminhos, sabendo como adaptar-se a cada demanda com um processo mais aprimorado. Nós estaremos ao seu lado, com bússola e mapa na mão.","category":"business","subcategory":"Startups"},{"url":"https://www.casadocodigo.com.br/products/livro-economia-acesso","nome":"Economia do acesso: e os modelos de negócios baseados em compartilhamento, recorrência e assinatura","img":"/covers/3HNP-14BhN5hpGETS6T2GAZFHGWY9f8dZprBuXZYA0_size_mode_3_size_1280x960_large.jpeg?v=1463167564","nomeExibicao":"Economia do acesso","title":"Economia do acesso","sub":"e os modelos de negócios baseados em compartilhamento, recorrência e assinatura","author":"Rodrigo Dantas","content":"A forma de consumir produtos e serviços está mudando. Alguns mercados já se transformaram completamente. Novas empresas nasceram, e outras morreram sem entender o motivo. O consumidor também já acordou. É hora de consumir somente o necessário.\n\nA tecnologia amparada pelo consumo consciente e pela economia colaborativa criou empresas que não têm uma década e já fazem mais receita do que empresas centenárias. É a transformação das economias tradicionais para a economia do acesso.\nStreaming de vídeo, softwares, bitcoins, crowfunding, fintechs e startups de todos os tipos estão quebrando a hegemonia de grandes empresas através do componente mais flamejante do empreendedorismo: inovação.\n“Que sociedade é esta em que aquele ‘possuir’, que conheci durante 50 anos, passa a perder o sentido? Ter o CD na prateleira não vale mais nada, aliás, só custa. O que interessa é ter acesso à música que quero ouvir. O que vale é o acesso ao benefício, não a posse do produto” - Luciano Pires.\nA Economia do Acesso é um ensaio de como as pessoas e empresas de tecnologia transformam a forma de consumo, seja de produtos ou de serviços.\nAlém disso, é um bom manual para discutir como as novas gerações vão mudar o mundo através da sustentabilidade e do benefício real de cada consumo.","category":"business","subcategory":"Startups"},{"url":"https://www.casadocodigo.com.br/products/livro-direto-ao-ponto","nome":"Direto ao Ponto: Criando produtos de forma enxuta","img":"/covers/eBook-Direto-ao-Ponto_large.jpg?v=1464960251","nomeExibicao":"Direto ao Ponto","title":"Direto ao Ponto","sub":"Criando produtos de forma enxuta","author":"Paulo Caroli","content":"Ao trabalhar em um projeto, você não quer desperdiçar tempo, dinheiro, nem esforço construindo um produto que não vai atender às suas expectativas ou de seu cliente. Para isso, é preciso validar as hipóteses de negócio e viabilizar possíveis passos de criação com o time todo.\nNeste livro, Paulo Caroli compartilha a receita da técnica Direto ao Ponto: uma sequência de atividades rápidas e efetivas para entender e planejar a criação de produtos enxutos, baseadas no conceito de produto mínimo viável.\nNova edição: atualizada e ampliada.","category":"business","subcategory":"Startups"},{"url":"https://www.casadocodigo.com.br/products/livro-thoughtworks-antologia","nome":"Thoughtworks Antologia Brasil: Histórias de aprendizado e inovação","img":"/covers/thoughtworks-antologia-featured_large.png?v=1416319002","nomeExibicao":"ThoughtWorks Antologia Brasil","title":"Thoughtworks Antologia Brasil","sub":"Histórias de aprendizado e inovação","author":"ThoughtWorks","content":"Estar na vanguarda das tecnologias e metodologias de desenvolvimento é uma das principais características da ThoughtWorks, empresa reconhecida mundialmente e onde trabalham nomes como Martin Fowler, Danilo Sato, Rebecca Parsons, Paulo Caroli e muitos outros expoentes da área.\n\nNeste livro, vários colaboradores da ThoughtWorks passam suas experiências com as mais variadas tecnologias e metodologias. Você vai aprender sobre BDD, testes com JavaScript, inovação em startups, agilidade, técnicas de retrospectivas, técnicas avançadas de trabalho com controle de versão e muito mais.\n\nÉ um livro indispensável para quem quer se manter atualizado e entender as tecnologias e métodos trabalhados na principal empresa de consultoria da área.","category":"business","subcategory":"Startups"},{"url":"https://www.casadocodigo.com.br/products/livro-startup-guia","nome":"Guia da Startup: Como startups e empresas estabelecidas podem criar produtos de software rentáveis","img":"/covers/cover_f0c223aa-023e-415b-8389-a942213aae39_large.jpg?v=1486151929","nomeExibicao":"Guia da Startup","title":"Guia da Startup","sub":"Como startups e empresas estabelecidas podem criar produtos de software rentáveis","author":"Joaquim Torres","content":"Aprenda as melhores técnicas para criar o seu produto web e faça ele render dinheiro o mais rápido possível com o Guia da Startup. Da mesma maneira que diversas empresas de sucesso fizeram, como a Caelum e a Locaweb, invista em suas ideias.","category":"business","subcategory":"Startups"},{"url":"https://www.casadocodigo.com.br/products/vale-presente","nome":"Vale presente Casa do Código","img":"/covers/vale-presente-CDC_large.png?v=1451330431","nomeExibicao":"Vale Presente","title":"Vale presente Casa do Código","sub":"","author":"Casa do Código","content":"É sempre difícil escolher algo para seu amigo que trabalha com tecnologia. A Casa do Código possui um acervo de livros e e-books que vai agradar a todos. Não perca mais seu tempo escolhendo o presente de aniversário e de natal de seu colega.\nO presenteado pode também optar pelo livro impresso, o valor do vale presente só não abate o frete.\nAssim que você realizar a compra do vale presente, basta acessar http://valepresente.casadocodigo.com.br e preencher os dados para presentear seu amigo!","category":"business","subcategory":"Startups"},{"url":"https://www.casadocodigo.com.br/products/livro-ux-produtos-digitais","nome":"User Experience Design: Como criar produtos digitais com foco nas pessoas","img":"/covers/e5PZBhz-GgLjsR0upBI7EnpMNg7FVmBTYZcXo4LNeZ4_large.jpg?v=1528484906","nomeExibicao":"UX em produtos digitais","title":"User Experience Design","sub":"Como criar produtos digitais com foco nas pessoas","author":"Rogério Pereira","content":"A experiência do usuário (UX) engloba todos os aspectos da interação que as pessoas costumam ter com uma marca, seus serviços e principalmente com seus canais digitais, sejam sites, aplicativos ou softwares. Mas esta área, além de crescente, é muito mais abrangente e vai além de fazer produtos digitais: é a preocupação com a construção de soluções relevantes que vão melhorar a relação do usuário com seu produto ou serviço.\nNeste livro, Rogério Pereira apresenta a profissão de UX Designer, reunindo as principais metodologias para as etapas da construção de um produto digital, desde os entregáveis, a Arquitetura de Informação, a criação de sketches e wireframes de uma estrutura de interface, fechando com testes de usabilidade. Os capítulos são permeados com exercícios, exemplos e dicas da profissão. Você verá como funciona todo o processo de construção de produtos digitais junto das práticas que vão ajudá-lo a pensar na experiência do usuário para alcançar um produto digital de sucesso.","category":"DesignUX","subcategory":""},{"url":"https://www.casadocodigo.com.br/products/livro-ux-user-experience","nome":"Introdução e boas práticas em UX Design","img":"/covers/ux-user-experience-featured_large.png?v=1411490013","nomeExibicao":"UX Design","title":"Introdução e boas práticas em UX Design","sub":"","author":"Fabricio Teixeira","content":"Cada vez mais o desenvolvimento do front-end de sites e sistemas tem papel preponderante em como o seu site converte, retém e agrada os usuários. Porém, além de saber como implementar uma tela, é importante saber também o que fazer nela. Quais recursos devem ser usados? Quais informações precisam ser exibidas? Em quais lugares?\n\nAtualmente, a experiência do usuário (User Experience – UX) tem ganhado um papel fundamental na criação de sites e aplicativos. Entender como o usuário se comportará no seu sistema é de extremo valor para criar um site simples para ele.\n\nNeste livro, Fabricio Teixeira mostra com exemplos práticos e reais de sucesso e insucesso de diferentes sites quais são as boas práticas e os pilares para conseguir construir um de uso agradável. Confira o sumário.","category":"DesignUX","subcategory":""},{"url":"https://www.casadocodigo.com.br/products/livro-photoshop","nome":"Conhecendo o Adobe Photoshop CS6","img":"/covers/photoshop-featured_large.png?v=1411487476","nomeExibicao":"Adobe Photoshop","title":"Conhecendo o Adobe Photoshop CS6","sub":"","author":"Tárcio Zemel","content":"Sempre quis entender como fotos que a princípio não tem nada de mais, depois de alguns retoques, ganham outra vida? Com esse livro, além de entender como funciona os segredos da manipulação de imagens, você vai aprender a aplicá-los na prática.\n\nO autor Tárcio Zemel explica, passo a passo, para quem não possui nenhuma experiência com Photoshop, os segredos de edição de imagens, aplicação de filtros, organização de trabalho com camadas, aplicação de máscaras, ajustes de tons de cores, seleções avançadas e muito mais.\n\nNo final do livro, você ainda aprende a fazer a imagem da capa, modificando e estilizando a Mona Lisa.","category":"DesignUX","subcategory":""},{"url":"https://www.casadocodigo.com.br/products/livro-adobe-lightroom","nome":"Edição e organização de fotos com Adobe Lightroom","img":"/covers/adobe-lightroom-featured_large.png?v=1416316972","nomeExibicao":"Adobe Lightroom","title":"Edição e organização de fotos com Adobe Lightroom","sub":"","author":"Rafael Steil","content":"Uma imagem vale por mil palavras. Uma foto pode deixar alguém sem palavras. Contudo, como encontrar alguma foto específica no meio de outras milhares? E como editar, corrigir e mostrá-las a amigos ou clientes de maneira eficiente e profissional?\n\nUma sessão fotográfica pode facilmente conter milhares de arquivos, e o número cresce cada vez mais à medida que os anos passam. Seja você um fotógrafo profissional ou hobbista, ainda é preciso ter uma boa organização sobre seu trabalho, além de ferramentas que lhe ajudem a ser mais produtivo.\n\nPara estas e outras coisas o Adobe Lightroom é a ferramenta perfeita. Com uma interface otimizada para fotógrafos de todos os níveis, pensada desde o início em produtividade e qualidade, este programa para Windows e Mac irá lhe surpreender.","category":"DesignUX","subcategory":""},{"url":"https://www.casadocodigo.com.br/products/vale-presente","nome":"Vale presente Casa do Código","img":"/covers/vale-presente-CDC_large.png?v=1451330431","nomeExibicao":"Vale Presente","title":"Vale presente Casa do Código","sub":"","author":"Casa do Código","content":"É sempre difícil escolher algo para seu amigo que trabalha com tecnologia. A Casa do Código possui um acervo de livros e e-books que vai agradar a todos. Não perca mais seu tempo escolhendo o presente de aniversário e de natal de seu colega.\nO presenteado pode também optar pelo livro impresso, o valor do vale presente só não abate o frete.\nAssim que você realizar a compra do vale presente, basta acessar http://valepresente.casadocodigo.com.br e preencher os dados para presentear seu amigo!","category":"DesignUX","subcategory":""},{"url":"https://www.casadocodigo.com.br/products/livro-bootstrap4","nome":"Bootstrap 4: Conheça a biblioteca front-end mais utilizada no mundo","img":"/covers/bhaqv_w_K03vnwWTS9CjbLLnOI9Ifdq9TbEYpEowN30_large.jpg?v=1526668094","nomeExibicao":"Bootstrap 4","title":"Bootstrap 4","sub":"Conheça a biblioteca front-end mais utilizada no mundo","author":"Natan Souza","content":"Fazer um site elegante nunca foi tão fácil, mesmo para quem não sabe escrever uma linha de CSS e, muito menos, entende como harmonizar cores, balancear elementos e tipografia. O Bootstrap é, resumidamente, um grande arquivo CSS com uma excelente documentação, que possui dezenas e dezenas de componentes prontos. No começo, foi criado pelo Twitter para servir como um guia de estilos em CSS da empresa; hoje, é a biblioteca mais famosa e utilizada no mundo.\n\nNeste livro, Natan Souza ensinará como trabalhar com esta fantástica biblioteca em sua última versão 4 ao montar uma página do zero, a partir de um wireframe. Você verá seus principais componentes, como menu responsivo, grids, painéis e botões, além de aprender a customizar seu tema padrão e algumas boas práticas de HTML5, sempre levando em consideração a semântica do código.\nVersões utilizadas: Bootstrap 4","category":"Front","subcategory":"HTMLCSS"},{"url":"https://www.casadocodigo.com.br/products/livro-turbine-css","nome":"Turbine seu CSS: Folhas de estilo inteligentes com Sass","img":"/covers/UtsjsksRzpBazwXpCYBVASxHRrhHeLxopPGZxoyExbw_large.jpg?v=1478227993","nomeExibicao":"Turbine seu CSS","title":"Turbine seu CSS","sub":"Folhas de estilo inteligentes com Sass","author":"Rosicléia Frasson","content":"Pré-processadores funcionam como uma extensão do CSS para auxiliar na criação de folhas de estilo com a adição de funcionalidades. Eles ajudam a diminuir a repetição de código e permitem implementar mudanças de forma mais rápida.\n\nNeste livro, Rosicléia Frasson vem desmistificar o uso do Sass, um pré-processador que adiciona potência e elegância ao CSS nativo. Você verá como deixar suas folhas de estilo mais organizadas e de fácil manutenção ao explorar suas principais funcionalidades: variáveis, mixins, aninhamento, herança, funções e modularização.","category":"Front","subcategory":"HTMLCSS"},{"url":"https://www.casadocodigo.com.br/products/livro-html-css","nome":"HTML5 e CSS3: Domine a web do futuro","img":"/covers/html-css-featured_large.png?v=1411489770","nomeExibicao":"HTML5 e CSS3","title":"HTML5 e CSS3","sub":"Domine a web do futuro","author":"Lucas Mazza","content":"Crie páginas elegantes de forma simples! HTML e CSS, quando bem utilizados, podem ser o sucesso de um projeto e, com os novos recursos, muito do que antes era trabalhoso agora não é mais.\n\nAprenda as melhores técnicas para escrever seu site por meio de exemplos práticos de funcionalidades úteis do cotidiano. Construa menus, aplique efeitos, estilize elementos visuais, melhore a semântica da sua página e muito mais!","category":"Front","subcategory":"HTMLCSS"},{"url":"https://www.casadocodigo.com.br/products/vale-presente","nome":"Vale presente Casa do Código","img":"/covers/vale-presente-CDC_large.png?v=1451330431","nomeExibicao":"Vale Presente","title":"Vale presente Casa do Código","sub":"","author":"Casa do Código","content":"É sempre difícil escolher algo para seu amigo que trabalha com tecnologia. A Casa do Código possui um acervo de livros e e-books que vai agradar a todos. Não perca mais seu tempo escolhendo o presente de aniversário e de natal de seu colega.\nO presenteado pode também optar pelo livro impresso, o valor do vale presente só não abate o frete.\nAssim que você realizar a compra do vale presente, basta acessar http://valepresente.casadocodigo.com.br e preencher os dados para presentear seu amigo!","category":"Front","subcategory":"HTMLCSS"},{"url":"https://www.casadocodigo.com.br/products/livro-sass","nome":"Sass: Aprendendo pré-processadores CSS","img":"/covers/8vHZ_JPjjeGbJlEQ7oOrMuqep7XWeLUhKOJ2KZW2wlw_large.jpg?v=1470340758","nomeExibicao":"Sass","title":"Sass","sub":"Aprendendo pré-processadores CSS","author":"Natan Souza","content":"Na última década, surgiram os chamados processadores CSS, tecnologias que buscavam suprir as deficiências que encontrávamos na utilização de CSS comum, como repetição de código, ausência de funções, a difícil manutenção entre outros fatores. Sabemos que a única linguagem de estilos que os navegadores compreendem atualmente é o bom e velho CSS, daí a necessidade de um pré-processador que receba dados de entrada e os devolva compilados em um arquivo .css, facilitando o dia a dia do desenvolvimento front-end e trazendo grandes vantagens na implementação dos estilos.\nNeste livro, Natan Souza, instrutor especialista em front-end na Caelum e na Alura, apresentará o Sass - Syntactically Awesome Stylesheets - de forma totalmente prática. Colocando as mãos na massa, você vai aprender a dominar o pré-processador CSS mais utilizado na atualidade.","category":"Front","subcategory":"HTMLCSS"},{"url":"https://www.casadocodigo.com.br/products/livro-css-eficiente","nome":"CSS Eficiente: Técnicas e ferramentas que fazem a diferença nos seus estilos","img":"/covers/css-eficiente-featured_large.png?v=1435245145","nomeExibicao":"CSS Eficiente","title":"CSS Eficiente","sub":"Técnicas e ferramentas que fazem a diferença nos seus estilos","author":"Tárcio Zemel","content":"Quando aprendemos a trabalhar com CSS, frequentemente nos pegamos perdidos em detalhes fundamentais que não nos são explicados. Por vezes, alguns desses detalhes passam despercebidos até pelo desenvolvedor front-end mais experiente. Mas como ir além do conhecimento básico do CSS e preparar o caminho para explorar tópicos mais avançados?\n\nNeste livro, Tárcio Zemel ensina como organizar seu estilo, entender especificidade, como usar diferentes seletores, trabalhar orientado a objetos com CSS e várias outras técnicas que farão diferença no dia a dia do trabalho com os estilos e abrirão novas possibilidades para você explorar ainda mais o CSS.","category":"Front","subcategory":"HTMLCSS"},{"url":"https://www.casadocodigo.com.br/products/livro-jogos-mobile-cordova","nome":"Jogos em HTML5: Explore o mobile e física","img":"/covers/jogos-mobile-cordova-featured_large.png?v=1413474311","nomeExibicao":"Jogos Mobile com HTML5","title":"Jogos em HTML5","sub":"Explore o mobile e física","author":"Éderson Cássio","content":"O HTML 5 é uma linguagem praticamente onipresente. Ela está presente nos computadores, tablets, celulares e vários outros dispositivos. Essa onipresença, aliada com o poder da linguagem e suas novas especificações, faz com que ela também seja usada para desenvolver jogos.\n\nMas como fazer jogos com HTML 5 que funcionam bem no mobile? A resposta para isso é o uso do Apache Cordova. Uma tecnologia que torna o HTML 5 em aplicativos nativos, que vão aproveitar o melhor de cada plataforma mobile.\n\nNesse livro, Éderson Cássio vai ensinar como criar jogos nativos para o Mobile com HTML 5, através do Apache Cordova e como usar recursos avançados, como física, controle de colisão, reconhecimentos de eventos touch e muito mais.","category":"Front","subcategory":"HTMLCSS"},{"url":"https://www.casadocodigo.com.br/products/livro-jogos-html-javascript","nome":"Desenvolva jogos com HTML5 Canvas e JavaScript","img":"/covers/jogos-html-javascript-featured_large.png?v=1411488497","nomeExibicao":"Jogos com HTML5","title":"Desenvolva jogos com HTML5 Canvas e JavaScript","sub":"","author":"Éderson Cássio","content":"O mercado dos jogos está cada vez mais forte e sendo adotado nos navegadores, com os jogos feitos em HTML5 através da nova especificação de Canvas. Com conhecimento de HTML5 e um pouco de JavaScript, é possível criar jogos extremamente poderosos e com um alto grau de entretenimento. Os tão conhecidos jogos \"viciantes\".\n\nNesse livro, Éderson Cássio mostra como você pode usar as tecnologias tradicionais da web para criar jogos 2D. Você vai aprender a movimentar sprites, tratar colisão e eventos do teclado de forma especial para os jogos, aprender boas práticas para evitar que seu jogo sofra de lentidão e muitas outras técnicas divertidas e interessantes. E no final do livro, você ainda publica seu próprio jogo e o integra com as redes sociais, para seus amigos acessarem.","category":"Front","subcategory":"HTMLCSS"},{"url":"https://www.casadocodigo.com.br/products/livro-coletanea-front-end","nome":"Coletânea Front-end: Uma antologia da comunidade front-end brasileira","img":"/covers/coletanea-front-end-featured_large.png?v=1411487157","nomeExibicao":"Coletânea front-end","title":"Coletânea Front-end","sub":"Uma antologia da comunidade front-end brasileira","author":"Almir Filho, Bernard De Luna, Caio Gondim, Deivid Marques, Diego Eis, Eduardo Shiota, Giovanni Keppelen, Luiz Corte Real, Jaydson Gomes, Reinaldo Ferraz, Sérgio Lopes","content":"A comunidade brasileira de programadores front-end e Web Designers é fantástica. Possui uma força imensa de elevar a qualidade da Web brasileira. Os milhares de representantes dessa comunidade produzem conteúdos ótimos em seus blogs, listas de discussão, Facebook e conversas de boteco. Nós nos encontramos em eventos memoráveis em todo o Brasil. Fazemos a Web progredir.\n\nEste livro quer ser uma pequena celebração desse sucesso. Um grupo de 11 autores de renome nacional na comunidade se juntou para escrever artigos que julgamos relevantes para a Web. Os capítulos são independentes, cada um com seu autor. A única regra era: escrever algo memorável, que fizesse a diferença na Web brasileira.","category":"Front","subcategory":"HTMLCSS"},{"url":"https://www.casadocodigo.com.br/products/colecao-webdesign","nome":"Coleção Web Design","img":"/covers/colecao-webdesign-featured_3cbf8794-4719-45b9-83e4-e23fc96fea04_large.png?v=1416401953","nomeExibicao":"Coleção Web Design","title":"Coleção Web Design","sub":"","author":"Sérgio Lopes, Lucas Mazza, Tárcio Zemel","content":"Tudo o que você precisa saber para implementar as melhores páginas web em 3 livros de front-end com 15% de desconto: HTML 5 e CSS 3, Web Design Responsivo e A Web Mobile.\n\nTorne-se a referência na implementação de sites e front-ends, conhecendo a fundo HTML5 e CSS3, com seus diversos novos recursos e funcionalidades. Aprenda a criar sites responsivos e que funcionam em qualquer dispositivo independente da sua resolução economizando esforço e dinheiro. Desvende os mistérios de um bom design responsivo, de uma estratégia mobile-first, das telas de alta resolução, dos componentes HTML5 e das otimizações de performance.\n\nAproveite o desconto de 15% nessa coleção de 3 e-books incríveis e saia já programando os melhores sites!Veja o sumário completo dos livros: HTML 5 e CSS 3, Web Design Responsivo e A Web Mobile","category":"Front","subcategory":"HTMLCSS"},{"url":"https://www.casadocodigo.com.br/products/livro-web-mobile","nome":"A Web Mobile: Design Responsivo e além para uma Web adaptada ao mundo mobile","img":"/covers/jM-9N3EJ5W36s1moB8JUhN2UnwhUMxWGRIASKVPyx1w_large.jpg?v=1469559874","nomeExibicao":"Web Mobile","title":"A Web Mobile","sub":"Design Responsivo e além para uma Web adaptada ao mundo mobile","author":"Sérgio Lopes","content":"Com o crescimento absurdo do uso de smartphones e tablets, a Web quebrou novas fronteiras. Sites enjaulados no Desktop são coisa do passado. A Web é multidispositivo e você precisa suportar mobile, TV, relógio... e até Desktop!\nPrograme a Web moderna, transformada pela mobilidade, touch screens e plataformas diversas. Desvende os mistérios de um bom design responsivo, de uma estratégia mobile-first, das telas de alta resolução, dos componentes HTML5 e das otimizações de performance. Enfrente os desafios e mudanças da Web Mobile e explore seus limites!","category":"Front","subcategory":"HTMLCSS"},{"url":"https://www.casadocodigo.com.br/products/livro-web-design-responsivo","nome":"Web Design Responsivo: Páginas adaptáveis para todos os dispositivos","img":"/covers/web-design-responsivo-featured_large.png?v=1411568121","nomeExibicao":"Web Design Responsivo","title":"Web Design Responsivo","sub":"Páginas adaptáveis para todos os dispositivos","author":"Tárcio Zemel","content":"Está criando um site, mas ele fica péssimo quando você o abre no seu celular? Descubra como fazer com que elas abram de forma usável nos dispositivos móveis. Aprenda as diversas técnicas que constituem o Web Design Responsivo e apenas com CSS, faça com que suas páginas web funcionem em qualquer dispositivo, sem nenhuma dor de cabeça.","category":"Front","subcategory":"HTMLCSS"},{"url":"https://www.casadocodigo.com.br/products/livro-frontend-vue","nome":"Front-end com Vue.js: Da teoria à prática sem complicações","img":"/covers/Amazon-Front-end-com-Vue-js_large.jpg?v=1511489591","nomeExibicao":"Front-end com Vue.js","title":"Front-end com Vue.js","sub":"Da teoria à prática sem complicações","author":"Leonardo Vilarinho","content":"Se você acha que é preciso muito tempo e códigos HTML, CSS e JavaScript embolados para conseguir construir um layout moderno e interativo, com um curto tempo de carregamento e funcionamento em qualquer plataforma, com certeza não conhece o Vue.js. Ele é um framework feito em JavaScript, que tem como principal objetivo o reaproveitamento de código e uma curva de aprendizagem pequena.\nNeste livro, Leonardo Vilarinho traz um guia de consulta com exercícios práticos ao final de cada capítulo. Você verá uma documentação mais compacta do Vue.js, para conhecer esse framework sem complicações. Você aprenderá a inserir, exibir e manipular dados, usar e reutilizar componentes, criar rotas, diretivas e plugins personalizados, gerenciar estados, e fazer testes automatizados. Ao final, você vai construir uma aplicação usando o que foi visto, uma API feita com o Laravel e o runner de testes AVA.","category":"Front","subcategory":"Javascript"},{"url":"https://www.casadocodigo.com.br/products/livro-ember-js","nome":"Ember.js: Conheça o framework para aplicações web ambiciosas","img":"/covers/EIKdn62H5LCW-Y77vHzu4gq4LmOabOXc-1dVwpXgrDQ_large.jpg?v=1503665311","nomeExibicao":"Ember.js","title":"Ember.js","sub":"Conheça o framework para aplicações web ambiciosas","author":"Clairton Rodrigo","content":"Ember.js é um framework ambicioso com o qual podemos desenvolver qualquer aplicação web. Com ele, é possível reutilizar bibliotecas já escritas e amplamente conhecidas na comunidade, como o Twitter Bootstrap e o Moment.js, além de persistir dados utilizando requisições assíncronas de forma transparente, escrever testes unitários, de integração ou de aceitação de maneira organizada. Seu código poderá usar os recursos mais atuais da ECMAScript, delegando a preocupação da incompatibilidade para um transpilador que também minificará o seu código para ambiente de produção.\nNeste livro, Clairton Rodrigo apresenta o Ember.js 2.11, abordando seus principais conceitos: desde a instalação e arquitetura, até a criação de componentes, helpers, testes e add-ons. Utilizando-se do exemplo da criação de uma agenda telefônica, você acompanhará na prática a aplicação dos principais recursos deste framework.","category":"Front","subcategory":"Javascript"},{"url":"https://www.casadocodigo.com.br/products/livro-coletanea-front-end","nome":"Coletânea Front-end: Uma antologia da comunidade front-end brasileira","img":"/covers/coletanea-front-end-featured_large.png?v=1411487157","nomeExibicao":"Coletânea front-end","title":"Coletânea Front-end","sub":"Uma antologia da comunidade front-end brasileira","author":"Almir Filho, Bernard De Luna, Caio Gondim, Deivid Marques, Diego Eis, Eduardo Shiota, Giovanni Keppelen, Luiz Corte Real, Jaydson Gomes, Reinaldo Ferraz, Sérgio Lopes","content":"A comunidade brasileira de programadores front-end e Web Designers é fantástica. Possui uma força imensa de elevar a qualidade da Web brasileira. Os milhares de representantes dessa comunidade produzem conteúdos ótimos em seus blogs, listas de discussão, Facebook e conversas de boteco. Nós nos encontramos em eventos memoráveis em todo o Brasil. Fazemos a Web progredir.\n\nEste livro quer ser uma pequena celebração desse sucesso. Um grupo de 11 autores de renome nacional na comunidade se juntou para escrever artigos que julgamos relevantes para a Web. Os capítulos são independentes, cada um com seu autor. A única regra era: escrever algo memorável, que fizesse a diferença na Web brasileira.","category":"Front","subcategory":"Javascript"},{"url":"https://www.casadocodigo.com.br/products/livro-meteor","nome":"Meteor: Criando aplicações web real-time com JavaScript","img":"/covers/meteor-featured_large.png?v=1411565690","nomeExibicao":"Meteor","title":"Meteor","sub":"Criando aplicações web real-time com JavaScript","author":"Caio Ribeiro Pereira","content":"O JavaScript já é uma opção real de desenvolvimento server-side. Trabalhar com a mesma linguagem que utilizamos no front-end é também uma grande vantagem. Diversos frameworks surgiram e, sem dúvida, o Meteor é que mais se destaca.\n\nNeste livro, venha desenvolver sua própria rede social do zero implementando funcionalidades que interagem em tempo real, além de também aprender a trabalhar com diversos componentes nativos do framework que visam agilizar a prototipagem da aplicação, utilizando o Meteor 1.1.x.\n\nTambém veremos como lidar tarefas do dia a dia como criação de templates com Handlebars; integração com a API do Facebook para autenticação e cadastro de usuários; utilização do banco de dados não-relacional MongoDB; e programação orientada a eventos, utilizando PubSub nativo do Meteor.","category":"Front","subcategory":"Javascript"},{"url":"https://www.casadocodigo.com.br/products/livro-javascript-jquery","nome":"Dominando JavaScript com jQuery","img":"/covers/javascript-jquery-featured_large.png?v=1416319134","nomeExibicao":"jQuery e JavaScript","title":"Dominando JavaScript com jQuery","sub":"","author":"Plínio Balduino","content":"Esqueça os livros que mais parecem uma documentação da API! Aqui você encontra jQuery apresentado de maneira incremental, substituindo código JavaScript longo e complicado.\n\nTruques de animação, componentes visuais, e manipulação do DOM através de jQuery, jQueryUI e jQuery mobile. Refatore uma aplicação JavaScript e finalmente entenda callbacks, seletores e AJAX sem ficar preso ao copy and paste. Tudo isso com a versão 2.x, a mais recente do framework.","category":"Front","subcategory":"Javascript"},{"url":"https://www.casadocodigo.com.br/products/vale-presente","nome":"Vale presente Casa do Código","img":"/covers/vale-presente-CDC_large.png?v=1451330431","nomeExibicao":"Vale Presente","title":"Vale presente Casa do Código","sub":"","author":"Casa do Código","content":"É sempre difícil escolher algo para seu amigo que trabalha com tecnologia. A Casa do Código possui um acervo de livros e e-books que vai agradar a todos. Não perca mais seu tempo escolhendo o presente de aniversário e de natal de seu colega.\nO presenteado pode também optar pelo livro impresso, o valor do vale presente só não abate o frete.\nAssim que você realizar a compra do vale presente, basta acessar http://valepresente.casadocodigo.com.br e preencher os dados para presentear seu amigo!","category":"Front","subcategory":"Javascript"},{"url":"https://www.casadocodigo.com.br/products/livro-cangaceiro-javascript","nome":"Cangaceiro JavaScript: Uma aventura no sertão da programação","img":"/covers/RXIaHuuVYefHy39KW2diszLgVUvKG87YLKgeC5PYTAc_large.jpg?v=1502478264","nomeExibicao":"Cangaceiro JavaScript","title":"Cangaceiro JavaScript","sub":"Uma aventura no sertão da programação","author":"Flávio Almeida","content":"Talvez nenhuma outra linguagem tenha conseguido invadir o coletivo imaginário dos desenvolvedores como JavaScript fez. Em sua história fabular em busca de identidade, foi a única que conseguiu se enraizar nos navegadores, tornando-se uma linguagem em que todo desenvolvedor precisa ter algum nível de conhecimento.\nNeste livro completíssimo, adentre o sertão do JavaScript com o cangaceiro Flávio Almeida percorrendo os principais recursos das versões ES5, ES6, ES7 e ES8. Transite entre os paradigmas Orientado a Objetos e o Funcional e aplique padrões de projetos para sobreviver durante sua caminhada.\nTranscenda seu conhecimento incluindo em seu arsenal de desenvolvedor IndexedDB, Babel e Webpack, tornando-se um Cangaceiro JavaScript!","category":"Front","subcategory":"Javascript"},{"url":"https://www.casadocodigo.com.br/products/livro-angular","nome":"Crie aplicações com Angular: O novo framework do Google","img":"/covers/Amazon-Aplicacoes-com-Angular_large.jpg?v=1494010530","nomeExibicao":"Angular","title":"Crie aplicações com Angular","sub":"O novo framework do Google","author":"Thiago Guedes","content":"Angular 2 é um framework para desenvolvimento front-end com HTML, CSS e TypeScript que, no final, é compilado para JavaScript. Com ele, você pode desenvolver aplicações web de forma rápida e fácil usando todas as novidades da web moderna, e ainda poderá expandir para plataforma mobile.\nNeste livro, você vai aprender tudo o que precisa para iniciar seu desenvolvimento usando este framework feito pelo Google. Thiago Guedes apresenta cada parte que compõe uma aplicação Angular 2, incluindo o novo JavaScript e as novas funções do ES6. Serão abordados conceitos como Default Parameters, Arrow functions, Destructuring, Map, Reduce, Filter e muito mais.","category":"Front","subcategory":"Javascript"},{"url":"https://www.casadocodigo.com.br/products/livro-vue","nome":"Vue.js: Construa aplicações incríveis","img":"/covers/eBook-Vue_large.jpg?v=1492717370","nomeExibicao":"Vue.js","title":"Vue.js","sub":"Construa aplicações incríveis","author":"Caio Incau","content":"O modo como desenvolvemos código front-end mudou muito ao longo dos últimos anos. Mais do que dar as ferramentas necessárias para desenvolver, os frameworks de componentes reativos para interfaces web modernas vieram nos ajudar com padrões e reaproveitamento de código. Vue.js, ou simplesmente Vue, é uma biblioteca moderna de desenvolvimento front-end, uma lib JavaScript para componentes reativos para web. Ele ganhou muita visibilidade no mercado após ser adotado como padrão pelo Laravel, tendo a possibilidade de ser utilizado em qualquer projeto que possua front-end, independente da linguagem de programação escolhida.\nNeste livro, você vai aprender a sintaxe do Vue.js 2.0, como funcionam seus componentes e métodos, como integrar com APIs externas e criar rotas, e muito mais! Caio Incau guia o leitor desde a instalação, passando por algumas bibliotecas úteis, até o desenvolvimento de um projeto de exemplo. A ideia é que, após ler este livro, você consiga desenvolver sua primeira aplicação em Vue.js, com um alto padrão de código, saindo com teoria e prática para poder começar a aplicar em seus próprios projetos.","category":"Front","subcategory":"Javascript"},{"url":"https://www.casadocodigo.com.br/products/livro-ecmascript6","nome":"ECMAScript 6: Entre de cabeça no futuro do JavaScript","img":"/covers/yPVDxju4tCeqY45tdQtvOZo6bdCztD7A1gUZHRoZ5wU_large.jpg?v=1490381498","nomeExibicao":"ECMAScript 6","title":"ECMAScript 6","sub":"Entre de cabeça no futuro do JavaScript","author":"Diego Martins de Pinho","content":"Nos últimos anos, a linguagem JavaScript cresceu bastante na comunidade de desenvolvedores, tornando-se mais robusta, poderosa e sendo usada em uma infinidade de aplicações de alto nível, tanto no front-end quanto no back-end das aplicações. Ela é a tecnologia por trás de ferramentas, frameworks e bibliotecas consagradas no mercado, tais como: Angular, Ember, React, Backbone, jQuery, Grunt. A lista é enorme. Atualmente, é essencial que um profissional de TI tenha domínio desta tecnologia, tanto para aplicações web, aplicativos mobile e/ou desktop. É exatamente para isto que este livro foi escrito. Para que você seja capaz de entender todas as mudanças que vieram com o ECMAScript 6, aprimorar suas habilidades como desenvolvedor e se destacar no mercado de trabalho que hoje é tão concorrido.\nNeste livro, Diego Pinho aborda as principais mudanças que a nova versão da especificação trouxe para a linguagem. Você vai aprender não somente o conceito, mas como aplicá-lo na prática em situações reais. Dentre elas, estão:\n\n* Novas maneiras de iterar objetos e coleções\n\n* Declaração de variáveis com let e const\n\n* Melhorias em funções com arrow functions\n\n* As novas de estruturas de Map, WeakMap, Set e WeakSet\n\n* Modularização e classes\n\n* Geradores e símbolos\n\n* E muito mais","category":"Front","subcategory":"Javascript"},{"url":"https://www.casadocodigo.com.br/products/livro-protractor","nome":"Protractor: Lições sobre testes end-to-end automatizados","img":"/covers/B-mir_JQ1is69BkwR8g-eBkv0Ky2QKIQVwlVSaAa8x4_large.jpg?v=1478889395","nomeExibicao":"Protractor","title":"Protractor","sub":"Lições sobre testes end-to-end automatizados","author":"Walmyr Filho","content":"Testes automatizados são uma parte muito importante no processo de desenvolvimento de software, já que são a base para garantir feedback rápido após mudanças em aplicações e servem como fonte de documentação. Protractor é um framework open source de testes end-to-end automatizados para aplicações AngularJS, utilizado para a execução de testes em aplicações, interagindo com elas como um usuário real faria, em navegadores reais, tais como Chrome e Firefox.\n\nNeste livro, Walmyr Filho apresenta uma coleção de práticas para implementar testes end-to-end automatizados ao processo de desenvolvimento de aplicações web, utilizando o framework Protractor. Durante a leitura, você verá como utilizar o padrão Page Objects, node modules, testes de revisão visual, testes na nuvem e para o mobile, como criar testes automatizados com práticas de integração contínua e muito mais.","category":"Front","subcategory":"Javascript"},{"url":"https://www.casadocodigo.com.br/products/livro-jquery-mobile","nome":"jQuery Mobile: Desenvolva interfaces para múltiplos dispositivos","img":"/covers/6t6DormKtTIMPV06egfeaUHUa0sAP79DihlJJ7K3vmQ_size_mode_3_size_1024x768_large.jpeg?v=1459277667","nomeExibicao":"jQuery Mobile","title":"jQuery Mobile","sub":"Desenvolva interfaces para múltiplos dispositivos","author":"Daniel Schmitz","content":"A cada dia, o desenvolvimento para dispositivos móveis vem ganhando um grande mercado, e uma das provas deste crescimento é a criação de diversas tecnologias para este fim. Apesar de termos ferramentas para o desenvolvimento nativo, como Android e iOs, existem sites e sistemas que devem ser visualizados no browser e seguem um processo diferente.\n\nNeste livro, Daniel Schmitz aborda o processo de criar sistemas para serem exibidos no navegador, escolhendo como biblioteca o jQuery Mobile. Seguindo a ideia de que menos é mais, podemos criar interfaces ricas para o mobile com apenas um conjunto limitado de componentes.","category":"Front","subcategory":"Javascript"},{"url":"https://www.casadocodigo.com.br/products/livro-mean","nome":"Mean: Full stack JavaScript para aplicações web com MongoDB, Express, Angular e Node","img":"/covers/mean-featured_large.png?v=1423666173","nomeExibicao":"MEAN","title":"Mean","sub":"Full stack JavaScript para aplicações web com MongoDB, Express, Angular e Node","author":"Flávio Almeida","content":"Já pensou em desenvolver aplicações web ricas com recursos complexos, extremamente performáticos e robustos? É isso que você conseguirá fazer com a stack MEAN.\n\nUnindo várias das principais tecnologias do mercado, como o MongoDB, Express, Angular e Node.js em cima da linguagem JavaScript, é possível criar aplicações em um curto espaço de tempo em uma linguagem sobre a qual todo desenvolvedor web possui algum conhecimento.\n\nNeste livro completíssimo, Flávio Almeida vai ensinar a desenvolver com essa poderosa stack, passando pelos problemas encontrados no dia a dia, destrinchando cada um dos seus elementos fundamentais e indo até o deploy e o teste da aplicação. É um livro que todo desenvolvedor web precisa ler.","category":"Front","subcategory":"Javascript"},{"url":"https://www.casadocodigo.com.br/products/livro-jogos-html-javascript","nome":"Desenvolva jogos com HTML5 Canvas e JavaScript","img":"/covers/jogos-html-javascript-featured_large.png?v=1411488497","nomeExibicao":"Jogos com HTML5","title":"Desenvolva jogos com HTML5 Canvas e JavaScript","sub":"","author":"Éderson Cássio","content":"O mercado dos jogos está cada vez mais forte e sendo adotado nos navegadores, com os jogos feitos em HTML5 através da nova especificação de Canvas. Com conhecimento de HTML5 e um pouco de JavaScript, é possível criar jogos extremamente poderosos e com um alto grau de entretenimento. Os tão conhecidos jogos \"viciantes\".\n\nNesse livro, Éderson Cássio mostra como você pode usar as tecnologias tradicionais da web para criar jogos 2D. Você vai aprender a movimentar sprites, tratar colisão e eventos do teclado de forma especial para os jogos, aprender boas práticas para evitar que seu jogo sofra de lentidão e muitas outras técnicas divertidas e interessantes. E no final do livro, você ainda publica seu próprio jogo e o integra com as redes sociais, para seus amigos acessarem.","category":"Front","subcategory":"Javascript"},{"url":"https://www.casadocodigo.com.br/products/livro-desconstruindo-web","nome":"Desconstruindo a Web: As tecnologias por trás de uma requisição","img":"/covers/Xchinb4LgqfBhX3PDCrk_1PhP-e8xqEQulmXt3l2Ubk_large.jpg?v=1472159580","nomeExibicao":"Desconstruindo a Web","title":"Desconstruindo a Web","sub":"As tecnologias por trás de uma requisição","author":"Willian Molinari","content":"Desde o momento em que o usuário aperta a tecla Enter do teclado até a página aparecer completamente carregada na tela, ocorre uma série de eventos. Como o navegador faz a chamada? Como a requisição sai do sistema operacional e chega ao servidor de destino? Como o HTTPS funciona? Como o servidor de aplicação se integra ao framework de desenvolvimento web?\nNeste livro, Willian Molinari nos mostra separadamente cada uma das peças de uma requisição web. Utilizando uma página HTML como exemplo, faremos um estudo unificado e focado no entendimento de como a internet funciona. Passaremos pela criação visual da interface do navegador, pela montagem dos pacotes dentro do kernel do sistema operacional, pelos dispositivos de rede da internet, e até mesmo pela integração do código da aplicação com o servidor web.","category":"Infraestrutura","subcategory":"Web"},{"url":"https://www.casadocodigo.com.br/products/vale-presente","nome":"Vale presente Casa do Código","img":"/covers/vale-presente-CDC_large.png?v=1451330431","nomeExibicao":"Vale Presente","title":"Vale presente Casa do Código","sub":"","author":"Casa do Código","content":"É sempre difícil escolher algo para seu amigo que trabalha com tecnologia. A Casa do Código possui um acervo de livros e e-books que vai agradar a todos. Não perca mais seu tempo escolhendo o presente de aniversário e de natal de seu colega.\nO presenteado pode também optar pelo livro impresso, o valor do vale presente só não abate o frete.\nAssim que você realizar a compra do vale presente, basta acessar http://valepresente.casadocodigo.com.br e preencher os dados para presentear seu amigo!","category":"Infraestrutura","subcategory":"Web"},{"url":"https://www.casadocodigo.com.br/products/livro-machine-learning","nome":"Machine Learning: Introdução à classificação","img":"/covers/3Z-lkXuKGocz6w7BqNQA5VliFXOhOiEEZWy4rVI23KM_large.jpg?v=1508514002","nomeExibicao":"Machine Learning","title":"Machine Learning","sub":"Introdução à classificação","author":"Guilherme Silveira, Bennett Bullock","content":"Nós, como seres humanos, sabemos facilmente distinguir uma informação de outra, e por meio da experiência, podemos tirar conclusões em decisões simples, como reconhecer se um animal é um cão ou um porco, se um e-mail é spam ou não, decidir se uma movimentação bancária é uma fraude. O computador pode aprender de forma similar, em um processo chamado de classificação dentro da área de machine learning.\nA classificação é uma ferramenta para responder perguntas, mas antes é preciso saber quais e quantas perguntas fazer, a partir de quais informações, e ainda, como interpretar as respostas.\nNeste livro, Guilherme Silveira e Bennett Bullock mostram como o computador aprende com uma base de dados e algoritmos para responder perguntas do dia a dia, com uma aplicabilidade crescente no mundo dos negócios, cada vez mais apurada, conforme mais dados estão disponíveis. Por meio de variáveis numéricas e categóricas, você vai treinar modelos matemáticos computacionais em Python que nos ajudam a tomar decisões e prever comportamentos, como quando um funcionário está próximo de pedir demissão ou qual será o próximo passo de um usuário em um site.","category":"Infraestrutura","subcategory":"Dados"},{"url":"https://www.casadocodigo.com.br/products/livro-postgresql","nome":"PostgreSQL: Banco de dados para aplicações web modernas","img":"/covers/eFkRLwyjeOC9WaY2iNllrpf1zbpjYeA488RG0tjKfCA_large.jpg?v=1489173482","nomeExibicao":"PostgreSQL","title":"PostgreSQL","sub":"Banco de dados para aplicações web modernas","author":"Vinícius Carvalho","content":"Tecnologias de banco de dados dão suporte diário para operações e tomadas de decisões nos mais diversos níveis da empresa, da operação à gerência. Eles são vitais para as organizações modernas que querem se manter competitivas no mercado e no cenário atual de extrema concorrência. O PostgreSQL é um poderoso sistema gerenciador de banco de dados objeto-relacional de código aberto. Seu recente aumento de popularidade veio de usuários de outros bancos de dados em busca de um sistema com melhores garantias de confiabilidade, melhores recursos de consulta, mais operação previsível, ou simplesmente querendo algo mais fácil de aprender, entender e usar.\n\nNeste livro, Vinícius Carvalho explora as principais características do PostgreSQL, mostrando por que ele é seguro, poderoso, confiável e rápido. Através do desenvolvimento de um projeto, você vai aprender na prática as funções, consultas e administração de um banco de dados, podendo revisar seus conhecimentos nos exercícios elaborados pelo autor ao fim do livro.","category":"Infraestrutura","subcategory":"Dados"},{"url":"https://www.casadocodigo.com.br/products/livro-redis","nome":"Armazenando dados com Redis","img":"/covers/redis-featured_large.png?v=1411486861","nomeExibicao":"Redis","title":"Armazenando dados com Redis","sub":"","author":"Rodrigo Lazoti","content":"Saber usar a melhor ferramenta para cada problema é determinante para qualquer pessoa ligada à área de tecnologia e, atualmente, com o desenvolvimento de novos bancos de dados, as opções para essa área aumentaram bastante, trazendo muito mais poder às aplicações.\n\nNeste livro, Rodrigo Lazoti mostrará por que trabalhar com o Redis e bancos de dados chave/valor podem trazer enormes ganhos de performance para sua aplicação, além de também ser a ferramenta ideal para diversos sistemas.\n\nVocê vai aprender a trabalhar com estruturas clássicas e modernas de dados e armazenamento, filas, listas, conjuntos, além da configurações de mecanismos de publish e subscribe e, claro, como usar todo o poder da API do Redis.","category":"Infraestrutura","subcategory":"Dados"},{"url":"https://www.casadocodigo.com.br/products/livro-php-mysql","nome":"Desenvolvimento web com PHP e MySQL","img":"/covers/cover_large.jpg?v=1477073475","nomeExibicao":"PHP e MySQL","title":"Desenvolvimento web com PHP e MySQL","sub":"","author":"Evaldo Junior Bento","content":"Imagine a internet na qual você pode apenas consumir conteúdos, como se fosse um jornal, uma revista, ou ainda, um programa na televisão. Chato, né? O segredo da famosa web 2.0 é a capacidade de interação entre as pessoas e os serviços online.\n\nAprenda com esse livro os primeiros passos para usar o PHP, uma ferramenta que possibilita a criação de páginas web dinâmicas. Veja também como integrar o PHP ao MySQL, um dos bancos de dados mais usados no mundo.\n\nA dupla PHP e MySQL é usada por diversos tipos de aplicações e sites, de blogs a portais de notícias e grandes redes sociais.","category":"Infraestrutura","subcategory":"Dados"},{"url":"https://www.casadocodigo.com.br/products/vale-presente","nome":"Vale presente Casa do Código","img":"/covers/vale-presente-CDC_large.png?v=1451330431","nomeExibicao":"Vale Presente","title":"Vale presente Casa do Código","sub":"","author":"Casa do Código","content":"É sempre difícil escolher algo para seu amigo que trabalha com tecnologia. A Casa do Código possui um acervo de livros e e-books que vai agradar a todos. Não perca mais seu tempo escolhendo o presente de aniversário e de natal de seu colega.\nO presenteado pode também optar pelo livro impresso, o valor do vale presente só não abate o frete.\nAssim que você realizar a compra do vale presente, basta acessar http://valepresente.casadocodigo.com.br e preencher os dados para presentear seu amigo!","category":"Infraestrutura","subcategory":"Dados"},{"url":"https://www.casadocodigo.com.br/products/livro-business-intelligence","nome":"Business Intelligence: Implementar do jeito certo e a custo zero","img":"/covers/vVWirlCq9G_fBkVCaXORAxIuYG_F0-gZ_M49f7b8vhA_large.jpg?v=1487964576","nomeExibicao":"Business Intelligence","title":"Business Intelligence","sub":"Implementar do jeito certo e a custo zero","author":"Ronaldo Braghittoni","content":"O que fazer quando é preciso melhorar o processo de tomada de decisões na sua empresa? A resposta geralmente é “Business Intelligence”, mas o que, de fato, é BI? Quais os reais benefícios e desafios dessa metodologia e das tecnologias existentes no mercado que prometem implementá-la? Qual o custo envolvido na implantação de uma solução de BI e em sua evolução dentro da empresa?\nNeste livro, Ronaldo Braghittoni explica o que é (de verdade) Business Intelligence, como ele é composto, o que esperar dele, por que implementá-lo e os desafios de um projeto de BI. Você acompanhará o passo a passo para implementar uma plataforma de BI na íntegra, com exemplos, códigos, explicações e conceitos que lhe permitirão solucionar os cenários reais de sua empresa sem gastar nenhum centavo com licenciamento de software.","category":"Infraestrutura","subcategory":"Dados"},{"url":"https://www.casadocodigo.com.br/products/livro-big-data","nome":"Big Data: Técnicas e tecnologias para extração de valor dos dados","img":"/covers/4MRnPs-gpoIYhwqavVoX2Mc64HktcIqFtQOyX8x0yDo_large.jpg?v=1480680976","nomeExibicao":"Big Data","title":"Big Data","sub":"Técnicas e tecnologias para extração de valor dos dados","author":"Rosangela Marquesone","content":"Estamos na era dos dados. Não importa qual seja a sua área de atuação, uma palavra atualmente em evidência é: Big Data. Podemos encontrar casos de uso em que esse conceito permitiu a redução do número de fraudes, redução de custos na produção, eficiência energética, aumento de segurança, entre outros benefícios tão almejados em diversos domínios. Muito embora o interesse esteja em alta, Big Data ainda é um termo incipiente, gerando incertezas sobre sua definição, características, aplicabilidade e desafios. Como obter dados de diferentes fontes? Como extrair valor a partir dos dados? Qual a infraestrutura necessária para criar uma solução de Big Data? Quais habilidades são necessárias para atuar com Big Data em seu projeto?\n\nNeste livro, Rosangela Marquesone apresenta as tecnologias e soluções de Big Data, em uma abordagem conceitual que detalha as características e capacidades de cada uma delas. Você verá as principais fases de um projeto de Big Data, desde a captura, o armazenamento, o processamento, análise, até a visualização de dados.","category":"Infraestrutura","subcategory":"Dados"},{"url":"https://www.casadocodigo.com.br/products/livro-nosql","nome":"NoSQL: Como armazenar os dados de uma aplicação moderna","img":"/covers/QJqAPTPE3N1YMoK32lk4dVw2XtfE6jmYTk-u1SahDYE_large.jpg?v=1469129941","nomeExibicao":"NoSQL","title":"NoSQL","sub":"Como armazenar os dados de uma aplicação moderna","author":"David Paniz","content":"Ao começar um novo projeto, surgem questões importantes sobre quais linguagens de programação serão usadas, os principais frameworks e como será a arquitetura. Nessa tomada de decisões, a escolha por um banco de dados relacional costuma ser praticamente unânime. Porém, com o aumento das exigências de um banco de dados com alto volume de armazenamento e leitura, surgiu o movimento NoSQL – Não apenas SQL, ressaltando a importância de se questionar qual a melhor ferramenta para a sua necessidade, que pode ser um banco relacional ou não.\n\nNeste livro, David Paniz apresenta bancos não relacionais, tratando de suas vantagens e desvantagens, para você poder escolher qual a melhor opção para o seu contexto. Ao longo da leitura, você vai desenvolver um exemplo real para aprender na prática a utilização dos bancos de dados NoSQL, aplicando soluções mais elegantes e práticas, e muitas vezes mais performáticas e escaláveis, que abrirão seu leque de opções ao montar seu projeto.","category":"Infraestrutura","subcategory":"Dados"},{"url":"https://www.casadocodigo.com.br/products/livro-elasticsearch","nome":"Elasticsearch: Consumindo dados real-time com ELK","img":"/covers/yhNMnf94VN2SR0dh0B5R282kei0hlLCFW2P90qYm8Nw_size_mode_3_size_1024x768_large.jpeg?v=1458329541","nomeExibicao":"Elasticsearch","title":"Elasticsearch","sub":"Consumindo dados real-time com ELK","author":"Alexandre Lourenço","content":"Com o aumento massivo da produção de dados na atualidade, empresas como o Twitter, Facebook e Netflix precisam seguir modelos de estruturação formalizados para processar essas verdadeiras montanhas de dados, aproveitando-se de conceitos de computação distribuída. Dentre as novas tecnologias que permitem o processamento ou consulta de conjuntos enormes de dados textuais em tempo real está o Elasticsearch.\n\nNeste livro, Alexandre Lourenço aborda a stack ELK (Elasticsearch, Logstash e Kibana), dissecando todos os seus aspectos. O objetivo é fornecer um método de se catalogar e efetuar buscas em grandes massas de informação por meio de interfaces REST que recebem ou provêm informações em formato JSON.","category":"Infraestrutura","subcategory":"Dados"},{"url":"https://www.casadocodigo.com.br/products/livro-banco-mysql","nome":"MySQL: Comece com o principal banco de dados open source do mercado","img":"/covers/bancomysql-featured_large.png?v=1437417574","nomeExibicao":"Banco MySQL","title":"MySQL","sub":"Comece com o principal banco de dados open source do mercado","author":"Vinícius Carvalho","content":"O MySQL é praticamente onipresente nos projetos de software atuais. Boa parte deles o utiliza como banco de dados para armazenar as informações da sua aplicação, por conta da sua facilidade de instalação e configuração.\n\nNeste livro, Vinícius Carvalho introduz o leitor no mundo do banco de dados MySQL, ensinando os principais comandos DML e DDL, e ferramentas gráficas. Você vai aprender a trabalhar com procedures, manipular triggers, criar backups e vários outros recursos que fazem a diferença no dia a dia.","category":"Infraestrutura","subcategory":"Dados"},{"url":"https://www.casadocodigo.com.br/products/livro-plsql","nome":"PL/SQL: Domine a linguagem do banco de dados Oracle","img":"/covers/plsql-featured_large.png?v=1434740236","nomeExibicao":"Banco de Dados PL/SQL","title":"PL/SQL","sub":"Domine a linguagem do banco de dados Oracle","author":"Eduardo Gonçalves","content":"Durante o dia, milhões de dados trafegam por servidores ao redor do mundo. São informações de todo tipo e muitas delas precisam ser preservadas. Qual a forma de fazer isso? Persistindo os dados.\n\nNeste livro, Eduardo Gonçalves mostra o poder da linguagem PL/SQL e como você pode conseguir um alto grau de produtividade e performance para as suas aplicações. Os leitores iniciantes terão contato com conceitos sobre a estrutura da linguagem PL/SQL e suas características, e criarão programas, dos mais simples até os mais complexos, para atender às mais diversas necessidades. Para os já experientes, ajudará como fonte de referência e para atualizar conceitos e técnicas da linguagem.","category":"Infraestrutura","subcategory":"Dados"},{"url":"https://www.casadocodigo.com.br/products/livro-mongodb","nome":"MongoDB: Construa novas aplicações com novas tecnologias","img":"/covers/mongodb-featured_large.png?v=1423661720","nomeExibicao":"MongoDB","title":"MongoDB","sub":"Construa novas aplicações com novas tecnologias","author":"Fernando Boaglio","content":"O modelo dos bancos de dados relacionais já existe há muitos anos. No entanto, cada vez mais as aplicações modernas precisam aliar alta escalabilidade com suporte a persistência de alta quantidade de informações, e  é justamente por isso que o modelo relacional começa a deixar a desejar e as alternativas NOSQL passam a surgir. \n\nAtingir alta escalabilidade com bancos de dados relacionais exige infraestruturas caríssimas, que podem ser evitadas com outros paradigmas. É aí que entra o MongoDB, famoso banco de dados orientado a documentos, desenvolvido pela 10gen e principal alternativa para aliar a alta escalabilidade com facilidade de uso.\n\nNesse livro, Fernando Boaglio vai ensiná-lo como trabalhar com o MongoDB, principal banco de dados orientado a documentos do mercado. Com ele é possível desenvolver aplicações que atingem alta escalabilidade e de forma tão simples quanto trabalhar com os tradicionais banco de dados relacionais.","category":"Infraestrutura","subcategory":"Dados"},{"url":"https://www.casadocodigo.com.br/products/livro-sql-oracle","nome":"SQL: Uma abordagem para bancos de dados Oracle","img":"/covers/Amazon-SQL-Oracle_large.jpg?v=1416425806","nomeExibicao":"SQL e banco de dados Oracle","title":"SQL","sub":"Uma abordagem para bancos de dados Oracle","author":"Eduardo Gonçalves","content":"Aprender a usar um banco de dados de forma adequada não é uma tarefa fácil. Em um primeiro contato, comandos avançados, como joins e unions, podem ser tão complicados quanto um group by. Além disso, modelar um banco de dados de forma que use o melhor do paradigma relacional não é uma matéria tão simples.\n\nNeste livro, Eduardo Gonçalves ensinará a trabalhar com SQL por meio do banco de dados Oracle, passando por desde como estruturar e criar seus bancos de dados e tabelas, indo para a população dos dados e investigando a fundo como buscar dados adequadamente, montando pesquisas avançadas, com joins, agrupamentos, funções agregadoras e muito mais.","category":"Infraestrutura","subcategory":"Dados"},{"url":"https://www.casadocodigo.com.br/products/livro-admin-linux","nome":"Guia prático do servidor Linux: Administração Linux para iniciantes","img":"/covers/p_c0c149aa-c079-4d5f-ab0f-8d2e01130250_large.jpg?v=1533325770","nomeExibicao":"Administração Linux","title":"Guia prático do servidor Linux","sub":"Administração Linux para iniciantes","author":"Juliano Ramos","content":"O Linux é o sistema operacional mais seguro que você poderá ter em mãos. Empresas como a Dell, Asus e Acer produzem regularmente computadores que utilizam o Linux. Já grandes empresas, como IBM e Google, utilizam-no como estratégia em seus ambientes corporativos. Hoje, praticamente toda a infraestrutura da internet atua sobre o sistema do pinguim. Conhecer e utilizar o Linux para qualquer pessoa que pretende se tornar um profissional em TI não é uma questão opcional, é um pré-requisito.\nEste livro tem como objetivo formar profissionais na Administração de servidores GNU/Linux. Juliano Ramos mostra como se introduzir no sistema Linux desde o primeiro contato, iniciando pelos comandos básicos e finalizando com servidores. Você verá na prática como trabalhar pelo shell script, conhecerá servidores como o SSH, RAID, Apache, Proxy, entre outros, além de lidar com redes, módulos e particionamento de disco.","category":"Infraestrutura","subcategory":"Outros"},{"url":"https://www.casadocodigo.com.br/products/livro-seguranca","nome":"Segurança em aplicações Web","img":"/covers/zhQRY_vRi2-piaw5QkZpc552fcVQhN6fe4zLRb4fXV8_large.jpg?v=1486751361","nomeExibicao":"Segurança","title":"Segurança em aplicações Web","sub":"","author":"Rodrigo Ferreira","content":"Construir uma aplicação Web segura é uma tarefa bem difícil hoje em dia, já que existem diversos tipos de ataques que podem ser realizados contra ela, sendo que outras novas vulnerabilidades vão surgindo com o passar do tempo. Algumas delas estão presentes na infraestrutura da aplicação, sendo bem comum encontrarmos nosso ambiente de produção com softwares desatualizados, como o Sistema Operacional, o SGBD e o Servidor de Aplicações. Mas uma grande parte dos ataques ocorre por conta de vulnerabilidades presentes na própria aplicação, sendo responsabilidade dos desenvolvedores e arquitetos conhecer tais fraquezas e como fazer para evitá-las.\nNeste livro, Rodrigo Ferreira ensina como tratar ataques relacionados a vulnerabilidades presentes na própria aplicação, explicando de maneira detalhada como eles funcionam, como verificar se sua aplicação está vulnerável a eles, e como fazer para corrigir tais inseguranças. Você aprenderá a lidar com ataques como: SQL Injection, Cross-Site Scripting (XSS), Cross-Site Request Forgery (CSRF), Session Hijacking, dentre outros.","category":"Infraestrutura","subcategory":"Outros"},{"url":"https://www.casadocodigo.com.br/products/livro-windows-azure","nome":"Azure: Coloque suas plataformas e serviços no cloud","img":"/covers/azure-featured_large.png?v=1443932991","nomeExibicao":"Windows Azure","title":"Azure","sub":"Coloque suas plataformas e serviços no cloud","author":"Thiago Custódio","content":"A plataforma Azure é uma coleção crescente de serviços integrados que vão desde armazenamento, rede até aplicativos. Não é à toa que é considerado um dos líderes no segmento, sendo já hoje a melhor opção para diversos cenários, e disputando de forma competitiva em todas as outras em que atua.\n\nNeste livro, Thiago Custódio vai mostrar-lhe mais a fundo por que a nuvem e a elasticidade são importantes e, logo no começo, vai conseguir criar uma aplicação com Visual Studio que roda no Azure. Ao longo do livro, você aprenderá alguns dos diversos serviços disponíveis e,ao terminar, você terá entendido e se aprofundado nas principais características da plataforma.","category":"Infraestrutura","subcategory":"Outros"},{"url":"https://www.casadocodigo.com.br/products/livro-ferramentas-devops","nome":"Caixa de Ferramentas DevOps: Um guia para construção, administração e arquitetura de sistemas modernos","img":"/covers/oy0mvtYotVNh0eUSt2CAC3Kf7j_qtMIxtd31jNUYP08_size_1024x768_size_mode_2_large.jpeg?v=1438176025","nomeExibicao":"Ferramentas DevOps","title":"Caixa de Ferramentas DevOps","sub":"Um guia para construção, administração e arquitetura de sistemas modernos","author":"Gleicon Moraes","content":"Sempre que precisamos montar um ambiente, seja para desenvolvimento ou para um servidor que vá executar em produção, gastamos bastante esforço na instalação das dependências necessárias e várias vezes nos pegamos perdendo tempo com detalhes pequenos de configuração pelos quais já passamos várias vezes.\n\nNeste livro, Gleicon Moraes vai ensinar como evitar todos esses problemas com o uso de poderosas ferramentas para criação de ambientes portáveis, fazendo com que você tenha sistemas facilmente reproduzíveis e prontos para executar o que você quiser, sem chateações e problemas obscuros de configuração.","category":"Infraestrutura","subcategory":"Outros"},{"url":"https://www.casadocodigo.com.br/products/livro-thoughtworks-antologia","nome":"Thoughtworks Antologia Brasil: Histórias de aprendizado e inovação","img":"/covers/thoughtworks-antologia-featured_large.png?v=1416319002","nomeExibicao":"ThoughtWorks Antologia Brasil","title":"Thoughtworks Antologia Brasil","sub":"Histórias de aprendizado e inovação","author":"ThoughtWorks","content":"Estar na vanguarda das tecnologias e metodologias de desenvolvimento é uma das principais características da ThoughtWorks, empresa reconhecida mundialmente e onde trabalham nomes como Martin Fowler, Danilo Sato, Rebecca Parsons, Paulo Caroli e muitos outros expoentes da área.\n\nNeste livro, vários colaboradores da ThoughtWorks passam suas experiências com as mais variadas tecnologias e metodologias. Você vai aprender sobre BDD, testes com JavaScript, inovação em startups, agilidade, técnicas de retrospectivas, técnicas avançadas de trabalho com controle de versão e muito mais.\n\nÉ um livro indispensável para quem quer se manter atualizado e entender as tecnologias e métodos trabalhados na principal empresa de consultoria da área.","category":"Infraestrutura","subcategory":"Outros"},{"url":"https://www.casadocodigo.com.br/products/livro-git-github","nome":"Controlando versões com Git e GitHub","img":"/covers/git-github-featured_large.png?v=1416318040","nomeExibicao":"Git e GitHub","title":"Controlando versões com Git e GitHub","sub":"","author":"Alexandre Aquiles, Rodrigo Ferreira","content":"Desenvolver software não é fácil. Há sempre demandas de novas funcionalidades a serem desenvolvidas e de alterações nas funcionalidades já existentes. Por isso, uma das preocupações nos projetos é manter um histórico de evolução do código fonte, facilitando o trabalho de desfazer algumas dessas alterações, caso seja necessário. Além disso, como geralmente trabalhamos em equipe, outra preocupação é sobre a integração do trabalho entre os membros da equipe. Diversos problemas relacionados com essas preocupações podem acontecer durante o desenvolvimento de um software, e, para evitá-los, é essencial a utilização de uma ferramenta de controle de versão.\n\nO Git é uma dessas ferramentas de controle de versão. Foi criado em 2005 por Linus Torvalds, o criador do Linux, e hoje é uma das ferramentas de controle de versão mais utilizadas nos projetos de desenvolvimento de software, por ser mais rápido e eficiente do que as outras ferramentas tradicionais, como CVS e SVN.\n\nJá o GitHub é um serviço web que nos permite hospedar repositórios de projetos que utilizam o Git, facilitando, assim, o trabalho em equipe e a colaboração com projetos open source.\n\nNeste livro, Alexandre Aquiles e Rodrigo Ferreira mostrarão como utilizar o Git para controlar as versões do seu projeto. Serão ensinados comandos para criação de repositórios, trabalho local e remoto, branches, tags, conflitos, dentre outros assuntos. Além disso, será mostrado também como criar uma conta no GitHub e utilizá-la para hospedar seus repositórios.","category":"Infraestrutura","subcategory":"Outros"},{"url":"https://www.casadocodigo.com.br/products/livro-linux","nome":"Começando com o Linux: Comandos, serviços e administração","img":"/covers/linux-featured_large.png?v=1411487268","nomeExibicao":"Linux","title":"Começando com o Linux","sub":"Comandos, serviços e administração","author":"Daniel Romero","content":"Conhecer e utilizar Linux é essencial. Não apenas para um administrador de sistemas, mas também para o desenvolvedor web, para o administrador de banco de dados ou o usuário mais engajado de qualquer sistema vindo do Unix, como o Mac OSX.\n\nNeste livro, Daniel Romero parte desde a instalação do Ubuntu, utilização de comandos básicos, conhecimento do sistema de diretórios para depois atacar processos, configuração de pacotes como Apache, PHP, Java e MySQL, para depois chegar na criação de seus próprios scripts.\n\nEm um linguajar fácil e passo a passo, você vai perder o medo de encarar a linha de comando e os terminais, para tirar o máximo de proveito desse onipresente sistema operacional.","category":"Infraestrutura","subcategory":"Outros"},{"url":"https://www.casadocodigo.com.br/products/livro-devops","nome":"DevOps na prática: entrega de software confiável e automatizada","img":"/covers/devops-featured_large.png?v=1411489207","nomeExibicao":"DevOps","title":"DevOps na prática","sub":"entrega de software confiável e automatizada","author":"Danilo Sato","content":"Entregar software em produção é um processo que tem se tornado cada vez mais difícil no departamento de TI de diversas empresas. Ciclos longos de teste e divisões entre as equipes de desenvolvimento e de operações são alguns\n\ndos fatores que contribuem para este problema. Mesmo equipes ágeis que produzem software entregável ao final de cada iteração sofrem para chegar em produção quando encontram estas barreiras.\n\nDevOps é um movimento cultural e profissional que está tentando quebrar essas barreiras. Com o foco em automação, colaboração, compartilhamento de ferramentas e de conhecimento, DevOps está mostrando que desenvolvedores e engenheiros de sistema têm muito o que aprender uns com os outros.\n\nNeste livro, Danilo Sato mostra como implementar práticas de DevOps e Entrega Contínua para aumentar a frequência de deploys na sua empresa, ao mesmo tempo aumentando a estabilidade e robustez do sistema em produção. Você vai aprender como automatizar o build e deploy de uma aplicação web, como automatizar o gerenciamento da infraestrutura, como monitorar o sistema em produção, como evoluir a arquitetura e migrá-la para a nuvem, além de conhecer diversas ferramentas que você pode aplicar no seu trabalho.","category":"Infraestrutura","subcategory":"Outros"},{"url":"https://www.casadocodigo.com.br/products/vale-presente","nome":"Vale presente Casa do Código","img":"/covers/vale-presente-CDC_large.png?v=1451330431","nomeExibicao":"Vale Presente","title":"Vale presente Casa do Código","sub":"","author":"Casa do Código","content":"É sempre difícil escolher algo para seu amigo que trabalha com tecnologia. A Casa do Código possui um acervo de livros e e-books que vai agradar a todos. Não perca mais seu tempo escolhendo o presente de aniversário e de natal de seu colega.\nO presenteado pode também optar pelo livro impresso, o valor do vale presente só não abate o frete.\nAssim que você realizar a compra do vale presente, basta acessar http://valepresente.casadocodigo.com.br e preencher os dados para presentear seu amigo!","category":"Infraestrutura","subcategory":"Outros"},{"url":"https://www.casadocodigo.com.br/products/livro-entrega-continua-android","nome":"Entrega contínua em Android: Como automatizar a distribuição de apps","img":"/covers/33JmvoJMSmMmf2E7Qns5gMEO7R7PjA1GmyHAQP4RFj0_large.jpg?v=1475188090","nomeExibicao":"Entrega contínua em Android","title":"Entrega contínua em Android","sub":"Como automatizar a distribuição de apps","author":"Roger Silva","content":"Independente de ser um desenvolvedor freelancer ou um time de desenvolvimento de software já maduro, um item especial ao qual o responsável pelo desenvolvimento de um novo software deve dar especial atenção é a entrega do software ao cliente. Como será realizada a entrega? Com qual frequência? Será adotado algum processo automatizado ou a entrega do software será manual? Como o software é validado antes da entrega? Embora já tenha-se discutido sobre essas questões, um vácuo literário permanece quando pensamos em entrega contínua de aplicações mobile.\nNeste livro, Roger Silva vem preencher esta lacuna, explicando como automatizar a distribuição do app para o Google Play, como executar testes automatizados sobre as suas funcionalidades e disponibilizá-lo para a equipe de testes em vários dispositivos. Você verá como tratar todos esses requisitos para que, quando um desenvolvedor comitar seu código-fonte para um repositório de código remoto, uma bateria de testes automatizados seja executada, acompanhada por uma análise de cobertura de código-fonte, verificações de regras de negócios e, por fim, chegando até a etapa de distribuição automatizada do app para o Google Play.","category":"Infraestrutura","subcategory":"Outros"},{"url":"https://www.casadocodigo.com.br/products/livro-arduino-pratico","nome":"Arduino prático: 10 projetos para executar, aprender, modificar e dominar o mundo","img":"/covers/x5J0eymPWtNlvnK1hYy6rGWXHPmsSdGTQHOZAAe9oAo_large.jpg?v=1473971665","nomeExibicao":"Arduino prático","title":"Arduino prático","sub":"10 projetos para executar, aprender, modificar e dominar o mundo","author":"Fernando Bryan Frizzarin","content":"Arduino é uma plataforma de prototipagem formada por uma placa eletrônica com um microprocessador e um ambiente de programação integrado. Recentemente, muito se tem discutido sobre seu uso em projetos de tecnologia: o que é possível fazer? Quais projetos criar? Como, de fato, colocar a mão na massa?\nNeste livro, o prof. Fernando Frizzarin apresenta, com linguagem simples e acessível a praticamente qualquer pessoa, dez projetos que estimularão sua criatividade, desafiando-o a explorar o seu raciocínio e possibilitando o surgimento de novos ideários. Com a montagem e programação detalhada passo a passo, você poderá partir dos projetos preconcebidos, componentes e lógicas básicas para ir além, até onde sua imaginação permitir.","category":"Infraestrutura","subcategory":"Outros"},{"url":"https://www.casadocodigo.com.br/products/livro-mcsa","nome":"Windows Server 2012 R2: Estudo dirigido para MCSA prova 70-410","img":"/covers/WWEj2kGc3k4Bve9orZZbOd15jjodVei1MZcclEfi0fs_large.jpg?v=1467406490","nomeExibicao":"MCSA","title":"Windows Server 2012 R2","sub":"Estudo dirigido para MCSA prova 70-410","author":"Eduardo Popovici","content":"A nova certificação MCSA (Microsoft Certified Solutions Associate) é um título atribuído a profissionais da área de TI que se proponham a entender muito de um determinado assunto, como o Windows Server 2008, Windows Server 2012, Windows 7, Windows 8, SQL Server e Office 365. O MCSA permite que você tenha a base de conhecimento para ocupar um cargo de administrador de sistemas computacionais ou de administrador de rede ou ainda especialista em redes de computadores, e é a etapa mais próxima para a obtenção da certificação Microsoft Certified Solutions Expert (MCSE).\nCom este plano de estudos escrito por Eduardo Popovici, você visitará os assuntos cobrados, bem como terá dicas valiosas e exercícios para treinar, tudo para estar pronto para prestar suas provas e obter sua certificação.","category":"Infraestrutura","subcategory":"Outros"},{"url":"https://www.casadocodigo.com.br/products/livro-plataforma-microsoft","nome":"Desenvolvimento efetivo na plataforma Microsoft: Como desenvolver e suportar software que funciona","img":"/covers/O88xLPJUi5p4RfPTs3gqB6CdU2-F7du4E2Xku88E6As_size_mode_3_size_1280x960_large.jpeg?v=1462562886","nomeExibicao":"Desenvolvimento Microsoft","title":"Desenvolvimento efetivo na plataforma Microsoft","sub":"Como desenvolver e suportar software que funciona","author":"Time de Suporte Microsoft Modern Apps","content":"Os Engenheiros de Suporte Microsoft em Modern Apps têm a oportunidade de trabalhar com sistemas críticos nas maiores companhias do mundo dos mais diversos segmentos. Ao longo dos anos, estes profissionais qualificaram-se no desenvolvimento e suporte baseando-se nas recomendações dos produtos e em boas práticas vivenciadas nas experiências de campo. Trabalhando lado a lado com os clientes, compartilhando conhecimento com milhares de times de desenvolvimento e auxiliando cada pessoa e cada organização a atingir todo o seu potencial.\n\nCom foco em DevOps, .NET Framework, IIS (Internet Information Services) e Microsoft Azure, desenvolvedores e arquitetos estarão aptos a aperfeiçoar a qualidade e disponibilidade de seu software, aumentar seu nível de maturidade em desenvolvimento, economizar tempo e reduzir custos.","category":"Infraestrutura","subcategory":"Outros"},{"url":"https://www.casadocodigo.com.br/products/livro-arduino","nome":"Arduino: Guia para colocar suas ideias em prática","img":"/covers/WGzoHaBKLOVQ3DrSAPWAPZADt1Wzl2Tsb8aMv4PBRmc_size_mode_3_size_1024x768_large.jpeg?v=1456781791","nomeExibicao":"Arduino","title":"Arduino","sub":"Guia para colocar suas ideias em prática","author":"Fernando Bryan Frizzarin","content":"Inovar não é necessariamente inventar, e inventar também não é necessariamente inovar. Inventar é um ato de convivência com o problema, muita imaginação e criatividade. Bons inventores dedicam-se em, principalmente, ouvir e observar o mundo e seus problemas. Hoje, é comum a figura do funcionário que passa dias observando o trabalho de outros funcionários, como lidam com as ferramentas (tecnologias) e com os demais colegas para tentar encontrar (inventar) algum método ou ferramenta que melhore e facilite o trabalho. Já inovação é a concepção de um novo produto ou processo, bem como a agregação de novas funcionalidades que impliquem em melhorias incrementais ao que já existe. Melhorias estas que podem ser no ganho da qualidade, produtividade, usabilidade, longevidade ou competitividade. A inovação começa na invenção.\n\nNeste livro, Fernando Frizzarin tem como objetivo servir como referência para o uso do Arduino de forma a ajudar o leitor a entender todas as suas possibilidades, com experiências que possam ser interconectadas, combinadas, modificadas e aprimoradas para que a necessidade seja suprida. Ou seja, dar subsídios para que o leitor possa, a partir de pequenas montagens e códigos-fontes simples, liberar toda sua criatividade e, assim, inventar e inovar.","category":"Infraestrutura","subcategory":"Outros"},{"url":"https://www.casadocodigo.com.br/products/livro-gae","nome":"Google App Engine: Construindo serviços na nuvem","img":"/covers/wcDpyDSPxRrpeqG0itn55xvz_sD_BZ_LdhTtnEDtTlM_large.jpg?v=1519321935","nomeExibicao":"Google App Engine","title":"Google App Engine","sub":"Construindo serviços na nuvem","author":"Paulo Siécola","content":"O Google App Engine é uma plataforma de computação em nuvem que permite a execução de aplicações Web na infraestrutura do Google. Tudo isso de forma fácil e escalável, com várias opções de utilização gratuitas e sem a necessidade de manutenção em sistemas operacionais ou servidores.\nNesta edição atualizada, Paulo Siécola aborda os aspectos dessa plataforma utilizando Spring Boot - principalmente aqueles relacionados ao desenvolvimento de aplicações em Java. Você verá como interagir com seus recursos, além de como administrá-los por meio das ferramentas disponibilizadas pelo Google App Engine, ou GAE, como é comumente chamado.\nVersões utilizadas: Java 8, Google App Engine Standard Environment com SDK 1.9 e Spring Boot versão 1.5.9.","category":"Infraestrutura","subcategory":"Outros"},{"url":"https://www.casadocodigo.com.br/products/livro-jenkins","nome":"Jenkins: Automatize tudo sem complicações","img":"/covers/8xOWMz71yXGZIMXnCx6qABbwj0p_CcsMlImoan5WqMU_size_mode_3_size_800x600_large.jpeg?v=1455905976","nomeExibicao":"Jenkins","title":"Jenkins","sub":"Automatize tudo sem complicações","author":"Fernando Boaglio","content":"Fazer builds e deploys manuais leva um precioso tempo e é muito comum alguém se esquecer de fazer alguma tarefa, ou tentar fazer várias ao mesmo tempo e dar tudo errado no final. Quando tudo isso fica automatizado com o Jenkins, além de economizar horas de trabalho, você consegue ter mais produtividade de forma customizada.\n\nNeste livro, Fernando Boaglio apresenta os conceitos fundamentais do Jenkins, com estratégias de orquestração, conceito de slaves, deploys, customizações e a utilização dos plugins mais importantes. Entenda como ele funciona internamente e aprenda a construir plugins para estender as funcionalidades dessa incrível ferramenta de integração contínua.","category":"Infraestrutura","subcategory":"Outros"},{"url":"https://www.casadocodigo.com.br/products/livro-docker","nome":"Containers com Docker: Do desenvolvimento à produção","img":"/covers/docker-featured_large.png?v=1443938715","nomeExibicao":"Ambientes com Docker","title":"Containers com Docker","sub":"Do desenvolvimento à produção","author":"Daniel Romero","content":"Dores de cabeça com configuração de ambiente, noites perdidas com versões inválidas de algum pacote e tempo perdido na instalação de pré-requisitos, sendo que tudo isso poderia ser facilmente automatizado e nenhum dos inconvenientes precisaria acontecer.\n\nNeste livro, Daniel Romero mostrará como esses e outros problemas podem ser resolvidos com Docker, poderosa ferramenta que nos permite isolar e manter diferentes ambientes de forma simples e facilmente configurável. Aproveite o primeiro livro sobre Docker do Brasil.\n\nPrefácio escrito por Jérôme Petazzoni, desenvolvedor do Docker.","category":"Infraestrutura","subcategory":"Outros"},{"url":"https://www.casadocodigo.com.br/products/livro-kotlin-android","nome":"Kotlin com Android: Crie aplicativos de maneira fácil e divertida","img":"/covers/p_4d784e4f-769e-4f00-82d9-c1c81628055a_large.jpg?v=1532117965","nomeExibicao":"Kotlin com Android","title":"Kotlin com Android","sub":"Crie aplicativos de maneira fácil e divertida","author":"Kassiano Resende","content":"A linguagem Kotlin vem ganhando cada vez mais destaque no cenário do desenvolvimento de aplicativos. Projetada para ter uma interoperabilidade total com código Java, Kotlin tem sido a primeira escolha na criação de aplicativos Android, sendo multiparadigma e multiplataforma. Trata-se de uma linguagem moderna, concisa e poderosa, oferecendo segurança, clareza e suporte a ferramentas de alta produtividade.\nNeste livro, Kassiano Resende apresenta a linguagem Kotlin tanto para quem já conhece Java ou não, com uma didática prática e divertida. Você verá todos os passos necessários para construir e publicar na Play Store aplicações mobile em Kotlin, no ambiente de desenvolvimento Android Studio. O escopo das aplicações apresentadas no livro vai além das funcionalidades da linguagem, com a utilização de banco de dados, acesso a APIs REST e funcionalidades dos smartphones, como notificações, acesso à galeria de imagens, câmera e localização através de GPS.","category":"Mobile","subcategory":"Android"},{"url":"https://www.casadocodigo.com.br/products/livro-app-inventor","nome":"App Inventor: Seus primeiros aplicativos Android","img":"/covers/CaMWGHXUhWVSWaH4aZazotOcKm3ckVDokQ0IQ5fM0KU_large.jpg?v=1512148345","nomeExibicao":"App Inventor","title":"App Inventor","sub":"Seus primeiros aplicativos Android","author":"Nelson Fabbri Gerbelli, Valéria Helena P. Gerbelli","content":"O App Inventor 2 é uma ferramenta inovadora, desenvolvida pelo Google e mantida hoje pelo Instituto de Tecnologia de Massachusetts (MIT). Com ela, é possível criar aplicativos para dispositivos móveis Android, por meio de uma linguagem visual, sem precisar decorar ou escrever códigos de linguagem de programação. Com um simples arrastar e inserir blocos para a área de programação, em uma interface intuitiva, é uma excelente ferramenta de aprendizado que permite que os recém-chegados à programação de computador criem aplicativos completos.\n\nNeste livro, Nelson e Valéria Gerbelli têm como objetivo proporcionar aos estudantes, educadores e entusiastas por tecnologia o primeiro passo no mundo da programação para dispositivos móveis por meio do App Inventor. Após ser apresentado ao ambiente, você aprenderá na prática a desenvolver alguns aplicativos do zero, partindo de alguns cálculos, até chegar a resultados mais complexos, com um recurso de localização de GPS, tradução de idioma e desenvolvendo um projeto final completo. Dentre as funcionalidades, estão o compartilhamento com outros aplicativos como o WhatsApp, a conexão a um banco de dados em MySQL, e a disponibilização do aplicativo na loja do Google Play Store.","category":"Mobile","subcategory":"Android"},{"url":"https://www.casadocodigo.com.br/products/livro-entrega-continua-android","nome":"Entrega contínua em Android: Como automatizar a distribuição de apps","img":"/covers/33JmvoJMSmMmf2E7Qns5gMEO7R7PjA1GmyHAQP4RFj0_large.jpg?v=1475188090","nomeExibicao":"Entrega contínua em Android","title":"Entrega contínua em Android","sub":"Como automatizar a distribuição de apps","author":"Roger Silva","content":"Independente de ser um desenvolvedor freelancer ou um time de desenvolvimento de software já maduro, um item especial ao qual o responsável pelo desenvolvimento de um novo software deve dar especial atenção é a entrega do software ao cliente. Como será realizada a entrega? Com qual frequência? Será adotado algum processo automatizado ou a entrega do software será manual? Como o software é validado antes da entrega? Embora já tenha-se discutido sobre essas questões, um vácuo literário permanece quando pensamos em entrega contínua de aplicações mobile.\nNeste livro, Roger Silva vem preencher esta lacuna, explicando como automatizar a distribuição do app para o Google Play, como executar testes automatizados sobre as suas funcionalidades e disponibilizá-lo para a equipe de testes em vários dispositivos. Você verá como tratar todos esses requisitos para que, quando um desenvolvedor comitar seu código-fonte para um repositório de código remoto, uma bateria de testes automatizados seja executada, acompanhada por uma análise de cobertura de código-fonte, verificações de regras de negócios e, por fim, chegando até a etapa de distribuição automatizada do app para o Google Play.","category":"Mobile","subcategory":"Android"},{"url":"https://www.casadocodigo.com.br/products/livro-games-android","nome":"Jogos Android: Crie um game do zero usando classes nativas","img":"/covers/games-android-featured_large.png?v=1433544805","nomeExibicao":"Jogos Android","title":"Jogos Android","sub":"Crie um game do zero usando classes nativas","author":"Felipe Torres","content":"195, 300, 800 milhões de dólares!!! Essas são as cifras por trás dos jogos Angry Birds, Candy Crush e Clash of Clans. Quer pensar em cifras menores? Que tal 120 mil reais por dia? Foi o que Flappy Bird chegou a faturar. Pois é, já pensou em trabalhar com algo criativo, divertido e recompensador? Desenvolver jogos pode ser assim. \n\nNeste livro, Felipe Torres mostra como criar um jogo do zero sem usar frameworks e discute as vantagens e desvantagens dessa abordagem usada pelo criador de Flappy Bird. Usando a linguagem Java, você vai desenvolver um jogo para Android e entender de fato como funciona a criação de jogos através da óptica do desenvolvedor e terá mais confiança e informação para decidir os caminhos do que esperamos, seja o novo jogo viral do mercado!","category":"Mobile","subcategory":"Android"},{"url":"https://www.casadocodigo.com.br/products/livro-jogos-android","nome":"Desenvolvimento de Jogos para Android: Explore sua imaginação com o framework Cocos2D","img":"/covers/jogos-android-featured_large.png?v=1411488637","nomeExibicao":"Jogos Android","title":"Desenvolvimento de Jogos para Android","sub":"Explore sua imaginação com o framework Cocos2D","author":"Anderson Leite","content":"Crie histórias e jogos da forma que sempre imaginou! Se você já conhece um pouco de desenvolvimento Android, vai se surpreender com este livro. De forma didática e prática, conceitos são apresentados sempre com aplicações diretas no jogo que é desenvolvido.\n\nConstrua um jogo do início ao fim, sem esquecer a importância do enredo, distribuição, arte e como prender a atenção do jogador. Lógica, matemática e física são apresentados sem traumas. Também conheceremos muitos dos benefícios do framework Cocos2D, utilizado na versão definitiva do nosso game.\n\nVeja o jogo desenvolvido no livro:\nveja o sumário completo","category":"Mobile","subcategory":"Android"},{"url":"https://www.casadocodigo.com.br/products/livro-android","nome":"Google Android: crie aplicações para celulares e tablets","img":"/covers/android-featured_large.png?v=1411489561","nomeExibicao":"Google Android","title":"Google Android","sub":"crie aplicações para celulares e tablets","author":"João Bosco Monteiro","content":"Faça as melhores aplicações Android com as melhores práticas da área. Aprenda como publicar a aplicação e tê-la no ar em 1 dia, saiba como utilizar o máximo dos aparelhos e crie aplicações extremamente ricas para celulares e tablets!\n\nDesenvolva para todas as versões do Android com o Android Studio e conheça as novidades da versão 5.0 (Lollipop)! Durante o livro, você criará uma aplicação que envolverá funcionalidades das suas principais versões e aprenderá como utilizar a ActionBar, o Navigation Drawer e também os novos widgets do Android 5.0, como o botão de ação flutuante e os cartões, e também vai descobrir como engajar o usuário projetando um esquema efetivo de navegação entre as telas do seu aplicativo.","category":"Mobile","subcategory":"Android"},{"url":"https://www.casadocodigo.com.br/products/vale-presente","nome":"Vale presente Casa do Código","img":"/covers/vale-presente-CDC_large.png?v=1451330431","nomeExibicao":"Vale Presente","title":"Vale presente Casa do Código","sub":"","author":"Casa do Código","content":"É sempre difícil escolher algo para seu amigo que trabalha com tecnologia. A Casa do Código possui um acervo de livros e e-books que vai agradar a todos. Não perca mais seu tempo escolhendo o presente de aniversário e de natal de seu colega.\nO presenteado pode também optar pelo livro impresso, o valor do vale presente só não abate o frete.\nAssim que você realizar a compra do vale presente, basta acessar http://valepresente.casadocodigo.com.br e preencher os dados para presentear seu amigo!","category":"Mobile","subcategory":"Android"},{"url":"https://www.casadocodigo.com.br/products/livro-swift-ios","nome":"Swift: Programe para iPhone e iPad","img":"/covers/Swift-ebook_large.png?v=1418170204","nomeExibicao":"Swift e iOS","title":"Swift","sub":"Programe para iPhone e iPad","author":"Guilherme Silveira, Joviane Jardim","content":"Desenvolver aplicativos para iPhone e iPad nunca foi tão prazeroso. Com a nova linguagem da Apple (Swift) e com a recente versão do iOS, o desenvolvimento se torna descomplicado, pois há uma nova gama de recursos disponíveis que mantêm a clássica elegância da principal plataforma mobile do mundo.\n\nProgramadores do mundo inteiro estão aprendendo a programar para iOS com Swift. Nesse livro, Guilherme Silveira e Joviane Jardim vão ensinar como entrar nesse universo e criar sua aplicação, do início ao fim, aprendendo os recursos da nova linguagem e do novo iOS, usando várias boas práticas de programação de quebra.","category":"Mobile","subcategory":"IOS"},{"url":"https://www.casadocodigo.com.br/products/livro-jogos-ios","nome":"Desenvolvimento de Jogos para iOS: Explore sua imaginação com o framework Cocos2D","img":"/covers/jogos-ios-featured_large.png?v=1411488760","nomeExibicao":"Jogos iOS","title":"Desenvolvimento de Jogos para iOS","sub":"Explore sua imaginação com o framework Cocos2D","author":"Mauricio Tollin, Rodrigo Gomes, Anderson Leite","content":"Aprenda a criar seus próprios jogos para iPhone e iPad! Para quem já conhece um pouco do desenvolvimento de aplicativos para iOS e sempre teve vontade de entrar no mundo de desenvolvimento de jogos, este livro ensina como utilizar o Cocos2D, framework gratuito com diversos benefícios para criação de jogos.\n\nVocê construirá um jogo do início ao fim, com transições de telas, sons, animações e tudo mais; enquanto os principais conceitos são apresentados de forma didática e prática.\n\nVeja como ficará o seu jogo ao final do livro:\nveja o sumário completo","category":"Mobile","subcategory":"IOS"},{"url":"https://www.casadocodigo.com.br/products/livro-iphone-ipad-ios","nome":"iOS: Programe para iPhone e iPad","img":"/covers/iphone-ipad-ios-featured_large.png?v=1411490094","nomeExibicao":"iOS, iPhone e iPad","title":"iOS","sub":"Programe para iPhone e iPad","author":"Rafael Steil","content":"Atualmente, uma grande parcela do mercado de celulares e tablets pertence à Apple, com seus famosos iPhone e iPad. Aprenda a criar aplicações que explorem o máximo da poderosa plataforma sobre a qual esses dispositivos funcionam, o iOS.\n\nAprenda o Objective-C de forma descomplicada e comece em poucas horas a criar suas aplicações e testá-las em seus dispositivos e nos emuladores.\n\nNesta nova versão completamente revisada, há 100% de compatibilidade com Xcode 5 e iOS 7, um novo capítulo sobre storyboards, todas as imagens com o layout do iOS 7 e exemplos revisados e aprimorados.","category":"Mobile","subcategory":"IOS"},{"url":"https://www.casadocodigo.com.br/products/vale-presente","nome":"Vale presente Casa do Código","img":"/covers/vale-presente-CDC_large.png?v=1451330431","nomeExibicao":"Vale Presente","title":"Vale presente Casa do Código","sub":"","author":"Casa do Código","content":"É sempre difícil escolher algo para seu amigo que trabalha com tecnologia. A Casa do Código possui um acervo de livros e e-books que vai agradar a todos. Não perca mais seu tempo escolhendo o presente de aniversário e de natal de seu colega.\nO presenteado pode também optar pelo livro impresso, o valor do vale presente só não abate o frete.\nAssim que você realizar a compra do vale presente, basta acessar http://valepresente.casadocodigo.com.br e preencher os dados para presentear seu amigo!","category":"Mobile","subcategory":"IOS"},{"url":"https://www.casadocodigo.com.br/products/livro-cordova-avancado","nome":"Cordova avançado e PhoneGap: Um guia detalhado do zero à publicação","img":"/covers/Amazon-Cordova-Avancado-Phonegap_large.jpg?v=1520620175","nomeExibicao":"Cordova avançado e PhoneGap","title":"Cordova avançado e PhoneGap","sub":"Um guia detalhado do zero à publicação","author":"Diogo Machado","content":"Construir um aplicativo híbrido com Cordova e PhoneGap vai muito além de simplesmente codificar um HTML com JavaScript, ou mesmo usar um framework popular do mercado. É preciso uma base sólida de conhecimento nos mínimos detalhes para poder construir um aplicativo na íntegra e entregar um resultado profissional.\n\nNeste livro, Diogo Machado se volta aos profissionais da área de tecnologia que já possuam uma experiência básica com Cordova e PhoneGap, mas que desejam expandir suas possibilidades e tornar suas aplicações mais robustas. Ao acompanhar a criação de um projeto completo, você verá como utilizar os principais plug-ins, integrar a plataforma Firebase, construir elementos visuais do zero usando código web e, o melhor, com todo o processo de publicação detalhado em Android e iOS.","category":"Mobile","subcategory":"Multiplataforma"},{"url":"https://www.casadocodigo.com.br/products/livro-ionic-framework","nome":"Ionic Framework: Construa aplicativos para todas as plataformas mobile","img":"/covers/OsdcfBgqoPY_jv4WXwum3vhGtACPSTDD8MT6eUXHRfo_large.jpg?v=1498853001","nomeExibicao":"Ionic Framework","title":"Ionic Framework","sub":"Construa aplicativos para todas as plataformas mobile","author":"Adrian Gois","content":"Com a crescente difusão dos SmartPhones, surgiu uma grande quantidade de Sistemas Operacionais, o que por consequência aumentava a dificuldade em padronizar uma linha de desenvolvimento de aplicações que fossem portáveis ou multiplataforma. Por conta disto, surgiram os frameworks para compilação híbrida de aplicativos sendo desenvolvidos em uma única linguagem. Hoje, sabe-se que isso é possível com a mesclagem de HTML, JavaScript e CSS, basicamente. Dentro deste contexto, uma ferramenta se destaca, não apenas por compilar de forma híbrida, mas por oferecer diversos componentes, suporte a debugs e fácil aprendizado através de linguagens já conhecidas. Este é o poderoso Ionic Framework. Nele é possível utilizar componentes responsivos e atrativos para o desenvolvimento dos aplicativos, com a possibilidade de compilação e fácil instalação nas diferentes plataformas mobile. Seu foco é o front view dos aplicativos, isto é, fornece componentes para o desenvolvimento da interface dos aplicativos, fazendo o controle através do AngularJS e sendo compilado pelo PhoneGap.\nNeste livro, Adrian Gois explora o Ionic Framework em sua versão 1.0, orientando o leitor desde sua instalação, com a preparação do ambiente de desenvolvimento, passando pelos comandos básicos até chegar a aspectos avançados, utilizando Angular 1. Por meio da criação de um aplicativo de exemplo, que será um Cardápio Móvel, você vai evoluir seu desenvolvimento conforme aprende a teoria sobre Ionic e insere novos componentes na prática.","category":"Mobile","subcategory":"Multiplataforma"},{"url":"https://www.casadocodigo.com.br/products/livro-xamarin-forms","nome":"Xamarin Forms: Desenvolvimento de aplicações móveis multiplataforma","img":"/covers/r6aF8viT0zglCz5-d5UQhZHSAhBVot7lXiqjgEpd8tg_large.jpg?v=1484342109","nomeExibicao":"Xamarin Forms","title":"Xamarin Forms","sub":"Desenvolvimento de aplicações móveis multiplataforma","author":"Everton Coimbra de Araújo","content":"O Xamarin surgiu como uma inovação para o ramo do desenvolvimento móvel, tornando mais fácil e produtiva a entrega de aplicativos móveis para diferentes plataformas. Em conjunto com o Visual Studio, o Xamarin nos permite criar aplicativos móveis usando a linguagem C# e a plataforma .NET, a fim de ter a experiência de desenvolvimento híbrido para os principais dispositivos com iOS, Android e Windows Phone.\nNeste livro, Everton Coimbra traz, na prática, o desenvolvimento de aplicações multiplataforma com o Xamarin e Xamarin Forms, apresentando conceitos como componentes, ações, acesso a bases de dados via SQLite, mapas e muito mais. Explorando as potencialidades do Xamarin e de tecnologias afins, você acompanhará a construção de um aplicativo para diferentes dispositivos móveis a partir de uma mesma estrutura de código.","category":"Mobile","subcategory":"Multiplataforma"},{"url":"https://www.casadocodigo.com.br/products/livro-cordova-phonegap","nome":"Aplicações mobile híbridas com Cordova e PhoneGap","img":"/covers/KfILNc_rMuuHlT3Jgh1nLQWbAM9Ct8Y_3egeItyVI-s_size_mode_3_size_1024x768_large.jpeg?v=1454700566","nomeExibicao":"Cordova e Phonegap","title":"Aplicações mobile híbridas com Cordova e PhoneGap","sub":"","author":"Sérgio Lopes","content":"Mobile é a plataforma do futuro, e as Apps são parte importante desse cenário. Mas programar pensando no mundo multiplataforma de hoje é trabalhoso e custoso, sobretudo para quem vem da Web e está acostumado à portabilidade do HTML, do CSS e do JavaScript.\n\nNeste livro, Sérgio Lopes mostra o Cordova, a solução para Apps híbridas mais usada no mundo. Escreva um único código baseado em HTML5 e tenha Apps de verdade para iOS, Android e Windows Phone. Com projetos práticos, você vai ver Cordova desde o início até casos complexos de integração com hardware. Vai entender onde o PhoneGap se encaixa e até criar uma App com Ionic.","category":"Mobile","subcategory":"Multiplataforma"},{"url":"https://www.casadocodigo.com.br/products/vale-presente","nome":"Vale presente Casa do Código","img":"/covers/vale-presente-CDC_large.png?v=1451330431","nomeExibicao":"Vale Presente","title":"Vale presente Casa do Código","sub":"","author":"Casa do Código","content":"É sempre difícil escolher algo para seu amigo que trabalha com tecnologia. A Casa do Código possui um acervo de livros e e-books que vai agradar a todos. Não perca mais seu tempo escolhendo o presente de aniversário e de natal de seu colega.\nO presenteado pode também optar pelo livro impresso, o valor do vale presente só não abate o frete.\nAssim que você realizar a compra do vale presente, basta acessar http://valepresente.casadocodigo.com.br e preencher os dados para presentear seu amigo!","category":"Mobile","subcategory":"Multiplataforma"},{"url":"https://www.casadocodigo.com.br/products/livro-pwa","nome":"Progressive Web Apps: Construa aplicações progressivas com React","img":"/covers/aEqPKxA4VUIMcHNjYFHdKwfTqWB70NGgvn15jJrXlAM_large.jpg?v=1522973294","nomeExibicao":"Progressive Web Apps","title":"Progressive Web Apps","sub":"Construa aplicações progressivas com React","author":"Guilherme Pontes","content":"PWA é um acrônimo para Progressive Web Apps, ou Aplicações Web Progressivas. Com o passar dos dias, mais e mais sistemas mobile e navegadores suportam os requisitos PWA, com uma expectativa real de que a Progressive Enhancement, ou melhoria progressiva, deixe de apenas pertencer às boas práticas de desenvolvimento web e passe a ser norma. Desenvolver com melhoria progressiva é um paradigma em que a aplicação deverá estar disponível para todos, sejam usuários de microcomputadores ou smartphones, com browsers atualizados ou obsoletos, com conexão à internet ou não, propiciando uma experiência de acesso contínuo sem nenhum tipo de restrição tecnológica.\nNeste livro, Guilherme Pontes disseca a construção de uma aplicação progressiva com React e outras ferramentas, como o Pure.css e o servidor Nginx. Depois de ser apresentado ao mundo das PWAs, você passará por todos os passos da construção da aplicação, evoluindo-a com as mãos na massa, vendo de perto cada tecnologia adotada. No final, você terá um exemplo de PWA funcional e bem codificado, com todos os detalhes dos requisitos do desenvolvimento até a publicação em um ambiente real de produção.\nAs versões das ferramentas utilizadas são: React 15.6.1; Node.JS 6.13.0; Pure.CSS 1.0.0; Nginx 1.12.2; Webpack 3.0.0","category":"Mobile","subcategory":"Outros"},{"url":"https://www.casadocodigo.com.br/products/livro-windows-phone-runtime","nome":"Criando aplicações para o seu Windows Phone - Edição Windows Runtime","img":"/covers/windows-phone-runtime-featured_large.png?v=1416318048","nomeExibicao":"Windows Phone Runtime Edition","title":"Criando aplicações para o seu Windows Phone - Edição Windows Runtime","sub":"","author":"Gabriel Schade Cardoso","content":"A plataforma Windows Phone é bastante poderosa e similar às outras plataformas da Microsoft, o que facilita bastante para os já desenvolvedores do .NET. Você aprenderá seus principais conceitos de forma prática, para que possa criar excelentes aplicativos e tudo isso usando o Windows Runtime.\n\nDurante o livro, você desenvolverá um aplicativo de compras e será introduzido a cada uma das funcionalidades de maneira bastante didática. Ao término da leitura, você terá sua aplicação completa, utilizando dados, processamento assíncrono e vários conceitos de design para melhorar a experiência do usuário.\n\nEdição com Windows Runtime","category":"Mobile","subcategory":"Outros"},{"url":"https://www.casadocodigo.com.br/products/livro-windows-phone","nome":"Criando aplicações para o seu Windows Phone","img":"/covers/windows-phone-featured_large.png?v=1411487947","nomeExibicao":"Windows Phone","title":"Criando aplicações para o seu Windows Phone","sub":"","author":"Gabriel Schade Cardoso","content":"A plataforma Windows Phone é bastante poderosa e similar as outras plataformas da Microsoft, o que facilita bastante para os já desenvolvedores do .NET. Você aprenderá os principais conceitos da plataforma de forma prática, para que possa criar excelentes aplicativos.\n\nDurante o livro, você desenvolverá um aplicativo de compras e será introduzido em cada uma das funcionalidades de maneira bastante didática. Ao término da leitura você terá sua aplicação completa, utilizando dados, processamento assíncrono e vários conceitos de design para melhorar a experiência do usuário.","category":"Mobile","subcategory":"Outros"},{"url":"https://www.casadocodigo.com.br/products/vale-presente","nome":"Vale presente Casa do Código","img":"/covers/vale-presente-CDC_large.png?v=1451330431","nomeExibicao":"Vale Presente","title":"Vale presente Casa do Código","sub":"","author":"Casa do Código","content":"É sempre difícil escolher algo para seu amigo que trabalha com tecnologia. A Casa do Código possui um acervo de livros e e-books que vai agradar a todos. Não perca mais seu tempo escolhendo o presente de aniversário e de natal de seu colega.\nO presenteado pode também optar pelo livro impresso, o valor do vale presente só não abate o frete.\nAssim que você realizar a compra do vale presente, basta acessar http://valepresente.casadocodigo.com.br e preencher os dados para presentear seu amigo!","category":"Mobile","subcategory":"Outros"},{"url":"https://www.casadocodigo.com.br/products/livro-rust-funcional-concorrente","nome":"Programação Funcional e Concorrente em Rust","img":"/covers/fjRCXKbPMIcdYdC5HjX_nh6yUyQwwxV6aIOE7G_nYS4_large.jpg?v=1519941170","nomeExibicao":"Rust Funcional e Concorrente","title":"Programação Funcional e Concorrente em Rust","sub":"","author":"Julia Naomi Boeira","content":"Rust é uma linguagem de nível de sistema com algumas características que são grandes diferenciais, como ter segurança de memória sem coletor de lixo, possibilitar concorrência sem corrida de dados, abstração sem overhead e um compilador que garante segurança no alocamento de recursos. Com Rust, pensar em Programação Funcional será algo muito intuitivo no desenvolvimento.\nNeste livro, Julia Naomi traz todo o potencial do Rust, apresentando-o como uma ótima opção às outras linguagens, inclusive as de mais alto nível, sendo até possível implementar TDD. Você verá como Programação Funcional se associa a Rust, em comparação com Clojure, com foco em funções, traits, iterators, adapters e consumers. Além disso, você se aprofundará em sua principal característica, a concorrência, nos diversos modos que o Rust oferece, como a criação de threads, o compartilhamento de estados e a transferência de informações por canais. A autora ainda apresenta quatro frameworks HTTP, sendo dois de alto nível (Iron e Nickel), um de baixo nível (Hyper) e um de programação assíncrona (Tokio), com os quais você já pode colocar a mão na massa.","category":"Programação","subcategory":"Funcional"},{"url":"https://www.casadocodigo.com.br/products/livro-programacao-funcional-net","nome":"Programação funcional em .NET: Explore um novo universo","img":"/covers/Mjwq2cGKbD4-KWV7nQi4LpDvZrMH1AcxBKMZtbbpHMg_large.jpg?v=1507321170","nomeExibicao":"Programação funcional em .NET","title":"Programação funcional em .NET","sub":"Explore um novo universo","author":"Gabriel Schade Cardoso","content":"Apesar de sua elegância e produtividade, durante muito tempo a programação funcional foi deixada de lado pela maioria dos programadores, mas hoje frequentemente enfrentamos momentos em que a equipe precisa ser altamente produtiva e está cada vez mais comum a necessidade de escrevermos programas que processam grandes conjuntos de dados de forma distribuída entre processadores ou computadores. Nunca houve época melhor para aprender programação funcional do que agora.\nNeste livro, Gabriel Schade explorará os motivos do ganho recente de popularidade da programação funcional, mudança principalmente graças à incorporação de diversos conceitos funcionais em linguagens populares como Java e C#. Utilizando F#, a linguagem voltada a este paradigma na plataforma .NET, sempre fazendo o paralelo em C# para ajudá-lo na aprendizagem, você verá exemplos com estruturas de dados imutáveis, funcionalidades importantes do paradigma funcional, através da criação de uma aplicação web. O livro vem desmistificar o paradigma funcional com exemplos práticos e contextos reais, para que seja cada vez mais popular entre os desenvolvedores que desejam explorar este novo universo.\nEdição atualizada: agora todos os projetos do livro utilizam a plataforma .NET Core, a nova plataforma open-source e multiplataforma do .NET. O livro foi totalmente atualizado para utilizarmos a tecnologia mais recente da Microsoft. Além disso você poderá construir aplicações multiplataformas em .NET utilizando os sistemas operacionais Linux e Mac.","category":"Programação","subcategory":"Funcional"},{"url":"https://www.casadocodigo.com.br/products/livro-haskell","nome":"Haskell: Uma introdução à programação funcional","img":"/covers/gTRsVcwn5ZDw42nu4hw-fQJrUiTm7HkKH-nU-M_2w2g_large.jpg?v=1494618758","nomeExibicao":"Haskell","title":"Haskell","sub":"Uma introdução à programação funcional","author":"Alexandre Garcia de Oliveira","content":"A programação funcional é um paradigma de programação que trata de aplicação de funções matemáticas, evitando alteração de estado e mutabilidade de dados. Uma de suas características é o estilo de estrutura declarativa que se opõe ao estilo imperativo. Muitas linguagens que suportam apenas o paradigma funcional estão crescendo no mercado, dentre as quais Haskell se destaca por ser pura e ser estaticamente tipada, seguindo o conceito de laziness.\n\nNeste livro, Alexandre Oliveira apresenta a linguagem Haskell, desde sua instalação até conceitos mais complexos como lambda, currying e mônadas. Com um modelo mental novo e uma caixa de ferramentas de programação extremamente moderna, essa linguagem pura e funcional nos dá insights valiosos para a construção de aplicações. Haskell é muito usado para a pesquisa em linguagens de programação e tem um dos sistemas de tipos mais avançados disponíveis. A promessa é a de entregar programas sólidos mais rápido ao mercado, trazendo novas formas de se escrever código correto, eficiente e fácil de manter.","category":"Programação","subcategory":"Funcional"},{"url":"https://www.casadocodigo.com.br/products/livro-elixir","nome":"Elixir: Do zero à concorrência","img":"/covers/Lqh65YPrQtMLoE3f-VqbhuiQgdv6t4iOvD3plVQl_64_large.jpg?v=1491592655","nomeExibicao":"Elixir","title":"Elixir","sub":"Do zero à concorrência","author":"Tiago Davi","content":"Hoje em dia, com os processadores multi-core, é possível explorar muito mais a distribuição de tarefas ao longo do desenvolvimento. Apesar disso, muitos programadores ainda continuam escrevendo código de maneira clássica, sem tirar o devido proveito das possibilidades e, portanto, não alcançando o resultado mais eficiente. Elixir é uma linguagem de programação moderna, dinâmica e funcional, baseada em processos que se comunicam isoladamente. Com ela, podemos resolver problemas de escalabilidade, tolerância a falhas e alta concorrência, sem abrir mão de desempenho e produtividade.\nNeste livro, Tiago Davi apresenta a linguagem de programação Elixir, que, por ser uma linguagem imutável e utilizar o paradigma funcional, nos permite pensar em termos de funções e transformação de dados. Você poderá executar código em pequenos processos, cada um com seu próprio estado, de modo que a construção de sistemas distribuídos e concorrentes seja feita de forma natural, transparente e fácil.","category":"Programação","subcategory":"Funcional"},{"url":"https://www.casadocodigo.com.br/products/livro-scala","nome":"Scala: Como escalar sua produtividade","img":"/covers/ZYMBZ75bNReKJshi21Zyxagim170TKgld9RHzznyaHo_large.jpg?v=1481302958","nomeExibicao":"Scala","title":"Scala","sub":"Como escalar sua produtividade","author":"Paulo Siqueira","content":"Scala é uma linguagem que une Orientação a Objetos e Programação Funcional, de sintaxe enxuta e estaticamente tipada, projetada para expressar padrões de programação de uma forma concisa e elegante. Para desenvolvedores com conhecimento em linguagens orientadas a objetos, como Java ou C#, Scala é um passo natural, oferecendo o lado funcional como um desafio em termos de aprendizagem, mas com muitos recursos já familiares. Seu grande trunfo é trazer tudo isso para a Java Virtual Machine, o ambiente de execução utilizado pela linguagem Java, pois Java e Scala se integram de forma muito transparente.\nNeste livro, Paulo JCranky Siqueira apresenta os principais recursos e características da linguagem, bem como conceitos indispensáveis para seu uso efetivo, tratando de elementos da API que todo programador Scala precisa conhecer, como classes e hierarquia das classes fundamentais da linguagem, API de coleções e parseamento de arquivos XML.","category":"Programação","subcategory":"Funcional"},{"url":"https://www.casadocodigo.com.br/products/livro-ocaml","nome":"OCaml: Programação funcional na prática","img":"/covers/eBook-OCAML_large.png?v=1420474743","nomeExibicao":"OCaml","title":"OCaml","sub":"Programação funcional na prática","author":"Andrei de Araújo Formiga","content":"Programação funcional é um assunto cada vez mais frequente entre desenvolvedores. Seja porque linguagens tradicionais como Java, C++ e C# ganham mais características funcionais a cada versão, seja porque muitas novas linguagens que têm surgido (Swift da Apple, Rust da Mozilla, Hack do Facebook) mostram uma forte influência da programação funcional, o fato é que a programação funcional, antes considerada restrita à academia, se torna cada vez mais parte do dia a dia dos desenvolvedores de todos os tipos e plataformas. Além dos benefícios abstratos de aprender um novo paradigma de programação, aprender programação funcional também serve como preparação para se atualizar nas linguagens mais tradicionais e para aprender as novas linguagens que estão aparecendo.\n\nEntre as linguagens funcionais, OCaml é uma ótima opção para começar no paradigma. Programas escritos em OCaml são compilados para código rápido (próximo do desempenho de C e C++), mas a linguagem é expressiva e de alto nível, similar a linguagens como Python e Ruby. O sistema de tipos da linguagem OCaml é muitas vezes citado como um bom exemplo de tipagem estática; é poderoso,  permitindo expressar ideias e restrições complexas com tipos, mas, ao mesmo tempo, não obriga o programador a declarar os tipos das variáveis. OCaml também inclui tipos de dados algébricos e pattern matching, duas características que, quem se acostuma a usar, passa a achar indispensáveis em qualquer linguagem. Ele também possibilita o uso de características imperativas, facilitando a transição para quem não tem experiência prévia com programação funcional, reduzindo o tempo necessário para se tornar produtivo na linguagem.\n\nEste livro tem como objetivo ensinar os fundamentos da programação funcional, e, ao mesmo tempo, tornar o leitor competente na linguagem OCaml, capacitando-o a ler a maior parte do código open source disponível na linguagem e a criar seus próprios projetos com ela.","category":"Programação","subcategory":"Funcional"},{"url":"https://www.casadocodigo.com.br/products/vale-presente","nome":"Vale presente Casa do Código","img":"/covers/vale-presente-CDC_large.png?v=1451330431","nomeExibicao":"Vale Presente","title":"Vale presente Casa do Código","sub":"","author":"Casa do Código","content":"É sempre difícil escolher algo para seu amigo que trabalha com tecnologia. A Casa do Código possui um acervo de livros e e-books que vai agradar a todos. Não perca mais seu tempo escolhendo o presente de aniversário e de natal de seu colega.\nO presenteado pode também optar pelo livro impresso, o valor do vale presente só não abate o frete.\nAssim que você realizar a compra do vale presente, basta acessar http://valepresente.casadocodigo.com.br e preencher os dados para presentear seu amigo!","category":"Programação","subcategory":"Funcional"},{"url":"https://www.casadocodigo.com.br/products/livro-construct2","nome":"Construct 2: Crie o seu primeiro jogo multiplataforma","img":"/covers/eBook-Construct-2_large.jpg?v=1516986781","nomeExibicao":"Construct 2","title":"Construct 2","sub":"Crie o seu primeiro jogo multiplataforma","author":"Diego Martins de Pinho, Bruna Escudelario","content":"O mercado de jogos no Brasil e o número de pessoas interessadas em ingressar nele não param de crescer. Porém, a maioria das plataformas para produção de jogos exige tanto background tecnológico que acaba desanimando qualquer um. Felizmente, o Construct 2 surgiu pensando no usuário que deseja desenvolver suas próprias ideias, sem a necessidade de possuir algum conhecimento técnico prévio.\nNeste livro, Diego e Bruna provam que qualquer um é capaz de construir seus próprios jogos e exportá-los nos mais diversos formatos. Você verá como funcionam todos os mecanismos para criar um jogo de plataforma completo, com todas as telas, sistema de inimigos e movimentação dos personagens, que funcionará tanto em navegadores como em celulares!","category":"Programação","subcategory":"Games"},{"url":"https://www.casadocodigo.com.br/products/livro-lean-game-development","nome":"Lean Game Development: Desenvolvimento enxuto de jogos","img":"/covers/AMlqJB2HHf2DrJmOv7CcDavslB_Bn28__SmqTx0Ry9I_large.jpg?v=1492115019","nomeExibicao":"Lean Game Development","title":"Lean Game Development","sub":"Desenvolvimento enxuto de jogos","author":"Julia Naomi Boeira","content":"Lean Game Development, ou Desenvolvimento Enxuto de Jogos, é um modelo de produção de jogos pensado de forma a atender todas as necessidades da indústria de jogos. Sendo orgânico a mudanças por meio de constantes reviews, ele oferece uma alternativa metodológica que pode nos auxiliar a eliminar desperdícios, reduzir bugs, obter resultados no menor tempo possível, fortalecer e empoderar o trabalho da equipe.\nNeste livro, Julia Naomi apresenta o Lean Game Development, de modo que se compreenda que o jogo digital é também um software, e que o desenvolvimento de software pode ser visto como um jogo cooperativo de invenção e comunicação na qual todas as peças são importantes. Você aprenderá sobre diversos aspectos do desenvolvimento lean aplicados a jogos, como Inceptions e MVPs, desenvolvimento guiado a testes, integração contínua, geração de hipóteses, medições e análises.","category":"Programação","subcategory":"Games"},{"url":"https://www.casadocodigo.com.br/products/livro-logica-jogo","nome":"A lógica do jogo: Recriando clássicos da história dos videogames","img":"/covers/5LRsiQ-WvbmgPiUbF3xe1Is6RcorSCk5tuYbR0A__3Q_size_mode_3_size_800x600_large.jpeg?v=1452288754","nomeExibicao":"Lógica do jogo","title":"A lógica do jogo","sub":"Recriando clássicos da história dos videogames","author":"Marcus Becker","content":"Se você já foi cativado por jogos clássicos como Pac man, Snake e Tetris, e surgiu a curiosidade sobre os bastidores destes e de demais games, este livro é sua porta de entrada para aprender como eles funcionam. Você não vai apenas recriar alguns grandes jogos do mundo do entretenimento eletrônico, mas sim entender, de forma prática, a lógica envolvida em cada um deles, cujas mecânicas são utilizadas até hoje em muitos jogos modernos.\n\nNeste livro, Marcus Becker ensina a desenvolver seis jogos clássicos, abordando aspectos gerais do desenvolvimento de jogos de forma gradual, desde a movimentação do personagem até o uso de sons e imagens. Quando terminar o último capítulo, você poderá desenvolver qualquer um dos jogos apresentados de forma completa, com início, meio e fim.","category":"Programação","subcategory":"Games"},{"url":"https://www.casadocodigo.com.br/products/livro-games-android","nome":"Jogos Android: Crie um game do zero usando classes nativas","img":"/covers/games-android-featured_large.png?v=1433544805","nomeExibicao":"Jogos Android","title":"Jogos Android","sub":"Crie um game do zero usando classes nativas","author":"Felipe Torres","content":"195, 300, 800 milhões de dólares!!! Essas são as cifras por trás dos jogos Angry Birds, Candy Crush e Clash of Clans. Quer pensar em cifras menores? Que tal 120 mil reais por dia? Foi o que Flappy Bird chegou a faturar. Pois é, já pensou em trabalhar com algo criativo, divertido e recompensador? Desenvolver jogos pode ser assim. \n\nNeste livro, Felipe Torres mostra como criar um jogo do zero sem usar frameworks e discute as vantagens e desvantagens dessa abordagem usada pelo criador de Flappy Bird. Usando a linguagem Java, você vai desenvolver um jogo para Android e entender de fato como funciona a criação de jogos através da óptica do desenvolvedor e terá mais confiança e informação para decidir os caminhos do que esperamos, seja o novo jogo viral do mercado!","category":"Programação","subcategory":"Games"},{"url":"https://www.casadocodigo.com.br/products/livro-aprendendo-computacao-ruby","nome":"Introdução à Computação: Da Lógica aos jogos com Ruby","img":"/covers/introducao-ruby-featured_9c39896f-ea67-4389-9f96-43a7a4de2b64_large.png?v=1432680156","nomeExibicao":"Computação com Ruby","title":"Introdução à Computação","sub":"Da Lógica aos jogos com Ruby","author":"Guilherme Silveira","content":"Em uma sociedade global que esbanja desenvolvimento tecnológico, aprender a programar passa a ser um conhecimento estratégico. Pensamentos transformados em linhas de código se tornam programas, jogos, sites e aplicativos. O homem pensa em ir até Marte e mergulha nos mistérios da ciência. Na fronteira de tudo isso, está o código.\n\nNeste livro, Guilherme Silveira ensina as principais matérias introdutórias dos cursos de computação, fazendo você criar seus primeiros jogos de computador. Entenda como seu programa toma decisões e domine o fluxo de sua execução com recursão. Decifre toda a sequência de um programa de computador entendendo a sua pilha de execução e domine a lógica por trás da criação de software.","category":"Programação","subcategory":"Games"},{"url":"https://www.casadocodigo.com.br/products/livro-jogos-mobile-cordova","nome":"Jogos em HTML5: Explore o mobile e física","img":"/covers/jogos-mobile-cordova-featured_large.png?v=1413474311","nomeExibicao":"Jogos Mobile com HTML5","title":"Jogos em HTML5","sub":"Explore o mobile e física","author":"Éderson Cássio","content":"O HTML 5 é uma linguagem praticamente onipresente. Ela está presente nos computadores, tablets, celulares e vários outros dispositivos. Essa onipresença, aliada com o poder da linguagem e suas novas especificações, faz com que ela também seja usada para desenvolver jogos.\n\nMas como fazer jogos com HTML 5 que funcionam bem no mobile? A resposta para isso é o uso do Apache Cordova. Uma tecnologia que torna o HTML 5 em aplicativos nativos, que vão aproveitar o melhor de cada plataforma mobile.\n\nNesse livro, Éderson Cássio vai ensinar como criar jogos nativos para o Mobile com HTML 5, através do Apache Cordova e como usar recursos avançados, como física, controle de colisão, reconhecimentos de eventos touch e muito mais.","category":"Programação","subcategory":"Games"},{"url":"https://www.casadocodigo.com.br/products/livro-jogos-html-javascript","nome":"Desenvolva jogos com HTML5 Canvas e JavaScript","img":"/covers/jogos-html-javascript-featured_large.png?v=1411488497","nomeExibicao":"Jogos com HTML5","title":"Desenvolva jogos com HTML5 Canvas e JavaScript","sub":"","author":"Éderson Cássio","content":"O mercado dos jogos está cada vez mais forte e sendo adotado nos navegadores, com os jogos feitos em HTML5 através da nova especificação de Canvas. Com conhecimento de HTML5 e um pouco de JavaScript, é possível criar jogos extremamente poderosos e com um alto grau de entretenimento. Os tão conhecidos jogos \"viciantes\".\n\nNesse livro, Éderson Cássio mostra como você pode usar as tecnologias tradicionais da web para criar jogos 2D. Você vai aprender a movimentar sprites, tratar colisão e eventos do teclado de forma especial para os jogos, aprender boas práticas para evitar que seu jogo sofra de lentidão e muitas outras técnicas divertidas e interessantes. E no final do livro, você ainda publica seu próprio jogo e o integra com as redes sociais, para seus amigos acessarem.","category":"Programação","subcategory":"Games"},{"url":"https://www.casadocodigo.com.br/products/livro-jogos-ios","nome":"Desenvolvimento de Jogos para iOS: Explore sua imaginação com o framework Cocos2D","img":"/covers/jogos-ios-featured_large.png?v=1411488760","nomeExibicao":"Jogos iOS","title":"Desenvolvimento de Jogos para iOS","sub":"Explore sua imaginação com o framework Cocos2D","author":"Mauricio Tollin, Rodrigo Gomes, Anderson Leite","content":"Aprenda a criar seus próprios jogos para iPhone e iPad! Para quem já conhece um pouco do desenvolvimento de aplicativos para iOS e sempre teve vontade de entrar no mundo de desenvolvimento de jogos, este livro ensina como utilizar o Cocos2D, framework gratuito com diversos benefícios para criação de jogos.\n\nVocê construirá um jogo do início ao fim, com transições de telas, sons, animações e tudo mais; enquanto os principais conceitos são apresentados de forma didática e prática.\n\nVeja como ficará o seu jogo ao final do livro:\nveja o sumário completo","category":"Programação","subcategory":"Games"},{"url":"https://www.casadocodigo.com.br/products/livro-jogos-android","nome":"Desenvolvimento de Jogos para Android: Explore sua imaginação com o framework Cocos2D","img":"/covers/jogos-android-featured_large.png?v=1411488637","nomeExibicao":"Jogos Android","title":"Desenvolvimento de Jogos para Android","sub":"Explore sua imaginação com o framework Cocos2D","author":"Anderson Leite","content":"Crie histórias e jogos da forma que sempre imaginou! Se você já conhece um pouco de desenvolvimento Android, vai se surpreender com este livro. De forma didática e prática, conceitos são apresentados sempre com aplicações diretas no jogo que é desenvolvido.\n\nConstrua um jogo do início ao fim, sem esquecer a importância do enredo, distribuição, arte e como prender a atenção do jogador. Lógica, matemática e física são apresentados sem traumas. Também conheceremos muitos dos benefícios do framework Cocos2D, utilizado na versão definitiva do nosso game.\n\nVeja o jogo desenvolvido no livro:\nveja o sumário completo","category":"Programação","subcategory":"Games"},{"url":"https://www.casadocodigo.com.br/products/vale-presente","nome":"Vale presente Casa do Código","img":"/covers/vale-presente-CDC_large.png?v=1451330431","nomeExibicao":"Vale Presente","title":"Vale presente Casa do Código","sub":"","author":"Casa do Código","content":"É sempre difícil escolher algo para seu amigo que trabalha com tecnologia. A Casa do Código possui um acervo de livros e e-books que vai agradar a todos. Não perca mais seu tempo escolhendo o presente de aniversário e de natal de seu colega.\nO presenteado pode também optar pelo livro impresso, o valor do vale presente só não abate o frete.\nAssim que você realizar a compra do vale presente, basta acessar http://valepresente.casadocodigo.com.br e preencher os dados para presentear seu amigo!","category":"Programação","subcategory":"Games"},{"url":"https://www.casadocodigo.com.br/products/livro-selenium-webdriver","nome":"Selenium WebDriver: Descomplicando testes automatizados com Java","img":"/covers/p_large.jpg?v=1531506182","nomeExibicao":"Selenium WebDriver","title":"Selenium WebDriver","sub":"Descomplicando testes automatizados com Java","author":"Rafael Peixoto","content":"Testes de verificação e validação são considerados um elemento crítico para garantia da qualidade de software. O planejamento, execução e controle de teste são dispendiosos e trabalhosos no processo de desenvolvimento. Em vista disso, as atuais ferramentas de testes oferecem uma variedade de recursos que podem reduzir significativamente os problemas identificados, de modo a garantir a qualidade de software, aumentar a produtividade e diminuir os custos. Dentre elas, o Selenium WebDriver é uma excelente escolha para iniciarmos a automação dos nossos testes, pois é uma ferramenta livre, gratuita e permite o uso em diferentes linguagens de programação e browsers.\nNeste livro, Rafael apresenta de forma introdutória e objetiva como escrever testes automatizados para Web utilizando Selenium WebDriver e JUnit em Java. O autor demonstra passo a passo e com exemplos práticos como rodar testes automatizados em navegadores tanto convencionais, como sem interface gráfica. Você conhecerá os principais problemas e dificuldades de um projeto de automação e verá padrões de projeto, como Page Objects, que o ajudarão a escrever códigos mais limpos e de fácil manutenção. Ao final, você será capaz de configurar um ambiente e criar scripts de testes automatizados, bem como terá uma boa base para seguir para ferramentas e técnicas mais avançadas.","category":"Programação","subcategory":"Java"},{"url":"https://www.casadocodigo.com.br/products/livro-refatoracao-java","nome":"Refatorando com padrões de projeto: Um guia em Java","img":"/covers/Amazon-Refatoracao-Java_large.jpg?v=1509072714","nomeExibicao":"Refatoração Java","title":"Refatorando com padrões de projeto","sub":"Um guia em Java","author":"Marcos Brizeno","content":"Qualidade de código e refatoração são reconhecidamente assuntos que permanecem relevantes e pertinentes tanto para novos profissionais como para quem já sabe do que se trata: melhorar o design existente, aplicar mudanças em pequenos passos e evitar deixar o sistema quebrado. Ao aplicar refatorações, existem várias técnicas que podem ajudar a alcançar a melhoria desejada, de modo que o processo seja feito de maneira responsável e garantindo o funcionamento da aplicação por meio de testes unitários.\nNeste livro, Marcos Brizeno mostra como padrões de projeto podem servir como guias para a refatoração projetos Java, para que você saiba decidir quando ou não determinado padrão pode ser aplicado para alcançar o código ideal. Por meio de exemplos práticos, você terá um melhor entendimento sobre design orientado a objetos, permitindo identificar mais facilmente os problemas e implementar soluções flexíveis e fáceis de evoluir.","category":"Programação","subcategory":"Java"},{"url":"https://www.casadocodigo.com.br/products/livro-logica-jogo","nome":"A lógica do jogo: Recriando clássicos da história dos videogames","img":"/covers/5LRsiQ-WvbmgPiUbF3xe1Is6RcorSCk5tuYbR0A__3Q_size_mode_3_size_800x600_large.jpeg?v=1452288754","nomeExibicao":"Lógica do jogo","title":"A lógica do jogo","sub":"Recriando clássicos da história dos videogames","author":"Marcus Becker","content":"Se você já foi cativado por jogos clássicos como Pac man, Snake e Tetris, e surgiu a curiosidade sobre os bastidores destes e de demais games, este livro é sua porta de entrada para aprender como eles funcionam. Você não vai apenas recriar alguns grandes jogos do mundo do entretenimento eletrônico, mas sim entender, de forma prática, a lógica envolvida em cada um deles, cujas mecânicas são utilizadas até hoje em muitos jogos modernos.\n\nNeste livro, Marcus Becker ensina a desenvolver seis jogos clássicos, abordando aspectos gerais do desenvolvimento de jogos de forma gradual, desde a movimentação do personagem até o uso de sons e imagens. Quando terminar o último capítulo, você poderá desenvolver qualquer um dos jogos apresentados de forma completa, com início, meio e fim.","category":"Programação","subcategory":"Java"},{"url":"https://www.casadocodigo.com.br/products/livro-javaee","nome":"Java EE: Aproveite toda a plataforma para construir aplicações","img":"/covers/G8Odq4Q1TChRM5NMkpWOfJLrIdpMhXpIMt0Qs0vOAJQ_size_mode_2_size_1024x768_large.jpeg?v=1447444684","nomeExibicao":"Java EE","title":"Java EE","sub":"Aproveite toda a plataforma para construir aplicações","author":"Alberto Souza","content":"A especificação Java EE e suas respectivas implementações vêm evoluindo ao longo do tempo. A configuração e utilização das especificações ficaram bem mais fáceis. O que ainda não é tão fácil de enxergar é como podemos colocá-las para trabalhar em conjunto. Quais eu devo usar no meu próximo projeto? O que realmente eu posso fazer com cada uma delas? Como fazer com que uma converse com a outra?\n\nNeste livro, Alberto Souza, reconstrói boa parte do site da Casa do Código utilizando apenas as especificações da versão 7 do Java EE. Cada uma delas será apresentada em um cenário específico, sincronizada com a funcionalidade que vai ser implementada. Além disso, será utilizado como servidor de aplicação o WildFly que, com certeza, é o servidor que mais evolui no mundo Java.","category":"Programação","subcategory":"Java"},{"url":"https://www.casadocodigo.com.br/products/livro-certificacao-java-associate","nome":"Java SE 8 Programmer I: O guia para sua certificação Oracle Certified Associate","img":"/covers/certificacao-java-featured_large.png?v=1431470873","nomeExibicao":"Certificação Java","title":"Java SE 8 Programmer I","sub":"O guia para sua certificação Oracle Certified Associate","author":"Guilherme Silveira, Mário Amaral","content":"As certificações Java são, pelo bem ou pelo mal, muito reconhecidas no mercado. Em sua última versão, a principal foi quebrada em duas provas. Este livro o guiará por questões e assuntos abordados para a primeira prova, a Java SE 8 Programmer I (1Z0-808), de maneira profunda e desafiadora.\n\nEle percorrerá cada tema com detalhes e exercícios, para você chegar na prova confiante. Decorar regras seria uma maneira de estudar, porém não uma estimulante. Por que não compila? Por que não executa como esperado? Mais do que um guia para que você tenha sucesso na prova, nossa intenção é mostrar como a linguagem funciona por dentro.\n\nAo terminar essa longa caminhada, você será capaz de entender melhor a linguagem, assim como poder dizer com exatidão os motivos de determinadas construções e idiomismos.","category":"Programação","subcategory":"Java"},{"url":"https://www.casadocodigo.com.br/products/livro-spring-mvc","nome":"Spring MVC: Domine o principal framework web Java","img":"/covers/spring-mvc-featured_large.png?v=1430247080","nomeExibicao":"Spring MVC Framework","title":"Spring MVC","sub":"Domine o principal framework web Java","author":"Alberto Souza","content":"O Spring é o principal concorrente da especificação JavaEE. Com uma plataforma muito estável e com integração fina entre todas as suas extensões, fornece um ambiente muito propício para que o programador foque nas regras de negócio e esqueça dos problemas de infraestrutura. \nDurante o livro, será construída uma aplicação baseada na loja da Casa do Código e você terá a chance de utilizar diversas das funcionalidades e integrações providas pelo framework. Usaremos o Spring MVC como alicerce da nossa aplicação web e para implementar todas as funcionalidades, utilizaremos diversas integrações, como: Spring JPA, para facilitar o acesso ao banco de dados; Spring Security, para segurança da aplicação; diferenciação de ambientes com a parte de Profiles; respostas assíncronas para melhorarmos a escalabilidade; e ainda detalhes, como cache e suporte às requisições, seguindo o estilo REST. \nTudo isso sem uma linha de XML, todas configurações serão feitas baseadas em anotações e código Java.\n* Spring core, Spring MVC e Spring Security na versão 4","category":"Programação","subcategory":"Java"},{"url":"https://www.casadocodigo.com.br/products/livro-testes-de-software","nome":"Testes automatizados de software: Um guia prático","img":"/covers/testes-de-software-featured_large.png?v=1429091541","nomeExibicao":"Testes de Software","title":"Testes automatizados de software","sub":"Um guia prático","author":"Mauricio Aniche","content":"Quantas vezes você não colocou um \"else\" a mais ou trocou um maior por maior-igual? Problemas como esses acontecem todos os dias em nossos códigos. E aposto que você sabe como evitá-los: testando seu software. A grande pergunta é: por que evitamos (ou pior, odiamos) testar?\n\nTestar custa caro, é demorado e é chato. Mas tudo isso só é verdade, pois ainda delegamos essas tarefas para um ser humano. Este livro mostra de maneira prática como escrever um programa que fará esse teste por você!\n\nMergulhe de cabeça nessa ideia, aprenda a escrever testes automatizados, e passe a dormir bem, tranquilo, pois seu software agora funciona.\nveja o sumário completo","category":"Programação","subcategory":"Java"},{"url":"https://www.casadocodigo.com.br/products/livro-oo-solid","nome":"Orientação a Objetos e SOLID para Ninjas: Projetando classes flexíveis","img":"/covers/oo-solid-sumario-featured_large.png?v=1430310678","nomeExibicao":"OO SOLID para Ninjas","title":"Orientação a Objetos e SOLID para Ninjas","sub":"Projetando classes flexíveis","author":"Mauricio Aniche","content":"Todo profissional que trabalha com desenvolvimento deve conhecer os conceitos básicos de Orientação a Objetos. Esse paradigma, além de fundamental, é utilizado em todo o mercado de software ao redor do mundo. Mas nós sabemos que, na prática, o que vemos espalhado por aí são pilhas de códigos procedurais disfarçados. Neste livro, Maurício Aniche discute como a implementação e o foco no projeto de classes é importante para criar um software de qualidade. Sempre mantendo a característica de escrever um livro com uma didática voltada para o mundo real, você vai entender como moldar e dominar as peças da Orientação a Objetos usando os princípios de SOLID e escrevendo um código mais elegante e fácil de manter. Saia do básico e vire um ninja da Orientação a Objetos aprendendo de forma prática e eficaz as boas práticas do assunto.Os exemplos ao longo do livro estão escritos em Java, porém são facilmente compreendidas por qualquer programador. As discussões fazem sentido para todas as linguagens OO.","category":"Programação","subcategory":"Java"},{"url":"https://www.casadocodigo.com.br/products/livro-apis-java","nome":"Explorando APIs e bibliotecas Java: JDBC, IO, Threads, JavaFX e mais","img":"/covers/cover-apis-java_large.jpeg?v=1423244220","nomeExibicao":"APIs e Bibliotecas Java","title":"Explorando APIs e bibliotecas Java","sub":"JDBC, IO, Threads, JavaFX e mais","author":"Rodrigo Turini","content":"Uma vez que você aprende Orientação a Objetos e o básico do Java, é necessário se tornar fluente em suas APIs, que não são poucas. Um programador Java eficaz conhece o que há disponível e sabe quando pode usar cada uma das possibilidades que a linguagem lhe oferece. É isso que queremos para você.\n\nRodrigo Turini ensina como lidar com as diferentes APIs do Java com exemplos práticos e que são relevantes no seu dia a dia. Você vai aprender as diferentes APIs para fazer IO, trabalhar com threads da forma correta, se conectar com banco de dados via JDBC, integrar com ferramentas de build e muito mais.","category":"Programação","subcategory":"Java"},{"url":"https://www.casadocodigo.com.br/products/livro-mundoj-seguranca-java","nome":"MundoJ: Segurança com Java","img":"/covers/mundoj-seguranca-java-featured_large.png?v=1417782470","nomeExibicao":"MundoJ Segurança Java","title":"MundoJ","sub":"Segurança com Java","author":"MundoJ","content":"Nessa coletânea de artigos da MundoJ, você vai aprender a criar aplicativos seguros, através de 3 artigos sobre diferentes assuntos: Captchas, ataques em aplicações web e certificados digitais.\n\nTodos esses artigos envolvem códigos e exemplos práticos.\n\nVeja o sumário completo do livro","category":"Programação","subcategory":"Java"},{"url":"https://www.casadocodigo.com.br/products/livro-orientacao-objetos-java","nome":"Desbravando Java e Orientação a Objetos: Um guia para o iniciante da linguagem","img":"/covers/orientacao-objetos-java-featured_large.png?v=1416402140","nomeExibicao":"Java e OO","title":"Desbravando Java e Orientação a Objetos","sub":"Um guia para o iniciante da linguagem","author":"Rodrigo Turini","content":"Aprenda Orientação a Objetos com Java de forma simples e efetiva! Você compilará e executará seu próprio programa em algumas horas. Por que Java? Essa é uma das linguagens de programação mais utilizadas em todo o mundo, com 20 anos e atualmente mais de 9 milhões de desenvolvedores.\n\nO livro explora importantes conceitos da orientação a objetos como encapsulamento, herança e polimorfismo. Sempre com exemplos mão na massa, pensados para que você saiba exatamente quando e como utilizá-los.\n\nAlém disso, serão ensinadas boas práticas de programação e recursos essenciais que com certeza farão parte de sua rotina, dos mais tradicionais aos mais novos introduzidos no Java 8. É sua vez de desbravar o mundo Java!","category":"Programação","subcategory":"Java"},{"url":"https://www.casadocodigo.com.br/products/livro-java8","nome":"Java 8 Prático: Lambdas, Streams e os novos recursos da linguagem","img":"/covers/java8-featured_large.png?v=1411490181","nomeExibicao":"Java 8 Prático","title":"Java 8 Prático","sub":"Lambdas, Streams e os novos recursos da linguagem","author":"Paulo Silveira, Rodrigo Turini","content":"Você é um programador com boa fluência em Java? Está na hora de dar mais um passo.\n\nQuase 20 anos após sua primeira versão, um novo Java surge com novidades importantes. Entre os principais recursos, a linguagem recebe default methods, method references e lambdas. São conceitos simples, mas que trazem importantes possibilidades. Durante o livro, exploraremos esses e outros avanços. Sempre com exemplos práticos e apresentando onde utilizá-los, migrando o código legado do dia a dia para o novo paradigma funcional do Java 8.\n\nCom esse tripé de conceitos, a API conseguiu evoluir de uma maneira interessante. Os pacotes java.util.stream e java.util.function serão explorados com profundidade, apresentando formas sucintas para trabalhar com coleções e outros tipos de dados. Streams e Collectors farão parte da sua rotina e serão tão essenciais nas suas aplicações quanto já são as Collections e o java.io.\n\nPor último, veremos como a nova API de java.time vem mudar da água pro vinho a forma de trabalhar com datas e horários.\n\n \n\nAinda curioso para entender melhor as possibilidades? Se queremos ordenar todos os usuários de uma List por pontos, e filtrar apenas os que possuem mais de 100, faríamos assim no Java 7:    \n      \n        \n  \n    \n\n  \n      \n      \n        \n        List<Usuario> usuariosFiltrados = new ArrayList<>();\n      \n      \n        \n        for(Usuario usuario : usuarios) {\n      \n      \n        \n        if(usuario.getPontos() > 100) {\n      \n      \n        \n        usuariosFiltrados.add(usuario);\n      \n      \n        \n        }\n      \n      \n        \n        }\n      \n      \n        \n          \n      \n      \n        \n        Collections.sort(usuariosFiltrados, new Comparator<Usuario>() {\n      \n      \n        \n        public int compare(Usuario u1, Usuario u2) {\n      \n      \n        \n        return u1.getNome().compareTo(u2.getNome());\n      \n      \n        \n        }\n      \n      \n        \n        });\n      \n  \n\n        \n      \n        view raw\n        Antigo.java\n        hosted with ❤ by GitHub\n      \n    \n \n\nÉ o problema vertical do Java! Muito código de boilerplate para uma transformação simples. Como fica no Java 8?\n\n     \n      \n        \n  \n    \n\n  \n      \n      \n        \n        List<Usuario> filtradosOrdenados = usuarios.stream()\n      \n      \n        \n        .filter(u -> u.getPontos() > 100)\n      \n      \n        \n        .sorted(Comparator.comparing(Usuario::getNome))\n      \n      \n        \n        .collect(Collectors.toList());\n      \n  \n\n        \n      \n        view raw\n        Novo.java\n        hosted with ❤ by GitHub\n      \n    \nO livro vai muito mais longe na manipulação de coleções e datas. Conheça e comece a utilizar as novidades em seu projeto.","category":"Programação","subcategory":"Java"},{"url":"https://www.casadocodigo.com.br/products/livro-oauth","nome":"OAuth 2.0: Proteja suas aplicações com o Spring Security OAuth2","img":"/covers/eBook-OAuth-2.0_large.jpg?v=1506712443","nomeExibicao":"OAuth 2.0","title":"OAuth 2.0","sub":"Proteja suas aplicações com o Spring Security OAuth2","author":"Adolfo Eloy","content":"Quando se trata de proteger os recursos de uma aplicação, é comum utilizar OAuth. Ainda assim, percebe-se que ainda existe bastante confusão a respeito dele, havendo até cenários de brechas em sistemas grandes devido ao mau uso da tecnologia. OAuth 2.0 é um protocolo ou um framework? Será que deve ser usado para autenticação ou autorização?\nNeste livro, Adolfo Eloy vem desmistificar essas perguntas, em uma mescla de teoria e prática, alertando para a importância do uso seguro da tecnologia. Por meio de uma aplicação de exemplo, você aprenderá os principais componentes presentes no fluxo do OAuth 2.0, como Resource Owner, Client, Resource Server e Authorization Server, acompanhando diferentes cenários de utilização do protocolo, nos pontos cruciais de segurança da sua aplicação.","category":"Programação","subcategory":"Java"},{"url":"https://www.casadocodigo.com.br/products/livro-play-framework-java","nome":"Play Framework: Java para web sem Servlets e com diversão","img":"/covers/play-framework-java-featured_large.png?v=1411566121","nomeExibicao":"Play Java","title":"Play Framework","sub":"Java para web sem Servlets e com diversão","author":"Fernando Boaglio","content":"Desenvolver sistemas web em Java nunca foi tão divertido! Se você está cansado de escrever longas Servlets, de ficar brigando com seu framework o tempo inteiro para realizar tarefas simples e de escrever mais código que o necessário para desenvolver qualquer funcionalidade, o Play Framework é o que você precisa.\n\nNesse livro, Fernando Boaglio ensina como criar uma aplicação do começo ao fim utilizando o Play Framework na versão Java, passando por situações comuns do dia a dia, indo desde o tradicional cadastro, até funcionalidades mais avançadas como habilitação de HTTPS, login integrado com redes sociais e integração com serviços REST. Você vai aprender como o Play Framework pode o tornar extremamente produtivo.","category":"Programação","subcategory":"Java"},{"url":"https://www.casadocodigo.com.br/products/livro-reflexao-anotacoes","nome":"Componentes Reutilizáveis em Java com Reflexão e Anotações","img":"/covers/reflexao-anotacoes-featured_large.png?v=1416318033","nomeExibicao":"Reflection e Annotations","title":"Componentes Reutilizáveis em Java com Reflexão e Anotações","sub":"","author":"Eduardo Guerra","content":"Muitos dos recursos providos pelos frameworks e componentes mais utilizados na indústria extrapolam os simples conceitos da Orientação a Objetos e fazem uso de reflexão e anotações. A utilização dessas poderosas ferramentas pode fazer uma grande diferença, com potencial de aumentar a produtividade do time e melhorar a estrutura do código.\n\nNeste livro, o uso de reflexão e anotações é abordado por completo, indo desde o funcionamento da API até boas práticas em sua utilização. Além disso, o livro também fala sobre ferramentas de código aberto, manipulação de bytecode e as novidades sobre reflexão do Java 8. Suba de nível em suas habilidades de programação aprendendo essa técnica que vai lhe permitir escrever códigos extremamente flexíveis.","category":"Programação","subcategory":"Java"},{"url":"https://www.casadocodigo.com.br/products/colecao-frameworks-java","nome":"Coleção Frameworks Java","img":"/covers/colecao-frameworks-java-featured_large.png?v=1416401867","nomeExibicao":"Coleção Frameworks Java","title":"Coleção Frameworks Java","sub":"","author":"Lucas Cavalcanti, Henrique Lobo Weissmann, Gilliard Cordeiro","content":"Aprenda de uma vez os 4 principais frameworks Java com 15% de desconto: JSF, JPA, Spring e VRaptor.\n\nO ecossistema Java é repleto de frameworks que ajudam o desenvolvedor nas tarefas do dia a dia. Agora você pode aprender os 4 principais, rapidamente. Comece a usar a JPA para persistir seus dados, o JSF para criar sistemas web stateful, o Spring para simplificar o desenvolvimento e cuidar do ciclo de vida dos objetos, além do VRaptor, poderoso framework MVC desenvolvido por brasileiros.\n\nAproveite o desconto de 15% nessa coleção de 3 e-books incríveis e domine os principais frameworks da plataforma Java!Veja o sumário completo dos livros: JSF e JPA, Spring e VRaptor.","category":"Programação","subcategory":"Java"},{"url":"https://www.casadocodigo.com.br/products/livro-jpa-eficaz","nome":"JPA Eficaz: As melhores práticas de persistência de dados em Java","img":"/covers/jpa-eficaz-featured_large.png?v=1411490333","nomeExibicao":"JPA Eficaz","title":"JPA Eficaz","sub":"As melhores práticas de persistência de dados em Java","author":"Hébert Coelho","content":"Entender o básico da JPA pode ser simples e rápido, mas com o uso do dia a dia, ela se torna uma ferramenta que demanda muito cuidado. É preciso conhecer bem seus detalhes para não cair em armadilhas.\n\nNesse livro, Hebert Coelho explica em tópicos curtos, e direto ao ponto, técnicas para usar a JPA da melhor forma possível, com atenção aos equívocos mais comuns. Você vai aprender a evitar o problema de N+1 consultas, usar corretamente o controle transacional, fazer consultas que envolvam relacionamentos, controlar quando usar EAGER ou LAZY nos relacionamentos, evitar a famigerada LazyInitializationException e muito mais.","category":"Programação","subcategory":"Java"},{"url":"https://www.casadocodigo.com.br/products/livro-cdi","nome":"CDI: Integre as dependências e contextos do seu código Java","img":"/covers/cdi-featured_large.png?v=1416318025","nomeExibicao":"CDI","title":"CDI","sub":"Integre as dependências e contextos do seu código Java","author":"Gilliard Cordeiro","content":"Uma das especificações mais atuais do Java, a especificação CDI (Context and Dependency Injection) traz um enorme poder no código que o desenvolvedor escreve, possibilitando para a aplicação recursos de injeção de dependência e ciclo de vida com escopos e contextos, de forma padronizada para o mundo Java e Java EE.\n\nNeste livro, Gilliard Cordeiro mostra como tirar vantagem dessa poderosíssima especificação, através do uso da sua implementação de referência, o Weld, ensinando você a criar seus componentes; injetá-los em qualquer classe; integrar o CDI com outras especificações do Java EE, como a JPA e o JSF; além de desvendar os recursos avançados da especificação, aprendendo a criar interceptors, decorators e todos os recursos da CDI. Você ainda aprende a desacoplar seu código e ter um design mais elegante para suas classes.","category":"Programação","subcategory":"Java"},{"url":"https://www.casadocodigo.com.br/products/colecao-codigo-java-de-qualidade","nome":"Coleção Código Java de Qualidade","img":"/covers/colecao-webdesign-featured_large.png?v=1416401770","nomeExibicao":"Coleção Código Java","title":"Coleção Código Java de Qualidade","sub":"","author":"Mauricio Aniche, Eduardo Guerra","content":"Tudo o que você precisa saber para escrever os melhores códigos Java em 2 livros com 15% de desconto. Aprenda TDD e Design Patterns e comece a criar aplicações que serão de fácil manutenção.\n\nJá pensou em quantos minutos do seu dia você gasta dando manutenção em funcionalidades já existentes do seu projeto? Provavelmente não são poucos. Aprenda agora a criar a aplicação que vai dar gosto de manter no futuro. Saiba como escrever código de qualidade, aplique as soluções dos padrões de projetos e aprenda a manter a sua aplicação testada!\n\nAproveite o desconto de 15% nesses 2 e-books e melhore a qualidade do código dos seus projetos.Veja o sumário completo dos livros: TDD e Design Patterns","category":"Programação","subcategory":"Java"},{"url":"https://www.casadocodigo.com.br/products/livro-vraptor","nome":"VRaptor: Desenvolvimento ágil para web com Java","img":"/covers/vraptor-featured_large.png?v=1411568040","nomeExibicao":"VRaptor 4","title":"VRaptor","sub":"Desenvolvimento ágil para web com Java","author":"Lucas Cavalcanti","content":"Aprenda o framework Java mais poderoso e produtivo que existe! Desenvolvido por brasileiros, o VRaptor é o framework web mais adotado no mercado nacional e traz diversas facilidades para os desenvolvedores. Agora com a versão 4 do framework, crie sistemas web de forma descomplicada, mantendo seu código organizado e usando as melhores práticas de programação existente, tudo isso usando a em cima da especificação CDI.\n\nNeste livro, Lucas Cavalcanti ensina as convenções do framework e como usar a injeção de dependências. Domine os conceitos de serviços Restful e muito mais para criar as melhores aplicações web do mercado!","category":"Programação","subcategory":"Java"},{"url":"https://www.casadocodigo.com.br/products/livro-javafx","nome":"JavaFX: Interfaces com qualidade para aplicações desktop","img":"/covers/javafx-featured_large.png?v=1411490259","nomeExibicao":"JavaFX","title":"JavaFX","sub":"Interfaces com qualidade para aplicações desktop","author":"Bruno Oliveira","content":"Já conhece Java e quer fazer uma aplicação client side? JavaFX vem dar nova vida ao desenvolvimento desktop com Java.\n\nNeste livro, crie uma pequena aplicação com JavaFX 2.2, para conhecer o essencial dessa API. Aprenda a utilizar CSS em uma loja virtual esportiva, aplicando os conceitos na nossa aplicação. Conheça componentes mais poderosos, nunca antes possíveis com Swing puro. Utilize o Scene Builder para facilitar a construção do seu layout.","category":"Programação","subcategory":"Java"},{"url":"https://www.casadocodigo.com.br/products/livro-jsf-eficaz","nome":"JSF Eficaz: As melhores práticas para o desenvolvedor web Java","img":"/covers/jsf-eficaz-featured_large.png?v=1411490421","nomeExibicao":"JSF Eficaz","title":"JSF Eficaz","sub":"As melhores práticas para o desenvolvedor web Java","author":"Hébert Coelho","content":"O JSF é um dos frameworks mais incríveis que existem no ambiente Java, porém, para usá-lo bem e tirar o máximo proveito dele em seus projetos, é preciso estar atento em diversos detalhes, que, quando não são levados em consideração, podem significar o fracasso do projeto.\n\nEsse livro tem como objetivo mostrar esses detalhes que fazem a diferença e, dessa forma, possibilitar o uso do JSF de uma maneira segura e tranquila, facilitando o desenvolvimento, organização do código e mantendo uma aplicação saudável.\n\nVocê aprenderá técnicas e verá dicas que se aplicam às diferentes versões do JSF, indo desde o JSF 1.x até o 2.x.Baixe o projeto do livro em: https://github.com/uaihebert/jsf_eficaz","category":"Programação","subcategory":"Java"},{"url":"https://www.casadocodigo.com.br/products/livro-arquitetura-java","nome":"Introdução à Arquitetura e Design de Software: Uma visão sobre a plataforma Java","img":"/covers/arquitetura-java-featured_large.png?v=1411489903","nomeExibicao":"Arquitetura Java","title":"Introdução à Arquitetura e Design de Software","sub":"Uma visão sobre a plataforma Java","author":"Paulo Silveira, Guilherme Silveira, Sérgio Lopes, Guilherme Moreira, Nico Steppat, Fabio Kung","content":"Neste livro, os autores, conhecidos especialistas da área, apresentam muitos tópicos que aparecem com frequência na plataforma Java, incluindo desde modelagem e design das classes, até detalhes importantes das tecnologias mais utilizadas.\n\nSempre com uma visão técnica e prática capaz de elucidar muitas questões enfrentadas tanto pelo profissional iniciante quanto por aquele que está adquirindo mais experiência na plataforma.\n\nOs e-books da Casa do Código não possuem DRM. Compre agora e baixe o PDF, epub e mobi e leia no dispositivo que quiser.","category":"Programação","subcategory":"Java"},{"url":"https://www.casadocodigo.com.br/products/livro-java9","nome":"Java 9: Interativo, reativo e modularizado","img":"/covers/Amazon-Java-9_large.png?v=1506020938","nomeExibicao":"Java 9","title":"Java 9","sub":"Interativo, reativo e modularizado","author":"Rodrigo Turini","content":"Com mais de 20 anos de plataforma, um novo Java surge com novidades importantes. O destaque especial vai para o sistema de módulos, o Jigsaw, e a modularização do próprio JDK. A linguagem também ficou interativa, com a adição de uma ferramenta de REPL (Read-Eval-Print Loop), e mais reativa, com uma API de fluxos inteiramente dedicada aos famosos Reactive Streams.\nAs APIs de HTTP/2 Client, Logging e Stack-Walking são outros exemplos de novidades que serão explorados. Além disso, você verá surpresas como métodos privados em interfaces, arquivos de properties com suporte a UTF-8 e os vários novos métodos default nas APIs de Collection, Stream e outros.\nNeste livro, Rodrigo Turini mostrará as principais novidades do Java 9 com a criação de um projeto prático, no qual você acompanhará com as mãos na massa as mudanças da plataforma e como migrar os seus códigos para tirar proveito dos novos recursos.","category":"Programação","subcategory":"Java"},{"url":"https://www.casadocodigo.com.br/products/livro-design-patterns","nome":"Design Patterns com Java: Projeto orientado a objetos guiado por padrões","img":"/covers/design-patterns-featured_large.png?v=1411489099","nomeExibicao":"Design Patterns","title":"Design Patterns com Java","sub":"Projeto orientado a objetos guiado por padrões","author":"Eduardo Guerra","content":"Não é trivial compreender bem os design patterns. Entender quando aplicá-los é algo que qualquer desenvolvedor deve saber. Nesse livro, você aprenderá com exemplos práticos e bem contextualizados como aplicar os padrões e em quais situações um é mais indicado que o outro. Diferencie as características particulares de cada padrão, crie aplicações que usam o melhor da orientação a objetos em seu favor e desenvolva aplicações que você conseguirá manter para sempre!","category":"Programação","subcategory":"Java"},{"url":"https://www.casadocodigo.com.br/products/livro-soa-webservices","nome":"SOA aplicado: Integrando com web services e além","img":"/covers/soa-webservices-featured_large.png?v=1411567532","nomeExibicao":"SOA, web services e além","title":"SOA aplicado","sub":"Integrando com web services e além","author":"Alexandre Saudate","content":"Cada vez mais, sistemas corporativos exigem o reaproveitamento de funcionalidades, e consequentemente a integração entre diferentes sistemas se torna uma realidade. Essa é uma tendência natural das arquiteturas modernas.\n\nA arquitetura orientada a serviços (Service Oriented Architecture - SOA) existe justamente para resolver essa situação.\n\nAprenda como integrar sistemas com web services, mensageria assíncrona, orquestração e muito mais de uma maneira prática e focada, sendo que desde o primeiro capítulo, você já constrói e se integra a um serviço.","category":"Programação","subcategory":"Java"},{"url":"https://www.casadocodigo.com.br/products/livro-tdd","nome":"Test-Driven Development: Teste e Design no Mundo Real","img":"/covers/tdd-featured_large.png?v=1411567779","nomeExibicao":"TDD com Java","title":"Test-Driven Development","sub":"Teste e Design no Mundo Real","author":"Mauricio Aniche","content":"Por que não testamos software? Porque é caro? Porque é demorado? Porque é chato? Testes automatizados são a solução para todos esses problemas. Aprenda a escrever um programa que teste seu programa de forma rápida, barata e produtiva, e aumente a qualidade do seu produto final.\n\nNeste livro, você aprenderá sobre TDD, uma das práticas ágeis de desenvolvimento de software mais populares, através da linguagem Java, mas poderá aplicar o conceito aprendido em qualquer outra linguagem. TDD faz o desenvolvedor escrever o teste antes mesmo de implementar o código. Essa simples inversão na maneira de se trabalhar faz com o que o desenvolvedor escreva um código mais testado, com menos bugs, e, inclusive, com mais qualidade. Seja profissional, teste seu software!\n\nTodos os exemplos desse livro foram escritos em Java.","category":"Programação","subcategory":"Java"},{"url":"https://www.casadocodigo.com.br/products/livro-jsf-jpa","nome":"Aplicações Java para a web com JSF e JPA","img":"/covers/jsf-jpa-featured_large.png?v=1411486340","nomeExibicao":"JSF e JPA","title":"Aplicações Java para a web com JSF e JPA","sub":"","author":"Gilliard Cordeiro","content":"Neste livro, você encontrará as especificações mais utilizadas do Java, explicadas com exemplos práticos e claros que mostram como usar cada tecnologia em separado e como utilizá-las em conjunto.\n\nConheças as melhores práticas da JPA 2.0, seus mapeamentos, caches e truques de performance, e tire o máximo do JSF 2.2 compreendendo seu ciclo de vida e as novidades que surgiram nas atuais versões das especificações.","category":"Programação","subcategory":"Java"},{"url":"https://www.casadocodigo.com.br/products/livro-spring-framework","nome":"Vire o jogo com Spring Framework","img":"/covers/spring-framework-featured_large.png?v=1411567960","nomeExibicao":"Spring Framework","title":"Vire o jogo com Spring Framework","sub":"","author":"Henrique Lobo Weissmann","content":"Criado para simplificar o desenvolvimento de aplicações Java, o Spring se tornou um dos frameworks de mais destaque dentro desse grande ambiente.\n\nAprenda muito mais que o básico do Spring, desde o tradicional Container de Inversão de Controle e Injeção de Dependências, passando pelos robustos módulos de segurança, transações, programação orientada a aspectos e também o fantástico módulo MVC, o SpringMVC.","category":"Programação","subcategory":"Java"},{"url":"https://www.casadocodigo.com.br/products/vale-presente","nome":"Vale presente Casa do Código","img":"/covers/vale-presente-CDC_large.png?v=1451330431","nomeExibicao":"Vale Presente","title":"Vale presente Casa do Código","sub":"","author":"Casa do Código","content":"É sempre difícil escolher algo para seu amigo que trabalha com tecnologia. A Casa do Código possui um acervo de livros e e-books que vai agradar a todos. Não perca mais seu tempo escolhendo o presente de aniversário e de natal de seu colega.\nO presenteado pode também optar pelo livro impresso, o valor do vale presente só não abate o frete.\nAssim que você realizar a compra do vale presente, basta acessar http://valepresente.casadocodigo.com.br e preencher os dados para presentear seu amigo!","category":"Programação","subcategory":"Java"},{"url":"https://www.casadocodigo.com.br/products/livro-spring-boot","nome":"Spring Boot: Acelere o desenvolvimento de microsserviços","img":"/covers/7aXPAWM4TObeQ4OOv3mUY-mrVzqf23Ty6enIslrhXvM_large.jpg?v=1501874081","nomeExibicao":"Spring Boot","title":"Spring Boot","sub":"Acelere o desenvolvimento de microsserviços","author":"Fernando Boaglio","content":"Spring Boot é uma maneira eficiente e eficaz de criar uma aplicação em Spring e facilmente colocá-la no ar, funcionando sem depender de um servidor de aplicação. Não se trata de um simples framework, mas de um conceito totalmente novo de criar aplicações web. Além de impulsionar o desenvolvimento para microsserviços, o Spring Boot ajuda na configuração importando e configurando automaticamente todas as dependências.\n\nNeste livro, Fernando Boaglio apresenta os principais componentes dessa arquitetura revolucionária. Você poderá tirar o máximo proveito dela vendo os exemplos de acesso a banco de dados, exibição de páginas web usando templates, serviços REST sendo consumidos por front-end em JQuery e AngularJS, testes unitários e de integração, deploy na nuvem e alta disponibilidade com Spring Cloud.","category":"Programação","subcategory":"Java"},{"url":"https://www.casadocodigo.com.br/products/livro-dsl","nome":"DSL: Quebre a barreira entre desenvolvimento e negócios","img":"/covers/ed1YIZAA4ox3jKxh2EeUSYMiJu7W4tM0paCt2R7sDoo_large.jpg?v=1497039745","nomeExibicao":"DSL","title":"DSL","sub":"Quebre a barreira entre desenvolvimento e negócios","author":"Leonardo Otto","content":"Existe um ponto de vista que diz que a profissão de programação é uma profissão de tradução. Estamos sempre traduzindo o que os especialistas estão dizendo para uma língua que os computadores entendam. Ou seja, capturamos as ideias de especialistas, as completamos (pois normalmente eles eliminam detalhes) e traduzimos para outra linguagem. Manter o código o mais próximo dos conceitos dos especialistas é um passo importante, mas este passo pode ser expandido ainda mais com o uso de DSLs - Linguagens Específicas de Domínio.\nNeste livro, Leonardo Otto vai lhe ensinar como utilizar e criar DSLs internas para obter um código mais expressivo. Você expandirá sua capacidade de criar softwares mais simples, mais comunicativos e com melhor manutenção, a partir do principal valor das DSLs: resolver apenas um problema de domínio da forma mais clara possível, trazendo uma interface mais humana para os usuários finais.","category":"Programação","subcategory":"Java"},{"url":"https://www.casadocodigo.com.br/products/livro-seguranca","nome":"Segurança em aplicações Web","img":"/covers/zhQRY_vRi2-piaw5QkZpc552fcVQhN6fe4zLRb4fXV8_large.jpg?v=1486751361","nomeExibicao":"Segurança","title":"Segurança em aplicações Web","sub":"","author":"Rodrigo Ferreira","content":"Construir uma aplicação Web segura é uma tarefa bem difícil hoje em dia, já que existem diversos tipos de ataques que podem ser realizados contra ela, sendo que outras novas vulnerabilidades vão surgindo com o passar do tempo. Algumas delas estão presentes na infraestrutura da aplicação, sendo bem comum encontrarmos nosso ambiente de produção com softwares desatualizados, como o Sistema Operacional, o SGBD e o Servidor de Aplicações. Mas uma grande parte dos ataques ocorre por conta de vulnerabilidades presentes na própria aplicação, sendo responsabilidade dos desenvolvedores e arquitetos conhecer tais fraquezas e como fazer para evitá-las.\nNeste livro, Rodrigo Ferreira ensina como tratar ataques relacionados a vulnerabilidades presentes na própria aplicação, explicando de maneira detalhada como eles funcionam, como verificar se sua aplicação está vulnerável a eles, e como fazer para corrigir tais inseguranças. Você aprenderá a lidar com ataques como: SQL Injection, Cross-Site Scripting (XSS), Cross-Site Request Forgery (CSRF), Session Hijacking, dentre outros.","category":"Programação","subcategory":"Java"},{"url":"https://www.casadocodigo.com.br/products/livro-algoritmos-java","nome":"Algoritmos em Java: Busca, ordenação e análise","img":"/covers/eBook-Algoritmos_large.jpg?v=1484936519","nomeExibicao":"Algoritmos em Java","title":"Algoritmos em Java","sub":"Busca, ordenação e análise","author":"Guilherme Silveira","content":"Em nosso dia a dia, realizamos uma série de buscas e ordenações que nos são tão naturais que nem percebemos como sua presença é ubíqua e facilita nossa vida. Quando pesquisamos produtos por preço em uma loja, ou queremos buscar uma pessoa em uma lista, ou mesmo quando organizamos as cartas de baralho para algum jogo, estamos usando algoritmos.\nNeste livro, Guilherme Silveira mostra que, na computação, não é diferente. Muitos dos problemas complexos de lógica com que desenvolvedores lidam todos os dias envolvem conceitos básicos de busca e ordenação, alguns dos quais priorizam economia de tempo ou de memória. Você verá como funcionam os algoritmos e como implementá-los, por meio do estudo de soluções que já usamos no cotidiano. Entendê-los a ponto de sermos capazes de recriá-los nos traz um conhecimento valioso para todo programador: o pensamento lógico e a quebra de problemas em partes menores que podem ser resolvidas com algoritmos.","category":"Programação","subcategory":"Java"},{"url":"https://www.casadocodigo.com.br/products/livro-oo-conceitos","nome":"Orientação a Objetos: Aprenda seus conceitos e suas aplicabilidades de forma efetiva","img":"/covers/eBook-Orientacao-a-Objetos-atualizado_large.jpg?v=1523648187","nomeExibicao":"Orientação a Objetos","title":"Orientação a Objetos","sub":"Aprenda seus conceitos e suas aplicabilidades de forma efetiva","author":"Thiago Leite e Carvalho","content":"Conforme a demanda por novos paradigmas que correspondessem às necessidades do dia a dia dos programadores, surgia a Orientação a Objetos, com a missão de cobrir as insuficiências do modelo estrutural. O Paradigma Orientado a Objeto tem como principal característica uma melhor e maior expressividade das nossas demandas e possibilita criar unidades de código mais próximas da forma como pensamos e agimos, facilitando o processo de transformação das necessidades diárias para uma linguagem orientada a objetos.\n\nNeste livro, Thiago Leite demonstrará todos os seus conceitos para você utilizá-la da forma mais eficiente. Por meio de exemplos, você será iniciado nas boas práticas do uso da Orientação a Objetos para alcançar uma alta qualidade nos seus programas e tornar o processo de desenvolvimento mais produtivo e de mais fácil manutenção.","category":"Programação","subcategory":"Java"},{"url":"https://www.casadocodigo.com.br/products/livro-ireport","nome":"iReport: Crie relatórios práticos e elegantes","img":"/covers/jlNlg52B6Zzu_qWAedayIhIayV1YvtMgFUJoqHmfjAo_size_mode_3_size_800x600_large.jpeg?v=1456777705","nomeExibicao":"iReport","title":"iReport","sub":"Crie relatórios práticos e elegantes","author":"Maurício Morais","content":"Criar o design do relatório diretamente em XML pode ser uma tarefa muito demorada e improdutiva. E se existisse uma ferramenta fácil de usar e intuitiva que automatizasse esse processo? O iReport é uma ferramenta gráfica veio preencher essa lacuna, facilitando a definição de relatórios com designs modernos e complexos, sem a necessidade de escrever uma linha de código em XML. E é todo gerado automaticamente: o ambiente disponibiliza atalhos para tarefas de compilação e visualização do relatório, proporcionando a realização de testes e, consequentemente, uma maior produtividade no processo de design.\n\nNeste livro, Maurício Morais apresenta, de forma didática e prática, como utilizar os recursos do iReport para implementar relatórios com Java. O livro tem por objetivo mostrar para estudantes, programadores e desenvolvedores quais são os conhecimentos necessários para implementação de relatórios utilizando iReport com extrema facilidade e produtividade.","category":"Programação","subcategory":"Java"},{"url":"https://www.casadocodigo.com.br/products/livro-construct2","nome":"Construct 2: Crie o seu primeiro jogo multiplataforma","img":"/covers/eBook-Construct-2_large.jpg?v=1516986781","nomeExibicao":"Construct 2","title":"Construct 2","sub":"Crie o seu primeiro jogo multiplataforma","author":"Diego Martins de Pinho, Bruna Escudelario","content":"O mercado de jogos no Brasil e o número de pessoas interessadas em ingressar nele não param de crescer. Porém, a maioria das plataformas para produção de jogos exige tanto background tecnológico que acaba desanimando qualquer um. Felizmente, o Construct 2 surgiu pensando no usuário que deseja desenvolver suas próprias ideias, sem a necessidade de possuir algum conhecimento técnico prévio.\nNeste livro, Diego e Bruna provam que qualquer um é capaz de construir seus próprios jogos e exportá-los nos mais diversos formatos. Você verá como funcionam todos os mecanismos para criar um jogo de plataforma completo, com todas as telas, sistema de inimigos e movimentação dos personagens, que funcionará tanto em navegadores como em celulares!","category":"Programação","subcategory":"Logica"},{"url":"https://www.casadocodigo.com.br/products/livro-app-inventor","nome":"App Inventor: Seus primeiros aplicativos Android","img":"/covers/CaMWGHXUhWVSWaH4aZazotOcKm3ckVDokQ0IQ5fM0KU_large.jpg?v=1512148345","nomeExibicao":"App Inventor","title":"App Inventor","sub":"Seus primeiros aplicativos Android","author":"Nelson Fabbri Gerbelli, Valéria Helena P. Gerbelli","content":"O App Inventor 2 é uma ferramenta inovadora, desenvolvida pelo Google e mantida hoje pelo Instituto de Tecnologia de Massachusetts (MIT). Com ela, é possível criar aplicativos para dispositivos móveis Android, por meio de uma linguagem visual, sem precisar decorar ou escrever códigos de linguagem de programação. Com um simples arrastar e inserir blocos para a área de programação, em uma interface intuitiva, é uma excelente ferramenta de aprendizado que permite que os recém-chegados à programação de computador criem aplicativos completos.\n\nNeste livro, Nelson e Valéria Gerbelli têm como objetivo proporcionar aos estudantes, educadores e entusiastas por tecnologia o primeiro passo no mundo da programação para dispositivos móveis por meio do App Inventor. Após ser apresentado ao ambiente, você aprenderá na prática a desenvolver alguns aplicativos do zero, partindo de alguns cálculos, até chegar a resultados mais complexos, com um recurso de localização de GPS, tradução de idioma e desenvolvendo um projeto final completo. Dentre as funcionalidades, estão o compartilhamento com outros aplicativos como o WhatsApp, a conexão a um banco de dados em MySQL, e a disponibilização do aplicativo na loja do Google Play Store.","category":"Programação","subcategory":"Logica"},{"url":"https://www.casadocodigo.com.br/products/livro-scratch","nome":"Scratch: Um jeito divertido de aprender programação","img":"/covers/YenvGixkQWFaq3oZpZr7dGXue8geB59fbwBHgS23orQ_large.jpg?v=1496341655","nomeExibicao":"Scratch","title":"Scratch","sub":"Um jeito divertido de aprender programação","author":"Helton Varela, Claudia Tinós Peviani","content":"O Scratch é um programa de computador de código aberto, no qual é possível escrever uma série de instruções que dirá ao computador o que deve ser feito. Com ele, podemos criar nossas próprias histórias, jogos ou animações, e tudo isso é feito através de uma linguagem visual: nós apenas precisamos arrastar blocos para dentro da área de programação. Foi desenvolvido pelo Media Lab do MIT em 2007, e tem como principais características a facilidade e acessibilidade, sendo uma ferramenta interessante tanto para aqueles que desejam aprender a programar como para aqueles que desejam ensinar. Muitas escolas em países desenvolvidos já utilizam o Scratch como parte da grade de ensino, mostrando para crianças a ciência da computação logo cedo. No Brasil, é utilizado tanto na Educação Básica como nas universidades. A programação aprimora o raciocínio lógico, a criatividade e a resolução de problemas, habilidades importantes para os cidadãos do século XXI.\nNeste livro, os autores têm como objetivo proporcionar aos estudantes, educadores e aos curiosos por programação o primeiro passo no mundo da programação por meio do Scratch. Você acompanhará criação de um jogo de labirinto do início ao fim, ao longo do qual serão abordados os conceitos básicos em programação, de maneira simples divertida e didática.","category":"Programação","subcategory":"Logica"},{"url":"https://www.casadocodigo.com.br/products/colecao-comece-a-programar","nome":"Coleção Comece a Programar","img":"/covers/casadocodigo-colecao-comece-programar_large.png?v=1470959480","nomeExibicao":"Coleção Comece a Programar","title":"Coleção Comece a Programar","sub":"","author":"Jonathan Lamim, Paulo Silveira, Adriano Almeida, Evaldo Junior Bento","content":"Começar no mundo da programação pode abrir portas, tanto de conhecimento, como para a sua carreira. E mais ainda, com pouco tempo produzir algo que realmente funciona é recompensador.\nEssa sequência foi pensada para você que quer começar, rapidamente, a construir seus primeiros sites e sistemas web. Iniciando pela Lógica de Programação, passando pelo aprendizado da linguagem PHP e os conceitos básicos para se trabalhar com bancos de dados para em seguida partir para o CodeIgniter, poderosa ferramenta que traz uma imensa produtividade no dia a dia do programador.\nCom esses 3 livros você estará nas mãos de autores experientes e focados em te fazer praticar desde as primeiras páginas.Veja o sumário completo dos livros: PHP e MySQL, Lógica de Programação e CodeIgniter.","category":"Programação","subcategory":"Logica"},{"url":"https://www.casadocodigo.com.br/products/livro-introducao-c","nome":"Introdução à programação em C: Os primeiros passos de um desenvolvedor","img":"/covers/introducao-c-featured_large.png?v=1440011167","nomeExibicao":"Lógica com C","title":"Introdução à programação em C","sub":"Os primeiros passos de um desenvolvedor","author":"Mauricio Aniche","content":"Você já programou alguma vez na vida? Pois então, prepare-se: sua vida vai mudar. Ensinar a máquina a fazer o que quer que ela faça é extremamente divertido. C é uma ótima linguagem para quem quer aprender programação: é bastante popular, poderosa, e nos dá diferentes níveis de abstração.\n\nNeste livro, Maurício Aniche vai ensinar você a programar por meio de três jogos: um jogo de adivinhação de palavras, o jogo da forca, e o Foge-foge, similar ao Pac-man. Escrever um jogo é extremamente desafiador. Eles são cheios de lógicas complicadas e casos excepcionais, que nos dão oportunidade de discutir e abordar muito código.\n\nNão há pré-requisitos. Você não precisa conhecer alguma linguagem de programação ou mesmo ter uma lógica de programação bem afiada. Este deve ser o seu primeiro livro de programação.","category":"Programação","subcategory":"Logica"},{"url":"https://www.casadocodigo.com.br/products/livro-aprendendo-computacao-ruby","nome":"Introdução à Computação: Da Lógica aos jogos com Ruby","img":"/covers/introducao-ruby-featured_9c39896f-ea67-4389-9f96-43a7a4de2b64_large.png?v=1432680156","nomeExibicao":"Computação com Ruby","title":"Introdução à Computação","sub":"Da Lógica aos jogos com Ruby","author":"Guilherme Silveira","content":"Em uma sociedade global que esbanja desenvolvimento tecnológico, aprender a programar passa a ser um conhecimento estratégico. Pensamentos transformados em linhas de código se tornam programas, jogos, sites e aplicativos. O homem pensa em ir até Marte e mergulha nos mistérios da ciência. Na fronteira de tudo isso, está o código.\n\nNeste livro, Guilherme Silveira ensina as principais matérias introdutórias dos cursos de computação, fazendo você criar seus primeiros jogos de computador. Entenda como seu programa toma decisões e domine o fluxo de sua execução com recursão. Decifre toda a sequência de um programa de computador entendendo a sua pilha de execução e domine a lógica por trás da criação de software.","category":"Programação","subcategory":"Logica"},{"url":"https://www.casadocodigo.com.br/products/livro-programacao","nome":"Lógica de Programação: Crie seus primeiros programas usando Javascript e HTML","img":"/covers/programacao-featured_large.png?v=1411490523","nomeExibicao":"Lógica de Programação","title":"Lógica de Programação","sub":"Crie seus primeiros programas usando Javascript e HTML","author":"Paulo Silveira, Adriano Almeida","content":"Aprenda a programar agora! Este livro apresenta uma abordagem totalmente prática. Uma didática pensada no iniciante, com a qual os conceitos são apresentados com motivações práticas, através do surgimento da necessidade para depois mostrar a solução.\n\nCom apenas um navegador e um editor de textos, você estará pronto para criar seus primeiros programas de computador. Lógica de programação e comandos como o if, for e while são motivados por meio de problemas que vivemos no nosso dia a dia. Dessa forma, ganha-se familiaridade com as instruções das linguagens de programação desde o começo do aprendizado!\n\nO livro explora os recursos do HTML e Javascript, criando a familiaridade desde o começo dos estudos com a sintaxe da linguagem de programação, instruções, funções específicas e problemas corriqueiros da programação; além disso, você aprenderá como usar o Canvas do HTML para criar seus desenhos através de programação e impressionar seus amigos.","category":"Programação","subcategory":"Logica"},{"url":"https://www.casadocodigo.com.br/products/vale-presente","nome":"Vale presente Casa do Código","img":"/covers/vale-presente-CDC_large.png?v=1451330431","nomeExibicao":"Vale Presente","title":"Vale presente Casa do Código","sub":"","author":"Casa do Código","content":"É sempre difícil escolher algo para seu amigo que trabalha com tecnologia. A Casa do Código possui um acervo de livros e e-books que vai agradar a todos. Não perca mais seu tempo escolhendo o presente de aniversário e de natal de seu colega.\nO presenteado pode também optar pelo livro impresso, o valor do vale presente só não abate o frete.\nAssim que você realizar a compra do vale presente, basta acessar http://valepresente.casadocodigo.com.br e preencher os dados para presentear seu amigo!","category":"Programação","subcategory":"Logica"},{"url":"https://www.casadocodigo.com.br/products/livro-aspnet-core-mvc","nome":"ASP.NET Core MVC: Aplicações modernas em conjunto com o Entity Framework","img":"/covers/8ROjv5OVfks54j7FvDehRuYHax0-et96hKHyplURGe4_large.jpg?v=1518105341","nomeExibicao":"ASP.NET Core MVC","title":"ASP.NET Core MVC","sub":"Aplicações modernas em conjunto com o Entity Framework","author":"Everton Coimbra de Araújo","content":"O ASP.NET Core MVC é um novo framework de código aberto da Microsoft para o desenvolvimento de aplicações web. Ele está dentro do framework .NET Core, o que possibilita a construção e a execução de aplicações em Windows, Mac e Linux. Utilizando como ferramentas o Visual Studio e a linguagem C# para os exemplos, o livro traz implementações que subsidiarão o desenvolvimento de suas próprias aplicações. Os exemplos também introduzem o Bootstrap e trabalham em uma ligação estreita com o Entity Framework Core como ferramenta para persistência de dados.\nNeste livro, Everton Coimbra apresenta o ASP.NET Core MVC de uma maneira que o leitor já possa aprender com a prática desde o início. O estudo é dirigido ao desenvolvimento de uma aplicação que envolve persistência em uma base de dados, fazendo uso do Entity Framework Core. Você verá desde as operações CRUD até como desenvolver seus layouts e tabelas, separando sua aplicação em camadas seguindo os conceitos de coesão e acoplamento. Dentre as técnicas e recursos apresentados, estão associações, personalização das classes de modelo, controle de acesso de usuários, tratamento de erros, controles DropDownList aninhados e o uso de sessão para o armazenamento de dados.","category":"Programação","subcategory":"Net"},{"url":"https://www.casadocodigo.com.br/products/livro-oo-csharp","nome":"Orientação a Objetos em C#: Conceitos e implementações em .NET","img":"/covers/Amazon-Orientacao-a-Objetos-em-C_large.jpg?v=1510337180","nomeExibicao":"Orientação a Objetos em C#","title":"Orientação a Objetos em C#","sub":"Conceitos e implementações em .NET","author":"Everton Coimbra de Araújo","content":"Nas últimas décadas, o paradigma da Orientação a Objetos tem servido como alicerce para o desenvolvimento de uma ampla gama de linguagens de programação e de ambientes integrados para o desenvolvimento de sistemas informatizados. É necessária uma compreensão profunda dos conceitos inerentes a este moderno paradigma, bem como saber aplicá-los na prática, para que se consiga maximizar seus benefícios: produzir sistemas bem-estruturados, com boa manutenibilidade e alta produtividade.\nNeste livro, Everton Coimbra aborda os elementos conceituais da Orientação a Objetos, demonstrando uma implementação prática na linguagem de programação C#, ilustrada passo a passo no Visual Studio. Você estudará os princípios da Orientação a Objetos, como associações, herança e polimorfismo, a linguagem C#, o Visual Studio, acesso ao banco de dados SQL Server por meio do ADO.NET e uma ainda terá introdução ao desenvolvimento de aplicações desktop e uma solução em camadas.","category":"Programação","subcategory":"Net"},{"url":"https://www.casadocodigo.com.br/products/livro-programacao-funcional-net","nome":"Programação funcional em .NET: Explore um novo universo","img":"/covers/Mjwq2cGKbD4-KWV7nQi4LpDvZrMH1AcxBKMZtbbpHMg_large.jpg?v=1507321170","nomeExibicao":"Programação funcional em .NET","title":"Programação funcional em .NET","sub":"Explore um novo universo","author":"Gabriel Schade Cardoso","content":"Apesar de sua elegância e produtividade, durante muito tempo a programação funcional foi deixada de lado pela maioria dos programadores, mas hoje frequentemente enfrentamos momentos em que a equipe precisa ser altamente produtiva e está cada vez mais comum a necessidade de escrevermos programas que processam grandes conjuntos de dados de forma distribuída entre processadores ou computadores. Nunca houve época melhor para aprender programação funcional do que agora.\nNeste livro, Gabriel Schade explorará os motivos do ganho recente de popularidade da programação funcional, mudança principalmente graças à incorporação de diversos conceitos funcionais em linguagens populares como Java e C#. Utilizando F#, a linguagem voltada a este paradigma na plataforma .NET, sempre fazendo o paralelo em C# para ajudá-lo na aprendizagem, você verá exemplos com estruturas de dados imutáveis, funcionalidades importantes do paradigma funcional, através da criação de uma aplicação web. O livro vem desmistificar o paradigma funcional com exemplos práticos e contextos reais, para que seja cada vez mais popular entre os desenvolvedores que desejam explorar este novo universo.\nEdição atualizada: agora todos os projetos do livro utilizam a plataforma .NET Core, a nova plataforma open-source e multiplataforma do .NET. O livro foi totalmente atualizado para utilizarmos a tecnologia mais recente da Microsoft. Além disso você poderá construir aplicações multiplataformas em .NET utilizando os sistemas operacionais Linux e Mac.","category":"Programação","subcategory":"Net"},{"url":"https://www.casadocodigo.com.br/products/livro-oo-conceitos","nome":"Orientação a Objetos: Aprenda seus conceitos e suas aplicabilidades de forma efetiva","img":"/covers/eBook-Orientacao-a-Objetos-atualizado_large.jpg?v=1523648187","nomeExibicao":"Orientação a Objetos","title":"Orientação a Objetos","sub":"Aprenda seus conceitos e suas aplicabilidades de forma efetiva","author":"Thiago Leite e Carvalho","content":"Conforme a demanda por novos paradigmas que correspondessem às necessidades do dia a dia dos programadores, surgia a Orientação a Objetos, com a missão de cobrir as insuficiências do modelo estrutural. O Paradigma Orientado a Objeto tem como principal característica uma melhor e maior expressividade das nossas demandas e possibilita criar unidades de código mais próximas da forma como pensamos e agimos, facilitando o processo de transformação das necessidades diárias para uma linguagem orientada a objetos.\n\nNeste livro, Thiago Leite demonstrará todos os seus conceitos para você utilizá-la da forma mais eficiente. Por meio de exemplos, você será iniciado nas boas práticas do uso da Orientação a Objetos para alcançar uma alta qualidade nos seus programas e tornar o processo de desenvolvimento mais produtivo e de mais fácil manutenção.","category":"Programação","subcategory":"Net"},{"url":"https://www.casadocodigo.com.br/products/livro-aspnet-mvc5","nome":"ASP.NET MVC5: Crie aplicações web na plataforma Microsoft®","img":"/covers/oYMlie2WOSoSAAMXetzaSsfNxsomFDB7b8dbi8uVY6o_size_mode_3_size_1280x960_large.jpeg?v=1463777619","nomeExibicao":"ASP.NET MVC5","title":"ASP.NET MVC5","sub":"Crie aplicações web na plataforma Microsoft®","author":"Everton Coimbra de Araújo","content":"O ASP.NET MVC 5 é um framework da Microsoft muito útil para o desenvolvimento de aplicações Web. Ao longo deste livro, você fará uso do IDE da Microsoft, o Visual Studio 2015 Community Edition, aprendendo por meio de exemplos desenvolvidos na linguagem C#. Com uma introdução ao Bootstrap, e um pouco de JavaScript e jQuery, será utilizado o Entity Framework como ferramenta para persistência de dados.\nEverton Coimbra explica conceitos de técnicas, do framework, da ferramenta e da linguagem, com uma boa introdução e exemplos práticos de suas utilizações. Neste livro, você verá implementações que vão lhe auxiliar no desenvolvimento de seus projetos, dando subsídios e recursos para você criar suas próprias aplicações.","category":"Programação","subcategory":"Net"},{"url":"https://www.casadocodigo.com.br/products/livro-web-services-rest","nome":"Web Services REST com ASP .NET Web API e Windows Azure","img":"/covers/wv3KXH7UbTZekuaCTSDj_sIcXB-c4iy37jj7vhCbYCg_size_mode_3_size_800x600_large.jpeg?v=1460748537","nomeExibicao":"Web Services REST","title":"Web Services REST com ASP .NET Web API e Windows Azure","sub":"","author":"Paulo Siécola","content":"A utilização de serviços REST é uma tendência que vem crescendo muito nos últimos anos, principalmente em APIs públicas, e ASP.NET Web API é a plataforma ideal para a criação de aplicações RESTful sob a plataforma .NET da Microsoft.  \n\nNeste livro, Paulo Siécola aborda a criação de Web Services em C#, utilizando a mais recente tecnologia da Microsoft, ASP.NET Web API. Trata-se de um framework que torna simples a criação de serviços a serem consumidos por uma variada gama de clientes, incluindo browsers, dispositivos móveis ou qualquer equipamento capaz de acessar recursos através de HTTP. Para hospedagem dos serviços que serão gerados ao longo dos projetos deste livro, será utilizada a plataforma de computação nas nuvens Windows Azure, que permite a criação de sites, banco de dados e aplicações.","category":"Programação","subcategory":"Net"},{"url":"https://www.casadocodigo.com.br/products/livro-c-sharp","nome":"C# e Visual Studio: Desenvolvimento de aplicações desktop","img":"/covers/csharp-featured_large.png?v=1443794473","nomeExibicao":"C# e Visual Studio","title":"C# e Visual Studio","sub":"Desenvolvimento de aplicações desktop","author":"Everton Coimbra de Araújo","content":"As tradicionais aplicações desktop que muito sucesso fizeram há alguns anos ainda possuem espaço vital no mercado e na arquitetura tecnológica de muitas empresas. Conhecer bem essas tecnologias e saber desenvolver com elas pode ser o diferencial para a escolha adequada em um projeto.\n\nNeste livro Everton Coimbra de Araújo ensina como desenvolver aplicações desktop através do C# e o Visual Studio, mostrando conceitos fundamentais para qualquer profissional que deseja versatilidade na carreira.","category":"Programação","subcategory":"Net"},{"url":"https://www.casadocodigo.com.br/products/livro-aspnet-mvc","nome":"Desenvolvimento web com ASP.NET MVC","img":"/covers/aspnet-mvc-featured_large.png?v=1411488896","nomeExibicao":"ASP.NET MVC","title":"Desenvolvimento web com ASP.NET MVC","sub":"","author":"Fabrício Sanchez, Márcio Fábio Althmann","content":"Especialmente nos últimos 5 anos, a web tornou-se um ambiente extremamente complexo do ponto de vista técnico. É claro que, em função disso, escrever boas aplicações para esse ambiente tornou-se um desafio interessante. Com o objetivo de criar um ecossistema de desenvolvimento mais saudável e produtivo, surgiram, neste período, diversas tecnologias (além das já previamente existentes, como PHP, por exemplo). A Microsoft fez sua parte e colocou no mercado um framework (respeitando um pattern já antigo - MVC) robusto para a construção de aplicações desta natureza, que privilegia a construção de boa arquitetura, a realização de testes, segurança e utilização de boas práticas. Estamos falando do ASP.NET MVC.\n\nEste livro apresentará conceitos iniciais acerca do framework ASP.NET MVC (versão 4) e  guiará por todo o processo de seu entendimento. Como funciona o ASP.NET MVC? Como posso criar uma aplicação partindo do zero? Como utilizar jQuery e chamadas assíncronas? Como implementar segurança para as aplicações? O que é esse tal de Razor e como utilizá-lo? Como trabalhar com dados respeitando boas práticas de desenvolvimento? HTML 5, CSS, Bootstrap, NuGet… Todos esses temas e as respostas para essas perguntas são contempladas nesta obra. Então, arregace as mangas e bons estudos!","category":"Programação","subcategory":"Net"},{"url":"https://www.casadocodigo.com.br/products/livro-tdd-dotnet","nome":"Test-Driven Development: Teste e Design no Mundo Real com .NET","img":"/covers/tdd-dotnet-featured_large.png?v=1411567862","nomeExibicao":"TDD com .NET","title":"Test-Driven Development","sub":"Teste e Design no Mundo Real com .NET","author":"Mauricio Aniche","content":"Por que não testamos software? Porque é caro? Porque é demorado? Porque é chato? Testes automatizados são a solução para todos esses problemas. Aprenda a escrever um programa que testa seu programa de forma rápida, barata e produtiva, e aumente a qualidade do seu produto final.\n\nNeste livro, você aprenderá sobre TDD, uma das práticas ágeis de desenvolvimento de software mais populares, através da linguagem C#. TDD faz o desenvolvedor escrever o teste antes mesmo de implementar o código. Essa simples inversão na maneira de se trabalhar faz com o que o desenvolvedor escreva um código mais testado, com menos bugs, e, inclusive, com mais qualidade. Seja profissional, teste seu software!\n\nTodos os exemplos desse livro foram escritos em C#.","category":"Programação","subcategory":"Net"},{"url":"https://www.casadocodigo.com.br/products/vale-presente","nome":"Vale presente Casa do Código","img":"/covers/vale-presente-CDC_large.png?v=1451330431","nomeExibicao":"Vale Presente","title":"Vale presente Casa do Código","sub":"","author":"Casa do Código","content":"É sempre difícil escolher algo para seu amigo que trabalha com tecnologia. A Casa do Código possui um acervo de livros e e-books que vai agradar a todos. Não perca mais seu tempo escolhendo o presente de aniversário e de natal de seu colega.\nO presenteado pode também optar pelo livro impresso, o valor do vale presente só não abate o frete.\nAssim que você realizar a compra do vale presente, basta acessar http://valepresente.casadocodigo.com.br e preencher os dados para presentear seu amigo!","category":"Programação","subcategory":"Net"},{"url":"https://www.casadocodigo.com.br/products/livro-design-paterns-php","nome":"Design Patterns com PHP 7: Desenvolva com as melhores soluções","img":"/covers/cover_755a35d9-dd95-4aff-b5dc-252904532bf7_large.jpg?v=1527274139","nomeExibicao":"Design Patterns com PHP 7","title":"Design Patterns com PHP 7","sub":"Desenvolva com as melhores soluções","author":"Gabriel Anhaia","content":"Do inglês Design Patterns, os Padrões de Projeto podem ser definidos como modelos de soluções para algum problema específico encontrado frequentemente dentro de um projeto de software. Com eles, conseguimos desenvolver sistemas mais modulares, expansíveis, reutilizáveis e com mais flexibilidade. Atualmente, dominá-los é considerada uma skill fundamental para qualquer desenvolvedor.\nNeste livro, Gabriel Anhaia apresenta os mais variados tipos de Padrões de Projeto, da forma mais objetiva e clara possível. São apresentadas as melhores soluções para problemas específicos encontrados constantemente na vida de um desenvolvedor de software e suas boas práticas. Você verá suas descrições, problemas reais que cada padrão se propõe a resolver, diagramas e dicas, com uma parte prática para aplicá-lo. Para você que já tem algum conhecimento em Orientação a Objetos e trabalha com a linguagem PHP, certamente conhecer Design Patterns é seu próximo passo para levar a qualidade dos seus projetos a um outro nível.","category":"Programação","subcategory":"OO"},{"url":"https://www.casadocodigo.com.br/products/livro-oo-csharp","nome":"Orientação a Objetos em C#: Conceitos e implementações em .NET","img":"/covers/Amazon-Orientacao-a-Objetos-em-C_large.jpg?v=1510337180","nomeExibicao":"Orientação a Objetos em C#","title":"Orientação a Objetos em C#","sub":"Conceitos e implementações em .NET","author":"Everton Coimbra de Araújo","content":"Nas últimas décadas, o paradigma da Orientação a Objetos tem servido como alicerce para o desenvolvimento de uma ampla gama de linguagens de programação e de ambientes integrados para o desenvolvimento de sistemas informatizados. É necessária uma compreensão profunda dos conceitos inerentes a este moderno paradigma, bem como saber aplicá-los na prática, para que se consiga maximizar seus benefícios: produzir sistemas bem-estruturados, com boa manutenibilidade e alta produtividade.\nNeste livro, Everton Coimbra aborda os elementos conceituais da Orientação a Objetos, demonstrando uma implementação prática na linguagem de programação C#, ilustrada passo a passo no Visual Studio. Você estudará os princípios da Orientação a Objetos, como associações, herança e polimorfismo, a linguagem C#, o Visual Studio, acesso ao banco de dados SQL Server por meio do ADO.NET e uma ainda terá introdução ao desenvolvimento de aplicações desktop e uma solução em camadas.","category":"Programação","subcategory":"OO"},{"url":"https://www.casadocodigo.com.br/products/livro-oo-conceitos","nome":"Orientação a Objetos: Aprenda seus conceitos e suas aplicabilidades de forma efetiva","img":"/covers/eBook-Orientacao-a-Objetos-atualizado_large.jpg?v=1523648187","nomeExibicao":"Orientação a Objetos","title":"Orientação a Objetos","sub":"Aprenda seus conceitos e suas aplicabilidades de forma efetiva","author":"Thiago Leite e Carvalho","content":"Conforme a demanda por novos paradigmas que correspondessem às necessidades do dia a dia dos programadores, surgia a Orientação a Objetos, com a missão de cobrir as insuficiências do modelo estrutural. O Paradigma Orientado a Objeto tem como principal característica uma melhor e maior expressividade das nossas demandas e possibilita criar unidades de código mais próximas da forma como pensamos e agimos, facilitando o processo de transformação das necessidades diárias para uma linguagem orientada a objetos.\n\nNeste livro, Thiago Leite demonstrará todos os seus conceitos para você utilizá-la da forma mais eficiente. Por meio de exemplos, você será iniciado nas boas práticas do uso da Orientação a Objetos para alcançar uma alta qualidade nos seus programas e tornar o processo de desenvolvimento mais produtivo e de mais fácil manutenção.","category":"Programação","subcategory":"OO"},{"url":"https://www.casadocodigo.com.br/products/livro-oo-solid","nome":"Orientação a Objetos e SOLID para Ninjas: Projetando classes flexíveis","img":"/covers/oo-solid-sumario-featured_large.png?v=1430310678","nomeExibicao":"OO SOLID para Ninjas","title":"Orientação a Objetos e SOLID para Ninjas","sub":"Projetando classes flexíveis","author":"Mauricio Aniche","content":"Todo profissional que trabalha com desenvolvimento deve conhecer os conceitos básicos de Orientação a Objetos. Esse paradigma, além de fundamental, é utilizado em todo o mercado de software ao redor do mundo. Mas nós sabemos que, na prática, o que vemos espalhado por aí são pilhas de códigos procedurais disfarçados. Neste livro, Maurício Aniche discute como a implementação e o foco no projeto de classes é importante para criar um software de qualidade. Sempre mantendo a característica de escrever um livro com uma didática voltada para o mundo real, você vai entender como moldar e dominar as peças da Orientação a Objetos usando os princípios de SOLID e escrevendo um código mais elegante e fácil de manter. Saia do básico e vire um ninja da Orientação a Objetos aprendendo de forma prática e eficaz as boas práticas do assunto.Os exemplos ao longo do livro estão escritos em Java, porém são facilmente compreendidas por qualquer programador. As discussões fazem sentido para todas as linguagens OO.","category":"Programação","subcategory":"OO"},{"url":"https://www.casadocodigo.com.br/products/livro-mundoj-orientacao-objetos","nome":"MundoJ: Orientação a Objetos","img":"/covers/mundoj-orientacao-objetos-featured_large.png?v=1417782442","nomeExibicao":"MundoJ Orientação a Objetos","title":"MundoJ","sub":"Orientação a Objetos","author":"MundoJ","content":"Nessa coletânea de artigos da MundoJ, você aprenderá a trabalhar adequadamente com a Orientação a Objetos, por meio de 4 artigos fundamentais para quem está começando a trabalhar com esse maravilhoso paradigma: Domain Driven Design, DSLs internas, Melhoria contínua com refatoração e modelagem ágil.\n\nAqui você verá todo o necessário para entrar nesse universo da Orientação a Objetos de forma adequada.\n\nVeja o sumário completo do livro","category":"Programação","subcategory":"OO"},{"url":"https://www.casadocodigo.com.br/products/livro-orientacao-objetos-java","nome":"Desbravando Java e Orientação a Objetos: Um guia para o iniciante da linguagem","img":"/covers/orientacao-objetos-java-featured_large.png?v=1416402140","nomeExibicao":"Java e OO","title":"Desbravando Java e Orientação a Objetos","sub":"Um guia para o iniciante da linguagem","author":"Rodrigo Turini","content":"Aprenda Orientação a Objetos com Java de forma simples e efetiva! Você compilará e executará seu próprio programa em algumas horas. Por que Java? Essa é uma das linguagens de programação mais utilizadas em todo o mundo, com 20 anos e atualmente mais de 9 milhões de desenvolvedores.\n\nO livro explora importantes conceitos da orientação a objetos como encapsulamento, herança e polimorfismo. Sempre com exemplos mão na massa, pensados para que você saiba exatamente quando e como utilizá-los.\n\nAlém disso, serão ensinadas boas práticas de programação e recursos essenciais que com certeza farão parte de sua rotina, dos mais tradicionais aos mais novos introduzidos no Java 8. É sua vez de desbravar o mundo Java!","category":"Programação","subcategory":"OO"},{"url":"https://www.casadocodigo.com.br/products/livro-arquitetura-java","nome":"Introdução à Arquitetura e Design de Software: Uma visão sobre a plataforma Java","img":"/covers/arquitetura-java-featured_large.png?v=1411489903","nomeExibicao":"Arquitetura Java","title":"Introdução à Arquitetura e Design de Software","sub":"Uma visão sobre a plataforma Java","author":"Paulo Silveira, Guilherme Silveira, Sérgio Lopes, Guilherme Moreira, Nico Steppat, Fabio Kung","content":"Neste livro, os autores, conhecidos especialistas da área, apresentam muitos tópicos que aparecem com frequência na plataforma Java, incluindo desde modelagem e design das classes, até detalhes importantes das tecnologias mais utilizadas.\n\nSempre com uma visão técnica e prática capaz de elucidar muitas questões enfrentadas tanto pelo profissional iniciante quanto por aquele que está adquirindo mais experiência na plataforma.\n\nOs e-books da Casa do Código não possuem DRM. Compre agora e baixe o PDF, epub e mobi e leia no dispositivo que quiser.","category":"Programação","subcategory":"OO"},{"url":"https://www.casadocodigo.com.br/products/livro-design-patterns","nome":"Design Patterns com Java: Projeto orientado a objetos guiado por padrões","img":"/covers/design-patterns-featured_large.png?v=1411489099","nomeExibicao":"Design Patterns","title":"Design Patterns com Java","sub":"Projeto orientado a objetos guiado por padrões","author":"Eduardo Guerra","content":"Não é trivial compreender bem os design patterns. Entender quando aplicá-los é algo que qualquer desenvolvedor deve saber. Nesse livro, você aprenderá com exemplos práticos e bem contextualizados como aplicar os padrões e em quais situações um é mais indicado que o outro. Diferencie as características particulares de cada padrão, crie aplicações que usam o melhor da orientação a objetos em seu favor e desenvolva aplicações que você conseguirá manter para sempre!","category":"Programação","subcategory":"OO"},{"url":"https://www.casadocodigo.com.br/products/vale-presente","nome":"Vale presente Casa do Código","img":"/covers/vale-presente-CDC_large.png?v=1451330431","nomeExibicao":"Vale Presente","title":"Vale presente Casa do Código","sub":"","author":"Casa do Código","content":"É sempre difícil escolher algo para seu amigo que trabalha com tecnologia. A Casa do Código possui um acervo de livros e e-books que vai agradar a todos. Não perca mais seu tempo escolhendo o presente de aniversário e de natal de seu colega.\nO presenteado pode também optar pelo livro impresso, o valor do vale presente só não abate o frete.\nAssim que você realizar a compra do vale presente, basta acessar http://valepresente.casadocodigo.com.br e preencher os dados para presentear seu amigo!","category":"Programação","subcategory":"OO"},{"url":"https://www.casadocodigo.com.br/products/livro-trilhas-python","nome":"Trilhas Python: Programação multiparadigma e desenvolvimento Web com Flask","img":"/covers/psAMwwTIQZZygm3u5NRBJg6olDKQERUGv7qX9EcPe78_large.jpg?v=1529696678","nomeExibicao":"Trilhas Python","title":"Trilhas Python","sub":"Programação multiparadigma e desenvolvimento Web com Flask","author":"Eduardo Pereira","content":"Ao aprender programação, temos diferentes formas de se resolver um problema, segundo métodos e conceitos que podem ser mais ou menos adequados, de acordo como o problema que se tenta resolver. São os chamados paradigmas de programação. A linguagem Python, sendo multiparadigma, oferece uma gama de possibilidades para o desenvolvedor, mostrando-se versátil para guiá-lo por uma trilha completa de conhecimento.\nNeste livro, Eduardo Pereira apresenta tópicos de programação em Python que vão do básico ao avançado. Você verá desde estrutura de dados, funções e decoradores e criará um Jogo da Velha seguindo o paradigma de Programação Estruturada, aprimorando-o com Orientação a Objetos. Em seguida, são abordados tópicos mais avançados da linguagem, como compreensões e geradores, que são fundamentais para a Programação Funcional em Python. Por último, você aplicará o conhecimento de programação Python para o desenvolvimento Web, criando uma aplicação de streaming de música, com o framework Flask, juntamente com uma Database Abstraction Layer (PyDAL) para a integração da aplicação com banco de dados.","category":"Programação","subcategory":"Outros"},{"url":"https://www.casadocodigo.com.br/products/livro-visao-computacional","nome":"Introdução à Visão Computacional: Uma abordagem prática com Python e OpenCV","img":"/covers/wlO5NC7VezUCpWXPYGI250y-L7H32JYhDnbdxP4zfG8_large.jpg?v=1524855330","nomeExibicao":"Visão Computacional","title":"Introdução à Visão Computacional","sub":"Uma abordagem prática com Python e OpenCV","author":"Felipe Barelli","content":"Os sistemas de Visão Computacional estão cada vez mais presentes em nosso cotidiano, seja nos veículos autônomos, nos robôs industriais ou em equipamentos hospitalares capazes de diagnosticar doenças automaticamente em exames por imagem. Justamente por essa tecnologia permitir que máquinas enxerguem o mundo à nossa volta, sendo capaz de automatizar e solucionar tantos problemas, é que o mercado necessita cada vez mais de profissionais capacitados para atuarem nesse segmento.\nNeste livro, Felipe Barelli vem atender a essa demanda, dando o pontapé inicial para o profissional que deseja entrar, de forma prática e um pouco teórica, nos estudos sobre o desenvolvimento de sistemas baseados em Visão Computacional. Você vai aprender como programar computadores para enxergar o ambiente ao nosso redor e torná-los capazes de reconhecer e extrair informações de objetos, mesclando conhecimentos de matemática, fotografia e programação.\nAs versões utilizadas são: Python: versão 2.7.14 e OpenCV: 2.4.13","category":"Programação","subcategory":"Outros"},{"url":"https://www.casadocodigo.com.br/products/livro-apis-nodejs","nome":"Construindo APIs REST com Node.js","img":"/covers/zGb75MbYhQ0_Rc954-y3OZOq9O169BSqY0WslUDTmBk_size_mode_3_size_1024x768_large.jpeg?v=1453497826","nomeExibicao":"APIs Node.js","title":"Construindo APIs REST com Node.js","sub":"","author":"Caio Ribeiro Pereira","content":"Hoje em dia, é muito comum criar aplicações client-side para web e mobile que consomem dados de uma API (Application Programming Interface), que são sistemas back-end focados apenas no processamento e envio de dados, de forma centralizada. Isso permite que sejam desenvolvidas múltiplas aplicações clientes com interfaces específicas para usuários mobile, desktop ou web. Desde 2010, o Node.js provou ser uma excelente plataforma escalável na solução de diversos problemas, principalmente para construção de APIs RESTful.\n\nNeste livro, Caio Ribeiro Pereira mostra na prática os motivos por que optar pelo Node.js, que é uma plataforma altamente escalável e de baixo nível. Nele, você vai aprender boas práticas sobre como construir uma API utilizando código ECMAScript 2015 (aka ES6) e frameworks populares como Express, Passport, Apidoc, Mocha e muito mais. \n\nO projeto será integrado com banco de dados relacional através do Sequelize.js e, para finalizar, será construída uma aplicação cliente web em formato SPA (Single Page Application) utilizando apenas o melhor do mais puro Vanilla JavaScript.","category":"Programação","subcategory":"Outros"},{"url":"https://www.casadocodigo.com.br/products/livro-octave","nome":"Octave: Seus primeiros passos na programação científica","img":"/covers/isvvZtPdj_hi28pBwwPJRuQz5bvR9spqTKpO22oGQQ4_size_mode_3_size_800x600_large.jpeg?v=1449257973","nomeExibicao":"Octave","title":"Octave","sub":"Seus primeiros passos na programação científica","author":"Alexandre Fioravante de Siqueira","content":"O GNU Octave possui estrutura similar à da linguagem Matlab, que é uma linguagem de programação interpretada de alto nível, voltada ao cálculo matricial, à computação, visualização e programação numérica. É um software livre que dispõe de ferramentas para a resolução de problemas relativos à álgebra linear, equações não lineares, equações diferenciais e algébrico-diferenciais, entre outros.\n\nNeste livro, Alexandre dará uma introdução à computação científica por meio do software GNU Octave. Serão abordadas funções matemáticas básicas, vetores e matrizes, gráficos bidimensionais e tridimensionais, funções e pacotes disponíveis no Octave Forge.","category":"Programação","subcategory":"Outros"},{"url":"https://www.casadocodigo.com.br/products/livro-guia-mestre-programador","nome":"Guia do mestre programador: pensando como pirata, evoluindo como jedi","img":"/covers/F_rZcE1nCFDaz1yv2rMbvp0sp7ehJKYYt3i1s1zp9Jc_size_mode_3_size_1024x768_large.jpeg?v=1448907418","nomeExibicao":"Guia do Mestre Programador","title":"Guia do mestre programador","sub":"pensando como pirata, evoluindo como jedi","author":"Carlos Bueno","content":"Investir em conhecimento rende sempre os melhores juros – Já dizia Benjamin Franklin. Conhecimento é um dos raros bens humanos que não podem ser roubados e é importantíssimo investir em si mesmo, por meio de cursos, livros, palestras e experiências que lhe acoplem o repertório da vida. Aplicando a sabedoria à outra variável de sucesso – o foco – é possível potencializar suas habilidades ao máximo para aproveitar toda sua carga de recursos para gerenciar o caminho que você deseja trilhar.\n\nNeste livro, Carlos Bueno apresenta, por meio de metáforas cativantes, um guia para você se tornar um mestre programador. Como um pirata, você deve buscar recursos além das formas institucionais. O profissional diferenciado é aquele que trilha o percurso para se tornar um Padawan.","category":"Programação","subcategory":"Outros"},{"url":"https://www.casadocodigo.com.br/products/livro-guia-node-express","nome":"Canivete suíço do desenvolvedor Node","img":"/covers/KKrmIrJLg4wrrI3mGQL_VlVUenEaSaNVRscaD6HlQvU_size_mode_2_size_1024x768_large.jpeg?v=1446834644","nomeExibicao":"Node.js com Express","title":"Canivete suíço do desenvolvedor Node","sub":"","author":"Caio Incau","content":"Você já passou por problemas reais ao fazer o deploy de uma aplicação com Express? Como, por exemplo, servir conteúdo estático de forma otimizada, tratar os erros, usar cache, ou até mesmo a necessidade de criar um Cluster?\n\nPois bem, é isto que este livro aborda: como resolver ou se prevenir de problemas na sua aplicação utilizando Express.\n\nA ideia é tratar de diversos conceitos básicos e avançados que resolvam alguns dos principais impasses do dia a dia de um desenvolvedor.","category":"Programação","subcategory":"Outros"},{"url":"https://www.casadocodigo.com.br/products/livro-refatoracao-ruby","nome":"Refatorando com padrões de projeto: Um guia em Ruby","img":"/covers/Amazon-Refatoracao-Ruby_large.jpg?v=1445627898","nomeExibicao":"Refatoração com Ruby","title":"Refatorando com padrões de projeto","sub":"Um guia em Ruby","author":"Marcos Brizeno","content":"A comunidade Ruby é famosa por advogar em favor da qualidade de código e refatoração segue sendo um assunto relevante e pertinente tanto para novos profissionais como para quem já sabe do que se trata: melhorar o design existente, aplicar mudanças em pequenos passos e evitar deixar o sistema quebrado. Ao aplicar refatorações, existem várias técnicas que podem ajudar para alcançar a melhoria desejada.\n\nNeste livro, Marcos Brizeno mostra como padrões de projeto podem ajudar nos passos da refatoração de um projeto Ruby, para que você saiba decidir quando ou não determinado padrão pode ser aplicado para alcançar o código ideal.","category":"Programação","subcategory":"Outros"},{"url":"https://www.casadocodigo.com.br/products/livro-abap","nome":"ABAP: O guia de sobrevivência do profissional moderno","img":"/covers/abap-featured_large.png?v=1443800217","nomeExibicao":"O mercado ABAP","title":"ABAP","sub":"O guia de sobrevivência do profissional moderno","author":"Mauricio Roberto Cruz","content":"Os softwares da SAP estão presentes nas grandes e médias corporações que criam produtos consumidos por nós diariamente. Isso tudo foi construído ao longo de mais de 30 anos de trabalho, com o apoio de uma linguagem de programação proprietária amplamente utilizada, o ABAP.\n\nPor conta de sua longa existência e de um mercado um pouco fechado, o ABAP é visto como uma linguagem velha e antiquada, incapaz de atender os anseios e vontades de programadores mais jovens. Mas será que isso é realmente um fato ou uma constatação baseada puramente no tempo de sua existência?\n\nNeste livro, Mauricio Roberto Cruz vai passar por todos os estágios da vida de um programador ABAP: os primeiros passos, funcionamento do mercado, decisões de carreira, discussões sobre tabus, formas de encarar o trabalho e o futuro da linguagem. Com isso, iniciantes poderão iniciar um caminho sem incorporar vícios antigos e profissionais da área poderão repensar a forma como encaram o seu trabalho. \n\nO ABAP está em constante evolução. Torne-se um profissional moderno e evolua com ele!","category":"Programação","subcategory":"Outros"},{"url":"https://www.casadocodigo.com.br/products/livro-python-3","nome":"Python: Escreva seus primeiros programas","img":"/covers/python3-featured_large.png?v=1441973789","nomeExibicao":"Python 3","title":"Python","sub":"Escreva seus primeiros programas","author":"Felipe Cruz","content":"Existe um movimento na comunidade de programação que diz que você deve aprender uma nova linguagem por ano. Isso faz com que você estude novos conceitos e práticas, melhorando a forma como você trabalha no dia a dia. Mas qual será a sua próxima linguagem?\n\nPython é a principal linguagem de programação utilizada no Google e repleta de funcionalidades interessantes. Neste livro, Felipe Cruz vai introduzi-lo ao Python 3, a versão mais atual, mostrando seu funcionamento, sintaxe, manipulação de arquivos, tratamento de exceções, estruturas de dados, a biblioteca padrão e tudo o que você precisa saber para começar a programar nessa linguagem.","category":"Programação","subcategory":"Outros"},{"url":"https://www.casadocodigo.com.br/products/livro-introducao-c","nome":"Introdução à programação em C: Os primeiros passos de um desenvolvedor","img":"/covers/introducao-c-featured_large.png?v=1440011167","nomeExibicao":"Lógica com C","title":"Introdução à programação em C","sub":"Os primeiros passos de um desenvolvedor","author":"Mauricio Aniche","content":"Você já programou alguma vez na vida? Pois então, prepare-se: sua vida vai mudar. Ensinar a máquina a fazer o que quer que ela faça é extremamente divertido. C é uma ótima linguagem para quem quer aprender programação: é bastante popular, poderosa, e nos dá diferentes níveis de abstração.\n\nNeste livro, Maurício Aniche vai ensinar você a programar por meio de três jogos: um jogo de adivinhação de palavras, o jogo da forca, e o Foge-foge, similar ao Pac-man. Escrever um jogo é extremamente desafiador. Eles são cheios de lógicas complicadas e casos excepcionais, que nos dão oportunidade de discutir e abordar muito código.\n\nNão há pré-requisitos. Você não precisa conhecer alguma linguagem de programação ou mesmo ter uma lógica de programação bem afiada. Este deve ser o seu primeiro livro de programação.","category":"Programação","subcategory":"Outros"},{"url":"https://www.casadocodigo.com.br/products/livro-grails","nome":"Falando de Grails: Altíssima produtividade no desenvolvimento web","img":"/covers/grails-featured_large.png?v=1429737103","nomeExibicao":"Grails Framework","title":"Falando de Grails","sub":"Altíssima produtividade no desenvolvimento web","author":"Henrique Lobo Weissmann","content":"Quando construímos aplicações web, queremos nos livrar de tarefas repetitivas, configurações complicadas e detalhes chatos que tiram nosso foco do que é mais divertido: desenvolver a aplicação. Seja um programador mais produtivo por meio de ferramentas mais produtivas. Essa é a proposta do Grails: focar no que é mais divertido.\n\nNeste livro, Henrique Lobo Weissmann vai mostrar como atingir uma produtividade plena, rapidamente construindo aplicações web robustas e com diversas funcionalidades com pouca complicação. Com uma abordagem prática e por exemplos do dia a dia dos desenvolvedores, logo nos primeiros capítulos você já terá funcionalidades implementadas e aprenderá todo o Grails de ponta a ponta.","category":"Programação","subcategory":"Outros"},{"url":"https://www.casadocodigo.com.br/products/livro-mean","nome":"Mean: Full stack JavaScript para aplicações web com MongoDB, Express, Angular e Node","img":"/covers/mean-featured_large.png?v=1423666173","nomeExibicao":"MEAN","title":"Mean","sub":"Full stack JavaScript para aplicações web com MongoDB, Express, Angular e Node","author":"Flávio Almeida","content":"Já pensou em desenvolver aplicações web ricas com recursos complexos, extremamente performáticos e robustos? É isso que você conseguirá fazer com a stack MEAN.\n\nUnindo várias das principais tecnologias do mercado, como o MongoDB, Express, Angular e Node.js em cima da linguagem JavaScript, é possível criar aplicações em um curto espaço de tempo em uma linguagem sobre a qual todo desenvolvedor web possui algum conhecimento.\n\nNeste livro completíssimo, Flávio Almeida vai ensinar a desenvolver com essa poderosa stack, passando pelos problemas encontrados no dia a dia, destrinchando cada um dos seus elementos fundamentais e indo até o deploy e o teste da aplicação. É um livro que todo desenvolvedor web precisa ler.","category":"Programação","subcategory":"Outros"},{"url":"https://www.casadocodigo.com.br/products/livro-rust-funcional-concorrente","nome":"Programação Funcional e Concorrente em Rust","img":"/covers/fjRCXKbPMIcdYdC5HjX_nh6yUyQwwxV6aIOE7G_nYS4_large.jpg?v=1519941170","nomeExibicao":"Rust Funcional e Concorrente","title":"Programação Funcional e Concorrente em Rust","sub":"","author":"Julia Naomi Boeira","content":"Rust é uma linguagem de nível de sistema com algumas características que são grandes diferenciais, como ter segurança de memória sem coletor de lixo, possibilitar concorrência sem corrida de dados, abstração sem overhead e um compilador que garante segurança no alocamento de recursos. Com Rust, pensar em Programação Funcional será algo muito intuitivo no desenvolvimento.\nNeste livro, Julia Naomi traz todo o potencial do Rust, apresentando-o como uma ótima opção às outras linguagens, inclusive as de mais alto nível, sendo até possível implementar TDD. Você verá como Programação Funcional se associa a Rust, em comparação com Clojure, com foco em funções, traits, iterators, adapters e consumers. Além disso, você se aprofundará em sua principal característica, a concorrência, nos diversos modos que o Rust oferece, como a criação de threads, o compartilhamento de estados e a transferência de informações por canais. A autora ainda apresenta quatro frameworks HTTP, sendo dois de alto nível (Iron e Nickel), um de baixo nível (Hyper) e um de programação assíncrona (Tokio), com os quais você já pode colocar a mão na massa.","category":"Programação","subcategory":"Outros"},{"url":"https://www.casadocodigo.com.br/products/livro-swift-ios","nome":"Swift: Programe para iPhone e iPad","img":"/covers/Swift-ebook_large.png?v=1418170204","nomeExibicao":"Swift e iOS","title":"Swift","sub":"Programe para iPhone e iPad","author":"Guilherme Silveira, Joviane Jardim","content":"Desenvolver aplicativos para iPhone e iPad nunca foi tão prazeroso. Com a nova linguagem da Apple (Swift) e com a recente versão do iOS, o desenvolvimento se torna descomplicado, pois há uma nova gama de recursos disponíveis que mantêm a clássica elegância da principal plataforma mobile do mundo.\n\nProgramadores do mundo inteiro estão aprendendo a programar para iOS com Swift. Nesse livro, Guilherme Silveira e Joviane Jardim vão ensinar como entrar nesse universo e criar sua aplicação, do início ao fim, aprendendo os recursos da nova linguagem e do novo iOS, usando várias boas práticas de programação de quebra.","category":"Programação","subcategory":"Outros"},{"url":"https://www.casadocodigo.com.br/products/livro-thoughtworks-antologia","nome":"Thoughtworks Antologia Brasil: Histórias de aprendizado e inovação","img":"/covers/thoughtworks-antologia-featured_large.png?v=1416319002","nomeExibicao":"ThoughtWorks Antologia Brasil","title":"Thoughtworks Antologia Brasil","sub":"Histórias de aprendizado e inovação","author":"ThoughtWorks","content":"Estar na vanguarda das tecnologias e metodologias de desenvolvimento é uma das principais características da ThoughtWorks, empresa reconhecida mundialmente e onde trabalham nomes como Martin Fowler, Danilo Sato, Rebecca Parsons, Paulo Caroli e muitos outros expoentes da área.\n\nNeste livro, vários colaboradores da ThoughtWorks passam suas experiências com as mais variadas tecnologias e metodologias. Você vai aprender sobre BDD, testes com JavaScript, inovação em startups, agilidade, técnicas de retrospectivas, técnicas avançadas de trabalho com controle de versão e muito mais.\n\nÉ um livro indispensável para quem quer se manter atualizado e entender as tecnologias e métodos trabalhados na principal empresa de consultoria da área.","category":"Programação","subcategory":"Outros"},{"url":"https://www.casadocodigo.com.br/products/livro-rspec","nome":"RSpec: Crie especificações executáveis em Ruby","img":"/covers/rspec-featured_large.png?v=1416319123","nomeExibicao":"RSpec","title":"RSpec","sub":"Crie especificações executáveis em Ruby","author":"Mauro George","content":"Saber testar adequadamente as aplicações Ruby e Rails é um pré-requisito no mercado atual e, para isso, precisamos conhecer bem as ferramentas que podem nos ajudar nessas tarefas.\n\nO RSpec é a biblioteca mais usada para criar testes e especificações para as aplicações Ruby; mas, junto dele, é preciso usar várias outras que também têm um papel fundamental.\n\nNeste livro, Mauro George ensinará a escrever especificações com o RSpec e também a integrá-lo com bibliotecas como Factory Girl, WebMock, VCR e muito mais.","category":"Programação","subcategory":"Outros"},{"url":"https://www.casadocodigo.com.br/products/livro-google-go","nome":"Programando em Go: Crie aplicações com a linguagem do Google","img":"/covers/google-go-featured_large.png?v=1411566554","nomeExibicao":"Google Go","title":"Programando em Go","sub":"Crie aplicações com a linguagem do Google","author":"Caio Filipini","content":"Go é uma linguagem moderna, criada com o objetivo principal de melhorar a produtividade no desenvolvimento em larga escala de servidores, baseado nas experiências de alguns times dentro do Google.\n\nHoje, mais de quatro anos após ter sido anunciada publicamente, cada vez mais empresas têm adotado a linguagem para escrever diversos tipos diferentes de aplicações, muito além dos servidores.\n\nGo traz um misto interessante de recursos de alto e baixo nível que a torna atraente para diferentes públicos. Suas principais características incluem o controle inteligente de dependências, compilação rápida e eficiente, sintaxe simples, gerenciamento automático de memória incluindo um coletor de lixo, sistema de tipos forte e estático, funções de primeira classe e suporte nativo e de alto nível para concorrência.\n\nEste livro apresenta ao leitor os recursos da linguagem Go e importantes partes de sua biblioteca padrão, sempre incluindo exemplos relevantes que demonstram o uso de cada recurso.","category":"Programação","subcategory":"Outros"},{"url":"https://www.casadocodigo.com.br/products/livro-tdd-ruby","nome":"Test Driven Development: Teste e design no mundo real com Ruby","img":"/covers/tdd-ruby-featured_large.png?v=1411567682","nomeExibicao":"TDD Ruby","title":"Test Driven Development","sub":"Teste e design no mundo real com Ruby","author":"Hugo Corbucci, Mauricio Aniche","content":"Por que não testamos software? Porque é caro? Porque é demorado? Porque é chato? Testes automatizados são a solução para todos esses problemas. Aprenda a escrever um programa que testa seu programa de forma rápida, barata e produtiva, e aumente a qualidade do seu produto final.\n\nNeste livro, você aprenderá sobre TDD, uma das práticas ágeis de desenvolvimento de software mais populares. TDD faz o desenvolvedor escrever o teste antes mesmo de implementar o código. Essa simples inversão na maneira de se trabalhar faz com o que o desenvolvedor escreva código mais testado, com menos bugs, e, inclusive, com mais qualidade. Seja profissional, teste seu software!\n\nTodos os exemplos desse livro foram escritos em Ruby.","category":"Programação","subcategory":"Outros"},{"url":"https://www.casadocodigo.com.br/products/livro-meteor","nome":"Meteor: Criando aplicações web real-time com JavaScript","img":"/covers/meteor-featured_large.png?v=1411565690","nomeExibicao":"Meteor","title":"Meteor","sub":"Criando aplicações web real-time com JavaScript","author":"Caio Ribeiro Pereira","content":"O JavaScript já é uma opção real de desenvolvimento server-side. Trabalhar com a mesma linguagem que utilizamos no front-end é também uma grande vantagem. Diversos frameworks surgiram e, sem dúvida, o Meteor é que mais se destaca.\n\nNeste livro, venha desenvolver sua própria rede social do zero implementando funcionalidades que interagem em tempo real, além de também aprender a trabalhar com diversos componentes nativos do framework que visam agilizar a prototipagem da aplicação, utilizando o Meteor 1.1.x.\n\nTambém veremos como lidar tarefas do dia a dia como criação de templates com Handlebars; integração com a API do Facebook para autenticação e cadastro de usuários; utilização do banco de dados não-relacional MongoDB; e programação orientada a eventos, utilizando PubSub nativo do Meteor.","category":"Programação","subcategory":"Outros"},{"url":"https://www.casadocodigo.com.br/products/livro-kinect","nome":"Microsoft Kinect: Crie aplicações interativas","img":"/covers/kinect-featured_large.png?v=1416319109","nomeExibicao":"Microsoft Kinect","title":"Microsoft Kinect","sub":"Crie aplicações interativas","author":"Gabriel Schade Cardoso","content":"Com o crescimento e popularização da tecnologia, é cada vez mais comum pessoas de diferentes idades utilizarem aplicativos. Com isso, surge a necessidade do uso de interfaces naturais em aplicações. Aprenda com este livro a criar aplicações incríveis aproveitando todos os recursos do sensor de movimentos Microsoft Kinect.\n\nCrie aplicativos modernos que são acessíveis através de gestos, poses e comandos de voz. Aprenda a utilizar sistemas de coordenadas de três dimensões e matemática de forma simples e sem traumas. Se você já sabe C# já tem tudo que precisa para entrar neste mundo de interfaces naturais e sensores de movimento.","category":"Programação","subcategory":"Outros"},{"url":"https://www.casadocodigo.com.br/products/livro-rest","nome":"REST: Construa API's inteligentes de maneira simples","img":"/covers/rest-featured_large.png?v=1411566684","nomeExibicao":"REST","title":"REST","sub":"Construa API's inteligentes de maneira simples","author":"Alexandre Saudate","content":"De alguma maneira, os sistemas modernos precisam se integrar com outros sistemas, seja para coletar dados, enviar informações, autenticação ou várias outras funcionalidades.\n\nNeste livro, Alexandre Saudate ensina como implementar APIs REST, que são simples e fáceis de manter, indo desde o básico dos formatos de dados como XML e JSON, passando por uma implementação rústica de um serviço e evoluindo para uso da poderosa especificação Java, o JAX-RS. Você ainda vai aprender técnicas avançadas, como trabalhar com as Hypermedias, criando fluxos inteligentes nos seus serviços. Veja também como realizar autenticação através do OAuth e muito mais!","category":"Programação","subcategory":"Outros"},{"url":"https://www.casadocodigo.com.br/products/livro-cucumber-rspec-tdd-bdd","nome":"Cucumber e RSpec: Construa aplicações Ruby com testes e especificações","img":"/covers/cucumber-rspec-tdd-bdd-featured_large.png?v=1411488288","nomeExibicao":"Cucumber e RSpec","title":"Cucumber e RSpec","sub":"Construa aplicações Ruby com testes e especificações","author":"Hugo Baraúna","content":"Todo o desenvolvedor Ruby precisa saber testar suas aplicações. Ruby é, sem dúvida, uma das linguagens mais produtivas que existem e, quando aliada ao poderoso framework Rails, nos permite criar aplicações complexas de forma muito rápida. Porém, é preciso garantir que essas aplicações continuem de fácil manutenção com o passar do tempo e que tenhamos um código de qualidade. Por isso, é primordial que qualquer rubista saiba testar suas aplicações.\n\nO Cucumber e o RSpec fornecem ao desenvolvedor as ferramentas necessárias para criar uma aplicação robusta e bem testada, onde você pode seguir tanto o TDD como o BDD. Neste livro, Hugo Baraúna, experiente desenvolvedor Ruby, ensina como você pode criar suas aplicações Ruby de forma testável e sem complicações.","category":"Programação","subcategory":"Outros"},{"url":"https://www.casadocodigo.com.br/products/livro-nodejs","nome":"Aplicações web real-time com Node.js","img":"/covers/node-ebook-atualizado_large.jpg?v=1516282095","nomeExibicao":"Node.js","title":"Aplicações web real-time com Node.js","sub":"","author":"Caio Ribeiro Pereira","content":"Node.js é uma poderosa plataforma. Ele permite escrever aplicações JavaScript no server-side, tirando proveito da sintaxe e familiaridade da linguagem para escrever aplicações web escaláveis.\n\nComo o Node.js usa um modelo orientado a eventos, focado em I/O não bloqueante, desenvolver nele pode ser diferente para quem está acostumado às aplicações web tradicionais. Neste livro, Caio Ribeiro Pereira quebra essa enorme barreira, mostrando claramente essa mudança de paradigma, além de focar em tópicos importantes, as APIs principais e frameworks como o Express e o Socket.IO.","category":"Programação","subcategory":"Outros"},{"url":"https://www.casadocodigo.com.br/products/livro-rust","nome":"Rust: Concorrência e alta performance com segurança","img":"/covers/OkxDC_Jtm1vRucUKmb0tiQCh6LpslM-vEJ51KRVyvgg_large.jpg?v=1512710194","nomeExibicao":"Rust","title":"Rust","sub":"Concorrência e alta performance com segurança","author":"Marcelo Castellani","content":"Quando falamos em linguagens de programação voltadas à construção de sistemas que exigem performance e agilidade, Rust tem ganhado muita notoriedade. Ela foi feita para ser segura a ponto de possibilitar uma concorrência limpa sem a famigerada race condition. Trata-se de uma linguagem open source multiparadigma, sendo uma ótima alternativa ao C++.\nNeste livro, Marcelo Castellani mostra por que Rust encaixa-se perfeitamente neste momento de busca por tecnologias capazes de efetuar processamento rápido e paralelo, para o desenvolvimento de ferramentas que exigem performance, como sistemas embarcados e aplicativos de servidor. Você vai aprender na prática conceitos como traits, vetores, generics, macros, entre outros, chegando aos testes e à compilação final do código. Com Rust, você será capaz de escrever sistemas complexos, de alta performance, robustos e seguros.","category":"Programação","subcategory":"Outros"},{"url":"https://www.casadocodigo.com.br/products/livro-ruby","nome":"Ruby: Aprenda a programar na linguagem mais divertida","img":"/covers/ruby-featured_large.png?v=1411567284","nomeExibicao":"Ruby","title":"Ruby","sub":"Aprenda a programar na linguagem mais divertida","author":"Lucas Souza","content":"O mercado das linguagens de programação está cada vez mais pulverizado e as linguagens, que antes eram mainstream, hoje dividem a atenção dos desenvolvedores com outras alternativas. Uma delas é o Ruby, poderosa linguagem criada para satisfazer o desejo de possibilitar a criação de código bonito e elegante.\n\nMuitos desenvolvedores já a adotaram e recomendam. Agora é a sua vez! Comece a aprender desde já!","category":"Programação","subcategory":"Outros"},{"url":"https://www.casadocodigo.com.br/products/livro-ruby-on-rails","nome":"Ruby on Rails: coloque sua aplicação web nos trilhos","img":"/covers/ruby-on-rails-featured_large.png?v=1411567203","nomeExibicao":"Rails 4","title":"Ruby on Rails","sub":"coloque sua aplicação web nos trilhos","author":"Vinícius Baggio Fuentes","content":"Mais que um tutorial, um livro que ensina tudo o que você precisa sobre o Ruby on Rails 4.\n\nNão perca tempo com frameworks arcaicos e burocráticos. O Ruby on Rails, um dos frameworks mais populares do mercado brasileiro e do mundo, é ágil, completo e não fica no seu caminho, ajudando-o a focar no que é importante: o seu negócio.\n\nAprenda como construir uma aplicação do início ao fim, usando todos os benefícios do framework, sem mágica. Você vai aprender como fazer as principais funcionalidades presentes na maioria das aplicações web, como cadastro, autenticação e autorização de usuários, envio de e-mails, buscas, internacionalização e segurança. Tudo isso de maneira profissional, com código manutenível e usando as melhores práticas do desenvolvimento de software.\n\nFocado na versão 4 do Rails!","category":"Programação","subcategory":"Outros"},{"url":"https://www.casadocodigo.com.br/products/vale-presente","nome":"Vale presente Casa do Código","img":"/covers/vale-presente-CDC_large.png?v=1451330431","nomeExibicao":"Vale Presente","title":"Vale presente Casa do Código","sub":"","author":"Casa do Código","content":"É sempre difícil escolher algo para seu amigo que trabalha com tecnologia. A Casa do Código possui um acervo de livros e e-books que vai agradar a todos. Não perca mais seu tempo escolhendo o presente de aniversário e de natal de seu colega.\nO presenteado pode também optar pelo livro impresso, o valor do vale presente só não abate o frete.\nAssim que você realizar a compra do vale presente, basta acessar http://valepresente.casadocodigo.com.br e preencher os dados para presentear seu amigo!","category":"Programação","subcategory":"Outros"},{"url":"https://www.casadocodigo.com.br/products/livro-oauth","nome":"OAuth 2.0: Proteja suas aplicações com o Spring Security OAuth2","img":"/covers/eBook-OAuth-2.0_large.jpg?v=1506712443","nomeExibicao":"OAuth 2.0","title":"OAuth 2.0","sub":"Proteja suas aplicações com o Spring Security OAuth2","author":"Adolfo Eloy","content":"Quando se trata de proteger os recursos de uma aplicação, é comum utilizar OAuth. Ainda assim, percebe-se que ainda existe bastante confusão a respeito dele, havendo até cenários de brechas em sistemas grandes devido ao mau uso da tecnologia. OAuth 2.0 é um protocolo ou um framework? Será que deve ser usado para autenticação ou autorização?\nNeste livro, Adolfo Eloy vem desmistificar essas perguntas, em uma mescla de teoria e prática, alertando para a importância do uso seguro da tecnologia. Por meio de uma aplicação de exemplo, você aprenderá os principais componentes presentes no fluxo do OAuth 2.0, como Resource Owner, Client, Resource Server e Authorization Server, acompanhando diferentes cenários de utilização do protocolo, nos pontos cruciais de segurança da sua aplicação.","category":"Programação","subcategory":"Outros"},{"url":"https://www.casadocodigo.com.br/products/livro-primeiros-passos-node","nome":"Primeiros passos com Node.js","img":"/covers/A9gNBliLeLHKixKHk4vm7GHXPqyOGTLwmaxbQbpHd5A_large.jpg?v=1498158325","nomeExibicao":"Primeiros passos com Node.js","title":"Primeiros passos com Node.js","sub":"","author":"João Rubens","content":"Nos arredores das comunidades de desenvolvimento de sistemas, principalmente aquelas relacionadas ao desenvolvimento web e mobile, muito se tem falado sobre aplicações escaláveis, serviços real-time, microsserviços, componentização e segurança nos últimos anos. O Node.js é uma ferramenta que surgiu nos moldes deste cenário, e ganhou espaço por conta de diversas características que veremos neste livro. Sem dúvidas, é uma tecnologia que veio para ficar. \n\nNeste livro, João Rubens tem como principal objetivo apresentar conhecimentos teóricos de nível básico e intermediário sobre Node.js, que habilite o leitor a compreender cenários em que essa tecnologia possa ser aplicada. Você acompanhará uma série de exemplos sobre o uso de Node.js e suas tecnologias associadas à configuração e utilização de um servidor web. Esses conceitos habilitam o leitor a desenvolver aplicações web server-side a partir do zero, trazendo os fundamentos da tecnologia como apoio. Ao fim da leitura, você estará apto a:\n\n* Utilizar o framework de aplicativos web Express;\n\n* Utilizar o módulo nodemon para watch de processos;\n\n* Criar e configurar Middlewares;\n\n* Aplicar o nunjucks como template engine de páginas web;\n\n* Aplicar o módulo passport para autenticação de usuários;\n\n* Utilizar sistemas gerenciadores de banco de dados SQL (MySQL) e NoSQL (MongoDB) com Node.js;\n\n* Realizar deploy de uma aplicação construída do início em um serviço de Cloud.","category":"Programação","subcategory":"Outros"},{"url":"https://www.casadocodigo.com.br/products/livro-dsl","nome":"DSL: Quebre a barreira entre desenvolvimento e negócios","img":"/covers/ed1YIZAA4ox3jKxh2EeUSYMiJu7W4tM0paCt2R7sDoo_large.jpg?v=1497039745","nomeExibicao":"DSL","title":"DSL","sub":"Quebre a barreira entre desenvolvimento e negócios","author":"Leonardo Otto","content":"Existe um ponto de vista que diz que a profissão de programação é uma profissão de tradução. Estamos sempre traduzindo o que os especialistas estão dizendo para uma língua que os computadores entendam. Ou seja, capturamos as ideias de especialistas, as completamos (pois normalmente eles eliminam detalhes) e traduzimos para outra linguagem. Manter o código o mais próximo dos conceitos dos especialistas é um passo importante, mas este passo pode ser expandido ainda mais com o uso de DSLs - Linguagens Específicas de Domínio.\nNeste livro, Leonardo Otto vai lhe ensinar como utilizar e criar DSLs internas para obter um código mais expressivo. Você expandirá sua capacidade de criar softwares mais simples, mais comunicativos e com melhor manutenção, a partir do principal valor das DSLs: resolver apenas um problema de domínio da forma mais clara possível, trazendo uma interface mais humana para os usuários finais.","category":"Programação","subcategory":"Outros"},{"url":"https://www.casadocodigo.com.br/products/livro-fragmentos","nome":"Fragmentos de um programador: Artigos e insights da carreira de um profissional","img":"/covers/fK8PXm9P9bBjSdR_ayFDiKZwmyPJYH1Ayu6lOML3mSw_large.jpg?v=1477630013","nomeExibicao":"Fragmentos de um programador","title":"Fragmentos de um programador","sub":"Artigos e insights da carreira de um profissional","author":"Phil Calçado","content":"As calorosas discussões no GUJ suscitaram em Phil Calçado o interesse em escrever regularmente sobre as dúvidas mais frequentes daquele fórum, contribuindo para a comunidade da computação e para o meio acadêmico. Seus artigos ganharam destaque em palestras e são frequentemente utilizados como referências na literatura e em pesquisas da área.\n\nNeste livro, a Casa do Código reúne os artigos mais importantes de Phil Calçado, que são leitura obrigatória até hoje para qualquer desenvolvedor de software de respeito, junto com a tradução inédita para o português de publicações mais recentes do autor. Você vai colher opiniões e vários insights sobre design de software, integração de sistemas, Orientação a Objetos, Domain-Driven Design, microsserviços e muito mais.","category":"Programação","subcategory":"Outros"},{"url":"https://www.casadocodigo.com.br/products/colecao-comece-a-programar","nome":"Coleção Comece a Programar","img":"/covers/casadocodigo-colecao-comece-programar_large.png?v=1470959480","nomeExibicao":"Coleção Comece a Programar","title":"Coleção Comece a Programar","sub":"","author":"Jonathan Lamim, Paulo Silveira, Adriano Almeida, Evaldo Junior Bento","content":"Começar no mundo da programação pode abrir portas, tanto de conhecimento, como para a sua carreira. E mais ainda, com pouco tempo produzir algo que realmente funciona é recompensador.\nEssa sequência foi pensada para você que quer começar, rapidamente, a construir seus primeiros sites e sistemas web. Iniciando pela Lógica de Programação, passando pelo aprendizado da linguagem PHP e os conceitos básicos para se trabalhar com bancos de dados para em seguida partir para o CodeIgniter, poderosa ferramenta que traz uma imensa produtividade no dia a dia do programador.\nCom esses 3 livros você estará nas mãos de autores experientes e focados em te fazer praticar desde as primeiras páginas.Veja o sumário completo dos livros: PHP e MySQL, Lógica de Programação e CodeIgniter.","category":"Programação","subcategory":"Outros"},{"url":"https://www.casadocodigo.com.br/products/livro-plataforma-microsoft","nome":"Desenvolvimento efetivo na plataforma Microsoft: Como desenvolver e suportar software que funciona","img":"/covers/O88xLPJUi5p4RfPTs3gqB6CdU2-F7du4E2Xku88E6As_size_mode_3_size_1280x960_large.jpeg?v=1462562886","nomeExibicao":"Desenvolvimento Microsoft","title":"Desenvolvimento efetivo na plataforma Microsoft","sub":"Como desenvolver e suportar software que funciona","author":"Time de Suporte Microsoft Modern Apps","content":"Os Engenheiros de Suporte Microsoft em Modern Apps têm a oportunidade de trabalhar com sistemas críticos nas maiores companhias do mundo dos mais diversos segmentos. Ao longo dos anos, estes profissionais qualificaram-se no desenvolvimento e suporte baseando-se nas recomendações dos produtos e em boas práticas vivenciadas nas experiências de campo. Trabalhando lado a lado com os clientes, compartilhando conhecimento com milhares de times de desenvolvimento e auxiliando cada pessoa e cada organização a atingir todo o seu potencial.\n\nCom foco em DevOps, .NET Framework, IIS (Internet Information Services) e Microsoft Azure, desenvolvedores e arquitetos estarão aptos a aperfeiçoar a qualidade e disponibilidade de seu software, aumentar seu nível de maturidade em desenvolvimento, economizar tempo e reduzir custos.","category":"Programação","subcategory":"Outros"},{"url":"https://www.casadocodigo.com.br/products/livro-design-paterns-php","nome":"Design Patterns com PHP 7: Desenvolva com as melhores soluções","img":"/covers/cover_755a35d9-dd95-4aff-b5dc-252904532bf7_large.jpg?v=1527274139","nomeExibicao":"Design Patterns com PHP 7","title":"Design Patterns com PHP 7","sub":"Desenvolva com as melhores soluções","author":"Gabriel Anhaia","content":"Do inglês Design Patterns, os Padrões de Projeto podem ser definidos como modelos de soluções para algum problema específico encontrado frequentemente dentro de um projeto de software. Com eles, conseguimos desenvolver sistemas mais modulares, expansíveis, reutilizáveis e com mais flexibilidade. Atualmente, dominá-los é considerada uma skill fundamental para qualquer desenvolvedor.\nNeste livro, Gabriel Anhaia apresenta os mais variados tipos de Padrões de Projeto, da forma mais objetiva e clara possível. São apresentadas as melhores soluções para problemas específicos encontrados constantemente na vida de um desenvolvedor de software e suas boas práticas. Você verá suas descrições, problemas reais que cada padrão se propõe a resolver, diagramas e dicas, com uma parte prática para aplicá-lo. Para você que já tem algum conhecimento em Orientação a Objetos e trabalha com a linguagem PHP, certamente conhecer Design Patterns é seu próximo passo para levar a qualidade dos seus projetos a um outro nível.","category":"Programação","subcategory":"PHP"},{"url":"https://www.casadocodigo.com.br/products/livro-php-zend","nome":"Do PHP ao Zend Framework: Domine as boas práticas","img":"/covers/Etu3wiG3JfYmXCSDHyZNeuIRALuu935zHiDkUwJu1zc_large.jpg?v=1521829030","nomeExibicao":"Livro de PHP com Zend Framework","title":"Do PHP ao Zend Framework","sub":"Domine as boas práticas","author":"Flávio Lisboa","content":"Todo software passa por algum tipo de manutenção ao longo de sua vida. Por isso, é bom ter uma ferramenta para nos ajudar a criar programas fáceis de manter. É o que Zend Framework faz para a linguagem de programação PHP, usando o paradigma da Orientação a Objetos. Zend Framework 3 é um framework de código aberto para o desenvolvimento de aplicações e serviços Web com PHP, que segue uma filosofia de componentes use quando quiser.\nNeste livro, Flávio Lisboa se dirige a quem quer aprender Zend Framework 3 de verdade. Se você quer realmente aprender a programar em PHP e quer desenvolver com componentes reutilizáveis que podem ser adaptados às suas necessidades – pensando no melhor compromisso entre controle e desempenho –, este é o livro certo. Você verá como aplicar o padrão MVC com ZF3, abordando os componentes Zend\\Mvc, Zend\\View, e o componente de geração de formulários dinâmicos, o Zend\\Form, além de vários padrões e recomendações de desenvolvimento gerais e orientados para PHP.\nAs versões das ferramentas utilizadas no livro são: Zend Framework 3, PHP 5.6 ou 7 e Zend Eclipse PDT 12","category":"Programação","subcategory":"PHP"},{"url":"https://www.casadocodigo.com.br/products/colecao-codeigniter-zend-php","nome":"Coleção CodeIgniter + Zend PHP","img":"/covers/Colecao_CDC-CodeIgniter_Zend_large.jpg?v=1484687743","nomeExibicao":"Coleção CodeIgniter + Zend PHP","title":"Coleção CodeIgniter + Zend PHP","sub":"","author":"Jonathan Lamim, Matheus Marabesi, Michael Douglas","content":"CodeIgniter\nO CodeIgniter 3.x é um framework MVC open source, escrito em PHP e mantido atualmente pelo British Columbia Institute of Technology e por uma grande comunidade de desenvolvedores ao redor do mundo. Com ele, é possível desenvolver sites, APIs e sistemas das mais diversas complexidades, tudo de forma otimizada, organizada e rápida. Suas bibliotecas nativas facilitam ainda mais o processo de desenvolvimento, e ainda permitem ser estendidas para que o funcionamento se adapte à necessidade de cada projeto.\n\nNeste livro, você vai criar dois projetos completos, aplicando recursos, bibliotecas, vendo dicas de teoria e boas práticas com o framework CodeIgniter 3.x . Com os conhecimentos adquiridos aqui, você será capaz de desenvolver sites e sistemas com qualidade e rapidez.\nZend Certified Engineer\n\nA certificação na carreira de um profissional de TI é muito valiosa. Ela é capaz de colocar o profissional que a possui na frente de muitos no mercado de trabalho, tornando a busca para uma nova oportunidade ou recolocação muito mais rápida. As vantagens não param por aí: ter uma certificação agrega muito o currículo e é um bom argumento para ter um aumento na remuneração, e dar aquela valorizada na hora de fazer o seu preço.\n\nNeste livro, Matheus Marabesi e Michael Douglas ensinam todos os conceitos necessários para você entrar para o restrito grupo dos desenvolvedores com a certificação Zend. Você vai dominar como funcionam as nuances da linguagem, indo desde o conhecimento de simples estruturas de controle, manipulação de XMLS até segurança, tudo isso por meio de explicações teóricas e exercícios práticos.\nAproveite o desconto de 15% nesses 2 e-books e melhore a qualidade do código dos seus projetos.Veja o sumário completo dos livros: CodeIgniter e Zend Certified Engineer","category":"Programação","subcategory":"PHP"},{"url":"https://www.casadocodigo.com.br/products/livro-code-igniter","nome":"CodeIgniter: Produtividade na criação de aplicações web em PHP","img":"/covers/QtkUR6Crnu_Be5pS0hEiryIgiEVBW_PJO2xG3JZtQDQ_size_mode_3_size_1024x768_large.jpeg?v=1461959497","nomeExibicao":"CodeIgniter","title":"CodeIgniter","sub":"Produtividade na criação de aplicações web em PHP","author":"Jonathan Lamim Antunes","content":"O CodeIgniter 3.x é um framework MVC open source, escrito em PHP e mantido atualmente pelo British Columbia Institute of Technology e por uma grande comunidade de desenvolvedores ao redor do mundo. Com ele, é possível desenvolver sites, APIs e sistemas das mais diversas complexidades, tudo de forma otimizada, organizada e rápida. Suas bibliotecas nativas facilitam ainda mais o processo de desenvolvimento, e ainda permitem ser estendidas para que o funcionamento se adapte à necessidade de cada projeto.\n\nNeste livro, você vai criar dois projetos completos, aplicando recursos, bibliotecas, vendo dicas de teoria e boas práticas com o framework CodeIgniter 3.x . Com os conhecimentos adquiridos aqui, você será capaz de desenvolver sites e sistemas com qualidade e rapidez.","category":"Programação","subcategory":"PHP"},{"url":"https://www.casadocodigo.com.br/products/livro-certificacao-php","nome":"Zend Certified Engineer: Descomplicando a certificação PHP","img":"/covers/f7mrqKK-ihQQVJJT3EqE0PoFQk7_7_Hh5YPSj8uFSj8_size_mode_3_size_800x600_large.jpeg?v=1461353863","nomeExibicao":"Certificação PHP","title":"Zend Certified Engineer","sub":"Descomplicando a certificação PHP","author":"Matheus Marabesi, Michael Douglas","content":"A certificação na carreira de um profissional de TI é muito valiosa. Ela é capaz de colocar o profissional que a possui na frente de muitos no mercado de trabalho, tornando a busca para uma nova oportunidade ou recolocação muito mais rápida. As vantagens não param por aí: ter uma certificação agrega muito o currículo e é um bom argumento para ter um aumento na remuneração, e dar aquela valorizada na hora de fazer o seu preço.\n\nNeste livro, Matheus Marabesi e Michael Douglas ensinam todos os conceitos necessários para você entrar para o restrito grupo dos desenvolvedores com a certificação Zend. Você vai dominar como funcionam as nuances da linguagem, indo desde o conhecimento de simples estruturas de controle, manipulação de XMLS até segurança, tudo isso por meio de explicações teóricas e exercícios práticos.","category":"Programação","subcategory":"PHP"},{"url":"https://www.casadocodigo.com.br/products/livro-laravel-php","nome":"PHP e Laravel: Crie aplicações web como um verdadeiro artesão","img":"/covers/laravel-featured_large.png?v=1432129716","nomeExibicao":"Laravel Framework","title":"PHP e Laravel","sub":"Crie aplicações web como um verdadeiro artesão","author":"Rodrigo Turini","content":"Está começando com frameworks PHP? Então, que tal criar sites e aplicações web, de forma extremamente produtiva, com código bem escrito, de fácil manutenção e organizado? Sim, isso é possível com o Laravel 5.1.\n\nNesse livro, Rodrigo Turini mostra os principais recursos do Laravel 5.1, um importante framework PHP para desenvolvimento web. Aprenda como escrever código elegante, simples e crie aplicações robustas e escaláveis em PHP.\n\nVoltado para iniciantes e seguindo uma didática prática, em poucas páginas você irá escrever suas primeiras funcionalidades e, em pouco tempo, terá um código funcionando e se comunicando com um banco de dados, e implementará funcionalidades reais.","category":"Programação","subcategory":"PHP"},{"url":"https://www.casadocodigo.com.br/products/livro-tdd-php","nome":"Test-Driven Development: Teste e Design no Mundo Real com PHP","img":"/covers/cover_ce399913-9822-4509-ab16-fad1cfad2df3_large.jpeg?v=1421769309","nomeExibicao":"TDD PHP","title":"Test-Driven Development","sub":"Teste e Design no Mundo Real com PHP","author":"Andre Cardoso, Mauricio Aniche","content":"Por que não testamos software? Porque é caro? Porque é demorado? Porque é chato? Testes automatizados são a solução para todos esses problemas. Aprenda a escrever um programa que testa seu programa de forma rápida, barata e produtiva, e aumente a qualidade do seu produto final.\n\nNeste livro, você aprenderá sobre TDD, uma das práticas ágeis de desenvolvimento de software mais populares. TDD faz o desenvolvedor escrever o teste antes mesmo de implementar o código. Essa simples inversão na maneira de se trabalhar faz com o que o desenvolvedor escreva um código mais testado, com menos bugs, e, inclusive, com mais qualidade. Seja profissional, teste seu software!\n\nTodos os exemplos desse livro foram escritos em PHP.","category":"Programação","subcategory":"PHP"},{"url":"https://www.casadocodigo.com.br/products/livro-php-mysql","nome":"Desenvolvimento web com PHP e MySQL","img":"/covers/cover_large.jpg?v=1477073475","nomeExibicao":"PHP e MySQL","title":"Desenvolvimento web com PHP e MySQL","sub":"","author":"Evaldo Junior Bento","content":"Imagine a internet na qual você pode apenas consumir conteúdos, como se fosse um jornal, uma revista, ou ainda, um programa na televisão. Chato, né? O segredo da famosa web 2.0 é a capacidade de interação entre as pessoas e os serviços online.\n\nAprenda com esse livro os primeiros passos para usar o PHP, uma ferramenta que possibilita a criação de páginas web dinâmicas. Veja também como integrar o PHP ao MySQL, um dos bancos de dados mais usados no mundo.\n\nA dupla PHP e MySQL é usada por diversos tipos de aplicações e sites, de blogs a portais de notícias e grandes redes sociais.","category":"Programação","subcategory":"PHP"},{"url":"https://www.casadocodigo.com.br/products/vale-presente","nome":"Vale presente Casa do Código","img":"/covers/vale-presente-CDC_large.png?v=1451330431","nomeExibicao":"Vale Presente","title":"Vale presente Casa do Código","sub":"","author":"Casa do Código","content":"É sempre difícil escolher algo para seu amigo que trabalha com tecnologia. A Casa do Código possui um acervo de livros e e-books que vai agradar a todos. Não perca mais seu tempo escolhendo o presente de aniversário e de natal de seu colega.\nO presenteado pode também optar pelo livro impresso, o valor do vale presente só não abate o frete.\nAssim que você realizar a compra do vale presente, basta acessar http://valepresente.casadocodigo.com.br e preencher os dados para presentear seu amigo!","category":"Programação","subcategory":"PHP"}]